# -*- coding: utf-8 -*-

import math
import os
import re
import shutil
import subprocess
# import threading
from collections import defaultdict
from random import random
import random
# import time as t
import tkinter as tk
from tkinter import scrolledtext, filedialog, ttk, simpledialog, messagebox
from datetime import datetime, timedelta
import configparser
# import imageio
# import pyautogui
import ctypes

import numpy as np
from PIL import Image, ImageTk, ImageSequence
import json
import pygame


# import apng

# import win32gui
# import win32con
# import win32api


# import logging

# logging.basicConfig(level=logging.DEBUG)  # 设置日志级别为 DEBUG

def create_folder(folder_path):
    try:
        os.makedirs(folder_path)
        print(f"文件夹 '{folder_path}' 创建成功")
    except FileExistsError:
        print(f"文件夹 '{folder_path}' 已经存在")


audio_list = {}
babel_on = False
frame_Map = 0
frames_map = {}
current_frame_map = {}
Is_fill = False
Is_square = False
Cards_list = {}
isOpeningFiles = False
Is_Opened = False
log_file_last_name = ""
is_hiding_health_bar = False
focused_NPC = ""
room_info_search = {}
room_info_list = {}


def play_audio(file_path, name, loops=-1):
    if file_path:
        pygame.mixer.init()
        # pygame.mixer.music.load(file_path)
        # pygame.mixer.music.play(loops = loops)
        sound = pygame.mixer.Sound(file_path)
        sound.play(loops=loops)
        if loops == -1:
            audio_list[name] = sound


def kill_audio(name):
    audio_list[name].stop()
    audio_list.pop(name)


# 例子：创建名为 'my_folder' 的文件夹在当前工作目录下
create_folder('AppSettings')
create_folder('Bots')
create_folder('GameSaves')
create_folder('Images')
create_folder('Images/AvatarImages')
create_folder('Images/IconImages')
create_folder('Images/SheetImages')
create_folder('Images/BattleImages')
create_folder('Images/MapMarkers')
create_folder('ReplayResources')
create_folder('ReplayResources/BG')
create_folder('ReplayResources/BGM')
create_folder('ReplayResources/SE')
create_folder('ReplayResources/FX')
create_folder('ReplayResources/HandOut')
create_folder('CardDecks')
create_folder('QuickSaves')

# 便于直接编辑的一系列字符串 一定要包括[成功/失败]，否则无法辨认（程序、用户角度）
string_list_Critical_Success = {"通用": ["￥.。.￥。￥.。\n是大成功！\n.￥.。.￥。.￥。", "这次是大成功！/微笑"]}
string_list_Extreme_Success = {"通用": ["（深呼吸）...极难成功！恭喜您！", "极难成功！恭喜您。"]}
string_list_Hard_Success = {"通用": ["困难成功！"]}
string_list_Success = {"通用": ["检定成功，期待您的表现。", "检定成功，请多加利用/微笑"]}
string_list_Failure = {"通用": ["失败了，请您不要灰心..."]}
string_list_Fumble = {"通用": ["嗯...抱歉，看起来是大失败呢..."]}
# 便于直接编辑的一系列字符串 - 妙语模块
mav_words = {"_mav_prob": 0.01, "通用": ["陛下所言甚是.../陶醉"], "沃姆": ["陛下所言甚是.../陶醉"]}
mav_prob = mav_words["_mav_prob"]  # 妙语概率

# 默认掷骰原因
reason_string_list = ["不可名状的原因", "懒得写原因", "", "", "", "", ""]  # 保留空白以提高不抽取的概率
reason_silent_string_list = ["不可告人的妙计", "想到了开心的事情", "KP的回眸一笑", "", "", ""]

# 星期文字翻译规范
datenamelist_ = {0: ["星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日"],
                 1: ["周一", "周二", "周三", "周四", "周五", "周六", "周日"],
                 2: ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"], "3": ["月", "火", "水", "木", "金", "土", "日"],
                 4: ["月曜日", "火曜日", "水曜日", "木曜日", "金曜日", "土曜日", "日曜日"],
                 5: ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]}
datenamelist = datenamelist_[1]
style_dice_icon = ["♡", "▣", "◈", "†", "‡"]
# 部分活字文字特效编辑 ♡▣◈†‡ xxx→因y掷骰◈技能
# 高亮
style_highlight_style = ["<color=#FFFF00><b><弹跳>【", "】</弹跳></b></color>"]  # 黄加粗，弹跳，保留【】
# 弱高亮
style_highlight_weak_style = ["<color=#FFFF00><b>[", "]</b></color>"]  # 黄加粗，保留[]
# 弱高亮2
style_highlight_weak_style2 = ["<color=#FFFF00><b>", "</b></color>"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
style_dice_reason_color = "→因<color=#FFFF00>"  # 黄
# 掷骰角色
style_dice_pcname_color = ["<color=#FFFF00>", "</color>"]  # 黄
# 掷骰技能
style_dice_skillname_style = [f"{style_dice_icon[2]}<弹跳><color=#FFFFFF>", "</color></弹跳>"]  # 白，弹跳

### 回声自动换行符（“#”）换行字数
EnterCharacters = 30
### 部分回声文字特效编辑HardCoding，开启富文本有效
# 震惊
style_shock_echo = ["[fg:#FFFFFF][b][bg:#FF0000]", "[/bg][/b][/fg]"]  # 黄加粗，弹跳，保留【】
# 弱化
style_weaken_echo = ["[fg:#FFFFFF70]", "[/fg]"]  # 黄加粗，弹跳，保留（）
# 高亮
style_highlight_style_echo = ["[fg:#000000][bg:#FFFF00][b]【", "】[/b][/bg][/fg]"]  # 黄加粗，弹跳，保留【】
# 弱高亮
style_highlight_weak_style_echo = ["[fg:#FFFF00][b][", "][/b][/fg]"]  # 黄加粗，保留[]
# 弱高亮2
style_highlight_weak_style2_echo = ["[fg:#FFFF00][b]", "[/b][/fg]"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
style_dice_reason_color_echo = "→因[fg:#FFFF00]"  # 黄
# 掷骰角色
style_dice_pcname_color_echo = ["[fg:#FFFF00]", "[/fg]"]  # 黄
# 掷骰技能
style_dice_skillname_style_echo = [f"{style_dice_icon[2]}[fg:#FFFFFF][bg:#000000]", "[/bg][/fg]"]  # 白，弹跳

# 部分回声文字特效编辑标签
# 震惊
# style_shock_echo = ["[震惊]", "[/震惊]"]  # 黄加粗，弹跳，保留【】
# 弱化
# style_weaken_echo = ["[弱化]", "[/弱化]"]  # 黄加粗，弹跳，保留（）
# 高亮
# style_highlight_style_echo = ["[高亮]【", "】[/高亮]"]  # 黄加粗，弹跳，保留【】
# 弱高亮
# style_highlight_weak_style_echo = ["[", "]"]  # 黄加粗，保留[]
# 弱高亮2
# style_highlight_weak_style2_echo = ["[", "]"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
# style_dice_reason_color_echo = "因[角色]"  # 黄
# 掷骰角色
# style_dice_pcname_color_echo = ["[角色]", "[/角色]"]  # 黄
# 掷骰技能
# style_dice_skillname_style_echo = ["[技能]", "[/技能]"]  # 白，弹跳

# 饮品列表
drink_list = ["椰子汁",
              "热红茶",
              "热柠檬茶",
              "黑咖啡",
              "炭烧咖啡",
              "卡布奇诺",
              "特浓咖啡",
              "绿茶",
              "莓果白茶",
              "石榴白茶",
              "黄茶",
              "黑茶",
              "伯爵灰茶",
              "冰咖啡",
              "伯爵奶茶",
              "贵夫人奶茶",
              "皇家红茶",
              "苔藓药茶",
              "椰香奶茶",
              "肉桂奶茶",
              "香草奶茶",
              "雪域薄荷",
              "蓝湖红茶",
              "热柠檬红茶",
              "榛果香茶",
              "咖啡红茶",
              "贵族红茶",
              "蓝调特色红茶",
              "冷翡翠绿茶",
              "麦香红茶",
              "玫瑰香茶",
              "水蜜桃冰绿茶",
              "杂果冰红茶",
              "锡兰茶",
              "甘菊茶",
              "蒲公英",
              "抹茶拿铁",
              "乌龙茶",
              "铁观音",
              "普洱茶",
              "菊花茶",
              "香片茶",
              "寿眉茶",
              "灰伯爵",
              "蜂蜜花草茶", "红酒",
              "威士忌",
              "白兰地",
              "龙舌兰",
              "朗姆酒",
              "伏特加",
              "金酒",
              "黑啤",
              "果啤",
              "白葡萄酒",
              "香槟",
              "荆球酒", "莫吉托",
              "长岛冰茶",
              "玛格丽特",
              "美态",
              "曼哈顿",
              "威士忌酸",
              "干马提尼",
              "白夫人",
              "特调荆球",
              "热巧克力",
              "热牛娜",
              "水",
              "矿泉水",
              "碳酸饮料",
              "酸奶",
              "运动饮料",
              "可乐",
              "冰淇淋饮品"]
# 音乐列表
music_list = ["原声带：游戏、电影、史诗",
              "电音：House、Trance、Techno、氛围、Dubstep、Drum&Bass、EDM、Trap",
              "流行",
              "嘻哈/说唱/DJ慢摇",
              "民谣",
              "东方：古风",
              "爵士",
              "金属/朋克：死亡金属、独立、英伦、流行",
              "轻音乐/古典：巴洛克、古典主义、浪漫主义",
              "另类/独立/实验性",
              "同人/二次元",
              "布鲁斯/蓝调",
              "雷鬼/摇滚",
              "曲艺/戏曲",
              "乡村",
              "舞曲"]
everyday_list = ["照顾搭档/他人",
    "在街上随意闲逛",
    "与搭档/他人一同生活",
    "与搭档/他人一起解决事件",
    "一直待在据点",
    "一味调查（自己）很感兴趣的事",
    "业余时做的事情得到表彰",
    "学习",
    "无意之中度过每一天",
    "为搭档/他人做饭",
    "日常过得并不顺利",
    "认真地干活",
    "倾心于最近所沉迷的兴趣",
    "企图离开搭档/他人身边",
    "目光无法从搭档/他人身上移开",
    "进行直播",
    "解决某些事件",
    "计划着与搭档/他人一同旅行",
    "回味与搭档/他人之间的回忆",
    "犯相思病",
    "发呆放空",
    "调查过去的事件",
    "打扫据点",
    "沉迷赌博",
    "尝试发展各种兴趣",
    "参与事件相关时遭遇闭门羹",
    "不认真地干活",
    "边吃边逛",
    "把据点弄得乱七八糟",
    "把搭档/他人放着不管"]
# 爱好列表
hobby_list = [
              "做分内事的人",
    "侦探",
    "愿意正视自己的人",
    "愿意喜欢上自己的人",
    "愿意理解自己的人",
    "与搭档/他人完全相反的人",
    "有钱人",
    "有地位的人",
    "一丝不苟的人",
    "像自己一样的人",
    "像搭档/他人一样的人",
    "随便谁都可以",
    "身体或脸长得好的人",
    "身体或脸符合喜好的人",
    "让人想引导的人",
    "让人放不下心的人",
    "能平稳心情的人",
    "能表现自我的人",
    "能变得平稳的人",
    "理性的人",
    "可靠的人",
    "大胆的人",
    "聪明的人",
    "充满刺激的人物",
    "并不愚蠢的人",
    "比自己厉害的人","同人制作", "击剑",
              "魔术（真实）",
              "木工/木工",
              "石雕",
              "蜡烛制作",
              "皮革工艺",
              "骑马",
              "造船",
              "讲故事",
              "算命",
              "金属加工",
              "打造剑或武器锻造",
              "符文占卜和符文制作",
              "射箭",
              "草药学",
              "制作玩偶",
              "糖果制作",
              "缝纫",
              "制作甜品",
              "绘画",
              "珠宝制作",
              "调制鸡尾酒",
              "博客/视频博客",
              "制皂",
              "编织或钩织",
              "十字绣或刺绣",
              "削木/木雕",
              "折纸",
              "诗歌",
              "编写故事",
              "撰写文章",
              "解谜",
              "天文学/观星",
              "编程",
              "黑客攻击",
              "在大自然中散步",
              "骑自行车",
              "观看纪录片",
              "黑客活动主义（将计算机黑客作为抗议形式）",
              "学术研究",
              "塔罗牌",
              "平面设计",
              "电子游戏",
              "视频博客/视频制作",
              "数字艺术",
              "唱歌",
              "制作数字音乐",
              "人工智能",
              "陶艺或雕塑",
              "巫术",
              "时装设计",
              "化妆/脸部彩绘",
              "真人扮演（Cosplay）",
              "冲浪",
              "帆船",
              "滑雪",
              "跑步",
              "远足",
              "桌游",
              "舞蹈：交谊舞(法式民间舞、踢踏舞)、宫廷舞(小步、华尔兹、波斯)、古典舞(拉丁：探戈-恰恰、芭蕾、慢狐步)、现代舞(爵士、迪斯科、摇摆舞)、当代舞(街舞、男女团)",
              "室内设计",
              "体操",
              "武术",
              "健身",
              "活动主义",
              "公开演讲",
              "辩论",
              "团体运动",
              "演奏乐器",
              "皮划艇或划船",
              "拳击或格斗",
              "旅行",
              "钓鱼",
              "烹饪",
              "烘焙",
              "瑜伽",
              "观鸟",
              "收集某物（例如，书籍，小人物，填充玩具，纪念品）",
              "园艺",
              "剪贴簿",
              "听音乐",
              "分析书籍/诗歌/歌词",
              "人格类型学（例如，MBTI，九型人格）",
              "学习新语言",
              "摄影",
              "看电视",
              "表演/戏剧",
              "唱歌",
              "高尔夫",
              "保龄球",
              "宾果游戏",
              "作为爱好写作",
              "阅读",
              "拿铁艺术",
              "学习魔术技巧",
              "木偶表演",
              "国际象棋",
              "标本制作（动植物、昆虫、化石等）",
              "啤酒酿造",
              "杂耍",
              "单口喜剧",
              "捉弄他人",
              "涂指甲",
              "气球艺术/搓绳",
              "绳结编织",
              "涂鸦",
              "书法",
              "养蜂",
              "露营",
              "模仿秀",
              "填字游戏",
              "跑酷",
              "滑轮溜冰",
              "车辆修复",
              "听播客",
              "溜冰",
              "志愿服务",
              "钢管舞",
              "撰写书评或影评",
              "日志/日记",
              "采摘鲜花",
              "野餐",
              "数独",
              "动画制作",
              "音乐列表收集",
              "出售他们创造的东西",
              "玩角色扮演游戏",
              "模特",
              "发型设计",
              "寻找和收集贝壳",
              "刺青",
              "蛋糕装饰",
              "化妆艺术",
              "节拍口技",
              "说唱",
              "极限运动（例如，跳伞或蹦极）",
              "插花",
              "哑剧"]
# 职业列表
career_list = [
    "Accountant 会计师",
    "Acrobat 杂技演员",
    "Actor 演员",
    "Agency Detective 事务所侦探",
    "Alienist 精神病医生（古典）",
    "Animal Trainer 动物训练师",
    "Antiquarian 文物学家（原作向）",
    "Antique Dealer 古董商",
    "Archaeologist 考古学家（原作向）",
    "Architect 建筑师",
    "Artist 艺术家",
    "Asylum Attendant 精神病院看护",
    "Assassin 刺客：参考罪犯",
    "Athlete 运动员",
    "Author 作家（原作向）",
    "Aviator 特技飞行员（古典）：参考飞行员",
    "Bank Robber 银行劫匪：参考罪犯",
    "Bartender 酒保",
    "Big Game Hunter 猎人",
    "Book Dealer 书商",
    "Bootlegger 打手：参考罪犯（参考走私者）",
    "Bounty Hunter 猎人",
    "Boxer/Wrestler 拳击手 / 摔跤手",
    "Burglar 窃贼：参考罪犯",
    "Butler/Valet/Maid 管家 / 男仆 / 女仆",
    "Chauffeur 私人司机：参考司机",
    "Clergy, Member of the 神职人员",
    "Computer Programmer 计算机程序员",
    "Computer Technician 计算机工程师",
    "Computer Hacker 黑客（现代）",
    "Conman 欺诈师：参考罪犯",
    "Cowboy/girl 牛仔",
    "Craftsperson 工匠",
    "Criminal 罪犯：参考黑帮",
    "Cult Leader 教团首领",
    "Deprogrammer 除魅师（现代）",
    "Designer 设计师",
    "Dilettante 业余艺术爱好者（原作向）",
    "Diver 潜水员",
    "Doctor of Medicine 医生 ( 原作向 ): 参考精神病学家",
    "Drifter 流浪者",
    "Driver 司机",
    "Editor 编辑",
    "Elected Official 政府官员",
    "Engineer 工程师",
    "Entertainer 艺人",
    "Explorer 探险家（古典）",
    "Farmer 农民",
    "Federal Agent 联邦探员",
    "Fence 赃物贩子",
    "Firefighter 消防员",
    "Foreign Correspondent 驻外记者",
    "Forensic Surgeon 法医",
    "Forger/Counterfeiter 赝造者、伪造者：参考罪犯",
    "Gambler 赌徒",
    "Gangster 黑帮",
    "Gun Moll 女飞贼（古典）：参考罪犯",
    "Gentleman/ Lady 绅士 / 淑女",
    "Hacker 黑客：参考计算机程序员",
    "Hobo 游民",
    "Hospital Orderly 勤杂护工",
    "Journalist 记者（原作向）",
    "Judge 法官",
    "Laboratory Assistant 实验室助理",
    "Laborer 工人",
    "Lawyer 律师",
    "Librarian 图书馆管理员（原作向）",
    "Lumberjack 伐木工：参考工人",
    "Maid 女仆：参考管家",
    "Mechanic(and Skilled Trades) 技师",
    "Military Officer 军官",
    "Miner 矿工：参考工人",
    "Missionary 传教士",
    "Mountain Climber 登山家",
    "Museum Curator 博物馆管理员",
    "Musician 音乐家",
    "Nurse 护士",
    "Occultist 神秘学家（原作向）",
    "Outdoorsman/Outdoorswoman 旅行家",
    "Parapsychologist 超心理学家",
    "Pharmacist 药剂师",
    "Photographer 摄影师",
    "Photojournalist 摄影记者：参考摄影师",
    "Pilot 飞行员：参考特技飞行员",
    "Police Detective/Officer 警察与警探（原作向）",
    "Private Investigator 私家侦探",
    "Professor 教授（原作向）",
    "Prospector 淘金客",
    "Prostitute 性工作者",
    "Psychiatrist 精神病学家",
    "Psychologist 心理学家",
    "Psychoanalyst 心理分析学家",
    "Reporter 通讯记者：参考记者",
    "Researcher 研究员",
    "Sailor 海员",
    "Salesperson 推销员",
    "Scientist 科学家",
    "Secretary 秘书",
    "Shopkeeper 店老板",
    "Smuggler 走私者：参考罪犯",
    "Soldier/Marine 士兵、海军陆战队士兵",
    "Spy 间谍",
    "Street Punk 混混：参考罪犯",
    "Student/Intern 学生、实习生",
    "Stuntman 替身演员",
    "Taxi Driver 出租车司机：参考司机",
    "Thug 暴徒：参考罪犯",
    "Tribe Member 部落成员",
    "Undertaker 殡葬师",
    "Union Activist 工会活动家",
    "Valet 男仆：参考管家",
    "Waitress/Waiter 服务生",
    "White-collar Worker 白领工人",
    "Zealot 狂热者",
    "Zookeeper 饲养员",
    "Clerk/Executive 职员、主管",
    "Criminal (Freelance/solo) 独行罪犯",
    "Film Star 电影演员",
    "Gangster Boss 黑帮老大",
    "Gangster Underling 黑帮马仔",
    "Investigative Journalist 调查记者",
    "Laborer, Unskilled 非熟练工人",
    "Middle/Senior Manager 中层、高层管理人员",
    "Police Detective 警探",
    "Sailor, Naval 军舰海员",
    "Sailor, Commercial 民用船海员",
    "Stage Actor 戏剧演员",
    "Uniformed Police Officer 警官",
    "【1】\n【自定义职业】\n【信誉】：?\n【职业属性】：教育×4\n【本职技能】：不多于8个【本职技能】。\n【介绍】：\n在【职业属性】中输入第二【职业属性】的数值（留空则视为EDU"
    "）并自行设置起始【信誉】。使用自定义职业前，请先咨询你的守秘人",
    "【2】\n【会计师】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，聆听，说服，侦查，任意其他两项个人或时代特长。\n【介绍】：\n会计师可能在企业工作或作为自由会计师，为个体经营者和企业客户担任顾问。他们是优秀的研究者，既勤奋又关注细节，能够通过仔细分析个人和企业交易记录、财务报表和其他记录支援其他调查员。",
    "【3】\n【杂技演员】\n【信誉】：9-20\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：攀爬，闪避，跳跃，投掷，侦查，游泳，任意两项其他个人或时代特长。\n【介绍】：\n杂技演员可能是参加各级比赛（甚至奥运会）的业余运动员，也可能是专业的演员，在马戏团、嘉年华、歌舞团之类的地方作为娱乐业从业者工作。",
    "【4】\n【演员-戏剧演员】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演），乔装，格斗，历史，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n在1920年代，虽然全国都有大型剧院，美国的戏剧中心仍然是纽约城。英国的情况与之相近，戏剧的中心在伦敦，其他的剧团则在各郡作巡回演出。巡回剧团乘火车旅行，演出内容既包括新编剧目，也包括莎士比亚和其他人的传统剧目。有些剧团也会花时间去国外采风，通常是去加拿大夏威夷澳大利亚和欧洲大陆。",
    "【5】\n【演员-电影演员】\n【信誉】：20-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演），乔装，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长（如骑乘或格斗）。\n【介绍】：\n许多演员有相当深厚的文化素养，认为自己才是“正统”的，倾向于轻视电影业的商业活动。直到 20 世纪后期电影业的地位提高，电影演员的薪酬增加，这种情况才发生改变。电影业和电影明星一直是世界人民关注的焦点。许多明星一夜成名，在媒体的聚光灯下过着光鲜亮丽的生活。",
    "【6】\n【事务所侦探、保安】\n【信誉】：20-45\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：一项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），射击，法律，图书馆，心理学，潜行，追踪。\n【介绍】：\n世界上有许多著名的侦探机构，其中最著名的是平克顿和伯恩斯调查局（后来合并成一家公司）。这样的公司一般有两类工作人员：安保人员和调查人员。企业或个人雇用安保人员来保护自己的资产和人员免受盗贼刺客和绑匪的威胁。这些安保人员角色使用巡警的职业模板。调查人员则是便衣侦探，负责为公司客户解决各种异常事件阻止谋杀事件寻找失踪的人员等等。",
    "【7】\n【精神病医生（古典）】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：法律，聆听，医学，外语，精神分析，心理学，科学（生物学，化学）。\n【介绍】：\n在1920年代，“精神病医生”这个词专用来称呼治疗精神失常的医生（也就是早期的精神科医生）。精神分析在当时的美国鲜为人知，而且它的基本内容都是性生活和如厕训练之类令大众不齿的东西。精神病学，一种正规的从行为主义发展来的医学理论则要普及得多。精神病医生精神科医生和神经科医生还经常爆发激烈的论战。",
    "【8】\n【动物训练师】\n【信誉】：10-40\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：跳跃，聆听，自然，心理学，科学（动物学），潜行，追踪，任意一项其他个人或时代特长。\n【介绍】：\n动物训练师可能在电影工作室巡回马戏团马厩工作或自由工作。不管是训练导盲犬狮子钻火圈，他们工作时基本要独自一人长时间近距离地照看这些动物。动物训练师可以像对人一样对动物使用「心理学」技能。",
    "【9】\n【文物学家（原作向）】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：估价，技艺（任一），历史，图书馆，外语，一项社交技能（魅惑、话术、恐吓、说服），侦查，任意一项其他个人或时代特长。\n【介绍】：\n文物学家也许是调查员可以从事的最具有洛夫克拉夫特风格的职业：那些历久弥新的的卓越作品湮没在古代传说中的神奇力量，总能使他们乐在其中。独立的收入使文物学家能够研究古旧晦涩的文物，或者根据自己的兴趣爱好集中探寻特别的种类。他们通常有着欣赏的眼光敏锐的头脑，和讽刺无知自大贪婪者的愚蠢时尖酸刻薄的幽默。",
    "【10】\n【古董商】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：会计，估价，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，导航。\n【介绍】：\n古董商通常自己开店，从自己所在的地方转卖物品，或继续扩展业务范围，通过倒卖物品到城市商店赚取利润。",
    "【11】\n【考古学家（原作向）】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：估价，考古，历史，外语，图书馆，侦查，机械维修，导航或科学（任一：如化学、物理、地理等）。\n【介绍】：\n考古学家研究探索历史的痕迹。主要来说，是对人类历史相关的物质资料进行各种鉴识检查分析。这项工作包含辛苦细致的研究，更不必提情愿亲自下斗铲土的决心。在1920年代，成功的考古学家会被当成著名冒险家与探险家，名利双收。有人运用科学方法考古，不过更多的人对付老祖宗的秘密时喜好暴力破解的办法，甚至祭出炸药，这种碉堡了的办法现代人可是很难看得惯的。",
    "【12】\n【建筑师】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，技艺（技术制图），法律，母语，计算机或图书馆，说服，心理学，科学（数学）。\n【介绍】：\n建筑师掌握设计和营造建筑的知识，不论是个人房屋的改造还是造价数百万美元的地标工程。建筑师与项目经理紧密合作，负责监督施工全程。建筑师必须了解当地的规划法律，健康和安全法规，和基础的公众安全原则。他们既可以在大公司工作，也可以自由工作，这在很大程度上取决于【信誉】。在1920年代，许多人尝试在自家或小办公室单干。",
    "【13】\n【艺术家】\n【信誉】：9-50\n【职业属性】：教育×2＋敏捷或意志×2\n【本职技能】：技艺（任一），历史或自然，一项社交技能（魅惑、话术、恐吓、说服），外语，心理学，侦查，任意两项其他个人或时代特长。\n【介绍】：\n艺术家在这里可以是画家，雕塑家等等。他们有时沉浸于自己虚幻的想象当中，有时又沐浴在激发热情和理解的灵感之下。不论是否天资优秀，艺术家的内心必须足够强大，这样才能战胜生涯起步时的障碍和挑剔的眼光，并且在自己小有名气以后继续努力。有些艺术家对物质生活是否丰富并不在乎，而有些则有着强烈的创业倾向。",
    "【14】\n【精神病院看护】\n【信誉】：8-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，格斗（斗殴），急救，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，潜行。\n【介绍】：\n尽管少数富有的人会选择私人疗养院，大多精神病患者最终会被安置到州县设置的定点医院。这些地方除了医生护士以外，还会有一支看护队伍。选聘看护的时候，力量和体格往往比医学知识更被看重。",
    "【15】\n【运动员】\n【信誉】：9-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），骑乘，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。\n【介绍】：\n运动员可能效力于职业的棒球足球板球或者篮球队伍。这支队伍也许是大联盟队伍，有着稳定工资，参加的比赛万人瞩目；或者是众多小联盟队伍之一，尤其是在1920年代的棒球界。这些队伍往往寄于大联盟队伍篱下，各方面都受其管理，工资更是刚够运动员糊口又不至于让他们跳槽的水平。成功的运动员在自己的专业领域也会拥有相当的声誉。",
    "【16】\n【作家（原作向）】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（文学），历史，图书馆，自然或神秘学，外语，母语，心理学，任意一项其他个人或时代特长。\n【介绍】：\n作家不同于记者，他们用文字定义和探讨人们的社会生活，尤其是人们的情感变化。他们的劳动通常孤立而又自我中心：虽然以前写作是个能稳拿工资的行当，但如今只靠写作发大财的人屈指可数。作家的工作习惯相差极大。通常作家们会花费数月乃至数年的时间调查取材，为新书的创作做准备；然后闭门谢客，投入紧张的创作。",
    "【17】\n【酒保】\n【信誉】：8-25\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），聆听，心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n酒保虽然不一定是酒吧的掌柜，却一定是所有客人的朋友。对客人们的好声气，一部分来说是出于他们的职业或者业务，而更多的来说则是达到目的的一种手段。1920年代，由于禁酒令的存在，酒保变成了非法的职业；但是遍地开花的黑酒吧又不能没有酒保，结果就是酒保仍然不愁找不到活干。",
    "【18】\n【猎人】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：射击，聆听或侦查，自然，导航，外语或生存（任一），科学（生物学或植物学），潜行，追踪。\n【介绍】：\n猎人是优秀的追踪者和狩猎者，通常靠为富裕的客户捕猎为生。绝大多数猎人会对地球上某一个部分的情况烂熟于心，比如加拿大森林非洲草原等等。有些人可能从事盗猎活动，例如为私人收藏家捕捉珍稀动物，或者贩卖受保护的动物和违反道德的动物制品，如兽皮象牙之类.",
    "【19】\n【书商】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：会计，估价，汽车驾驶，历史，图书馆，母语，外语，一项社交技能（魅惑、话术、恐吓、说服）。\n【介绍】：\n书商可能拥有自己的店面或者利基（小众）邮购服务，也可能辗转全国甚至海外专门经销书籍。许多人拥有富有的，能提供利润丰厚又稀罕的工作的固定客户。",
    "【20】\n【赏金猎人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电子学或电气维修，格斗或射击，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，追踪，潜行。\n【介绍】：\n赏金猎人捉拿罪犯并将他们交给正义去审判。最常见的情况是受保释人的委托去缉捕逃狱者。赏金猎人们为了自己的猎物可以不择手段，几乎不会考虑其他人的正当权益之类细枝末节的东西。非法闯入威胁肢体暴力，都是赏金猎人屡试不爽的秘技。现在这些秘技还包括了电话窃听黑客操作和其他的秘密监控。",
    "【21】\n【拳击手、摔跤手】\n【信誉】：9-60\n【职业属性】：教育×2＋力量×2\n【本职技能】：闪避，格斗（斗殴），恐吓，跳跃，心理学，侦查，任意两项其他个人或时代特长。\n【介绍】：\n拳击手和摔跤手各分为职业和业余两种。职业拳击手和职业摔角手的活动由外部利益支持的赞助人安排，并有合同约束。他们还要进行全日制的工作和训练。业余拳击的竞赛种类非常丰富，同时它也是那些想成为职业拳手的人的训练场。不过也有业余和准职业的选手靠参加黑市拳击赛谋生，举办这些比赛的通常是本地的黑社会或者是从中渔利的庄家。",
    "【22】\n【管家、男仆、女仆】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：会计或估价，技艺（任一：如烹饪、裁缝、理发），急救，聆听，外语，心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n服务业人员。管家通常为一个大家庭打理家事。传统上，他负责的范围包括厨房仆人中位置最高。一般男管家还要负责管理其他的男仆（女管家类似）。更多的职责则听候主人差遣。男仆和女仆则为主人提供贴身服务，包括管理主人的服装准备浴室和担任私人助理。助理的工作则包括安排旅行日程财等。",
    "【23】\n【神职人员】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：会计，历史，图书馆，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。\n【介绍】：\n神职人员通常担任一个教区的牧师，或是经过分配外出传教，尤其是去国外（见传教士）。不同的教会工作的侧重点和组织结构各不相同，如天主教会的牧师可能上升到主教大主教和红衣主教，而一个卫理公会的牧师则会升职到教区主管和主教。有些教职人员在教堂接受医生律师学者的专业培训。这样的调查员应该选择最符合自己工作的职业模板。",
    "【24】\n【程序员、电子工程师（现代）】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学、图书馆，科学（数学），侦查，任意两项其他个人或时代特长。\n【介绍】：\n（现代）计算机程序员通常是设计编写测试调试和维护计算机程序源代码的职业。他们精通从形式逻辑到系统平台（程序运行环境）的各种知识，可能是自由工作者，也可能供职于软件开发部门。计算机技术人员负责计算机系统和网络的开发和维护工作，经常与其他人员（如项目经理）合作来保证系统的完整稳定和正常提供所需功能。",
    "【25】\n【黑客/骇客（现代）】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学，图书馆，侦查，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他技能。\n【介绍】：\n计算机黑客则利用计算机和计算机网络为手段，进行干扰或破坏以达成政治目的（有时被称为“政治黑客”）或获取非法利益。达成目标的手段主要是非法入侵计算机和其他用户帐户，目的则可能包括篡改网页垃圾邮件炸弹。",
    "【26】\n【牛仔】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，格斗或射击，急救或自然，跳跃，骑乘，生存（任一），投掷，追踪。\n【介绍】：\n牛仔在西部的牧区和牧场工作。有些人拥有自己的牧场，更多的则是在各处打工为生。想赚大钱的牛仔会去冒着丢胳膊少腿乃至送命的危险参加牛仔巡回赛，通过旅行获取名誉。在1920年代，一些牛仔能在好莱坞找到西部片替身演员和群众演员的工作，例如怀特•厄普就曾为西部电影担任顾问。在现代，有些牧场也对想要体验一把牛仔生活的游客开放。",
    "【27】\n【工匠】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，技艺（任二），机械维修，自然，侦查，任意两项其他个人或时代特长。\n【介绍】：\n工匠也可能被人叫做师傅或大师，是擅长对各种材料进行手工加工的人。通常都是才能出众的人，有的凭借自己的艺术作品出名，有的则会服务于自己的社区。",
    "【28】\n【罪犯-刺客】\n【信誉】：30-60\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：乔装，电气维修，格斗，射击，锁匠，机械维修，潜行，心理学。\n【介绍】：\n杀手是地下世界的冷血夺命者。这是一项严谨的活计，他们从外地受雇杀人，接近目标，果断下手，又迅速离开。杀手通常很难融入社会，因为很多杀手行为总是很刻板，其他人很容易以为他们不近人情。但是另一方面，他们也会结婚生子，在其他方面和普通人没有什么不同。",
    "【29】\n【罪犯-银行劫匪】\n【信誉】：5-75\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电气维修或机械维修，格斗，射击，恐吓，锁匠，操作重型机械，任意一项其他个人或时代特长。\n【介绍】：\n有些则组成分工明确，会详细调查并制定计划的犯罪组织。",
    "【30】\n【罪犯-打手、暴徒】\n【信誉】：5-30\n【职业属性】：教育×2＋力量×2\n【本职技能】：汽车驾驶，格斗，射击，两项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，侦查。\n【介绍】：\n罪犯可能为别人工作，后者通常是“匪帮”或罪犯家族。自由犯罪者则往往被称为抢劫犯打手罪组织豢养，不过团伙上层出事的时候，倒霉的往往是他们这些喽啰。对于他们来说，嘴紧和忠心属于职业道德。",
    "【31】\n【罪犯-窃贼】\n【信誉】：5-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：估价，攀爬，电气维修或机械维修，聆听，锁匠，妙手，潜行，侦查。\n【介绍】：\n罪犯的体格和相貌形形色色，有些是纯粹碰运气伺机行事，比如扒手.",
    "【32】\n【罪犯-欺诈师】\n【信誉】：10-65\n【职业属性】：教育×2＋外貌×2\n【本职技能】：估价，技艺（表演），法律或外语，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，妙手。\n【介绍】：\n欺诈师通常都是油嘴滑舌的人物。他们或单独或集体出没在富裕的人家和社区周边，诈取他们来之不易的钱财。许多骗局复杂精妙，诈骗团伙会倾巢出动乃至租用建筑；有些则不需要这么麻烦，只要一个骗子几分钟就能搞定。",
    "【33】\n【罪犯-独行罪犯】\n【信誉】：5-65\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：技艺（表演）或乔装，估价，一项社交技能（魅惑、话术、恐吓、说服），格斗或射击，锁匠或机械维修，潜行，心理学，侦查。\n【介绍】：\n也可能单打独斗，如果成功的报酬值得去费力冒险，才会和别人搭伙。",
    "【34】\n【罪犯-女飞贼（古典）】\n【信誉】：10-80\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任意），两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴）或射击（手枪），汽车驾驶，聆听，潜行，任意一项其他个人或时代特长。\n【介绍】：\n女飞贼是名为专业大盗的女人。大部分都是独立行动，也有对自己的男伴言听计从的时候。不过这也不一定，实际上情况可能完全相反，她完全可以在干了某一票以后就卷走所有现金和皮草溜之大吉。",
    "【35】\n【罪犯-赃物贩子】\n【信誉】：20-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，估价，技艺（伪造），历史，一项社交技能（魅惑、话术、恐吓、说服），图书馆，侦查，任意一项其他技能。\n【介绍】：\n赃物贩子，顾名思义是买卖偷抢来的财产，通常是收购赃物并转手卖给其他罪犯或（无意中）守法的顾客。主要来说，他们是小偷和买家的中间人，有时也会从交易中收取提成；不过更常见的还是以极低的价格直接收购赃物。",
    "【36】\n【罪犯-赝造者】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，估价，技艺（伪造），历史，图书馆，侦查，妙手，任意一项其他个人或时代特长（如计算机）。\n【介绍】：\n赝造者是地下世界的艺术家，专门从事伪造官方文件契约转让书，并提供伪造的签名。初学者只能做做小贼的假身份证，而顶级的赝造者连印假币的铸模都能做。",
    "【37】\n【罪犯-走私者】\n【信誉】：20-60\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：射击，聆听，导航，一项社交技能（魅惑、话术、恐吓、说服），汽车驾驶或驾驶（飞行器或船），心理学，妙手，侦查。\n【介绍】：\n走私一直是一个有利可图的高风险行当。走私者往往有一个合法的表面职业，比如船长飞行员或商人，以掩盖他们非法运输的行为。",
    "【38】\n【罪犯-混混】\n【信誉】：3-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，一项社交技能（魅惑、话术、恐吓、说服），格斗，射击，跳跃，妙手，潜行，投掷。\n【介绍】：\n街头混混一般都是些小年轻，弄不好还在寻觅加入真正黑帮的契机。不过他们的本事也就限于偷车，盗窃商店货物，抢钱或者夜盗。",
    "【39】\n【教团首领】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），神秘学，心理学，侦查，任意其他两项其他个人特长。\n【介绍】：\n美国的新兴宗教层出不穷。直到现在，也还有从新英格兰超验主义到“天父的儿女”等等许多种类。教团首领有的创立了严格的教条并且对信徒推行，另一些则仅仅是垂涎于信徒的金钱和权势。在1920年代，各种诱惑性的新兴宗教团体纷纷涌现。有些采取基督教的形式，有些则混杂了东方的神秘主义和神秘学的仪式。",
    "【40】\n【除魅师（现代）】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，格斗（斗殴）或射击，历史，神秘学，心理学，潜行。※经KP允许 可用催眠替换其中一项。\n【介绍】：\n除魅师的工作是说服（或者强迫）一个人放弃自己的信仰或是对宗教团体他们一般受雇于深陷教团之类组织的人的亲属，任务就是解救对方（通常靠绑架），并通过心理学手段使他们割断与原来教团的联系（“控制”）。也有不那么激烈的除魅师，他们的工作对象则是那些自愿离开教团的人，为他们完全地退出教团进行有效的指导。",
    "【41】\n【设计师】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，技艺（摄影），技艺（任一），计算机或图书馆，机械维修，心理学，侦查，任意一项其他个人特长。\n【介绍】：\n设计师的工作包括许多方面，从时装到家具或是其他任何东西。他们自由工作，为设计工作室和企业设计产品流程法律游戏图像等等。调查员特定的设计方向也会影响他们对专业技能的选择，如果需要的话要进行调整。",
    "【42】\n【业余艺术爱好者（原作向）】\n【信誉】：50-99\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），射击，外语，骑乘，一项社交技能（魅惑、话术、恐吓、说服），任意三项其他个人或时代特长。\n【介绍】：\n业余艺术爱好者靠经济自立遗产继承信托基金或者其他各种来源保障自己的生活开支，没有必要自己工作。如果经济条件足够好，他们甚至可以雇佣专业的经济顾问来打理自己的产业。他们可能有很高的学历，但不一定是真才实学；优越的经济条件使得他们性情古怪，口无遮拦。在1920年代，这些人可能会被时人称为“摩登女郎”或者“公子哥儿”。",
    "【43】\n【潜水员】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：潜水，急救，机械维修，驾驶（船），科学（生物），侦查，游泳，任意一项其他个人或时代特长。\n【介绍】：\n潜水员可能在军队执法机构或海绵采集海上救援环境保护甚至水下寻宝的民间机构工作。",
    "【44】\n【医生（原作向）】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。\n【介绍】：\n医生这里可能是指全科医生外科医生其他专科医生或者独立医学研究员。除去个人的目标以外，救死扶伤获得财富和荣誉提升公众的理性意识和科学素养也常常是医生的理想。农村和小城镇的卫生院是全科医生的舞台，而大城市的各大医院则是高手如云，集聚了众多专攻病理学毒理学整形外科脑外科等领域的专家。有些医生也可能担任全职或兼职的法医，进行尸检。",
    "【45】\n【流浪者】\n【信誉】：0-5\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬，跳跃，聆听，导航，一项社交技能（魅惑、话术、恐吓、说服），潜行，任意两项其他个人或时代特长。\n【介绍】：\n相对于那些因贫困而苦恼的人，流浪者选择四处漂泊的生活，可能是出于社会哲学经济的原因，或只是渴望摆脱社会的约束。流浪汉需要工作，有时几天或几个月，但他们应对问题时往往选择流动和孤立，而不是舒适和亲近。在美国，这种情况尤其常见，只要旅行本身没有什么危险，就会有人选择漂泊为生。",
    "【46】\n【司机-私人司机】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），聆听，机械维修，导航，侦查，任意一项其他个人或时代特长。\n【介绍】：\n私人司机则是直接受雇于个人或企业，或者是专门提供连人带车的私人司机业务的中介机构。",
    "【47】\n【司机-司机】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，汽车驾驶，聆听，一项社交技能（魅惑、话术、恐吓、说服），机械维修，导航，心理学，任意一项其他个人或时代特长。\n【介绍】：\n专职司机可能为企业个人工作，也可能拥有自己的出租车或货车。",
    "【48】\n【司机-出租车司机】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，汽车驾驶，电气维修，话术，机械维修，导航，侦查，任意一项其他个人或时代特长。\n【介绍】：\n出租车司机可能属于大大小小的出租车公司，也可能靠自己的车和证件运营（在美国，需要出租车牌照）。出租车公司负责为出租车司机登记车辆并分配调度，方便司机自由揽客。出租车上必须统一安装计价器，并由出租车协会进行定期检查。通常司机还要通过警方的背景调查，获得特殊的驾驶许可证。",
    "【49】\n【编辑】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：会计，历史，母语，两项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n编辑的工作包括审核记者的稿件，撰写报刊社论，应对各种突发事件到了截稿时间要催稿，编辑工作只好偶尔为之啦。大型报社的编辑数量众多，包括比起新闻编辑更多参与业务运营的主编。其他编辑专门负责时尚体育或者其他板块。许多小报可能就只有一个编辑，他甚至有可能就是报社的业主或者唯一的全职员工。",
    "【50】\n【政府官员】\n【信誉】：50-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：魅惑，历史，恐吓，话术，聆听，母语，说服，心理学。\n【介绍】：\n以民选方式选举出来的政府官员享有与他们的职位相符的声望。小城市的市长和城镇的镇长之类，他们的影响力基本出不了城镇的范围，而且这样的职务基本上是兼职的，报酬也很少。大城市的市长，工资就相当可观了，而且还能把自己的城市管理得像小王国一样，影响力和权力比所在州的州长还要大。州议会的众参两院议员是相当有面子的职位。",
    "【51】\n【工程师】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：技艺（技术制图），电气维修，图书馆，机械维修，操作重型机械，科学（工程学，物理），任意一项其他个人或时代特长。\n【介绍】：工程师精通机械和电气设备，可能在民间或军工企业工作，也可能是个发明家。他们擅长应用科学、数学知识和丰富的创造思维，解决各种技术问题。\n",
    "【52】\n【艺人】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演类，如表演、演唱、喜剧等），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。\n【介绍】：\n艺人包括小丑歌手舞蹈演员喜剧演员杂耍艺人魔术师，各种以在人前表演谋生的人。他们乐于向更多的人表现自己的能力，并期待观众回报的掌声。在1920年代，这一职业并不受人尊重。不过1920 年代好莱坞明星的高薪彻底改变了很多人的想法，现在这个职业背景已经通常被视作是优势了。",
    "【53】\n【探险家（古典）】\n【信誉】：55-80\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬或游泳，射击，历史，跳跃，自然，导航，外语，生存。\n【介绍】：\n在20世纪早期，这世界还有许多地区尚未有人涉足，而探索这些地方正是探险家的工作。这种令人兴奋不已的生活方式，其经济来源则是科学界的赞助私人的捐赠博物馆的委托和报纸杂志图书电影的版权等等。黑非洲的大部分仍然不为人知，同样的地方还包括了南美的马托格罗索高原，澳大利亚的大沙沙漠，撒哈拉和阿拉伯沙漠，和亚洲的茫茫戈壁。尽管南北极点已经被探险家征服了。",
    "【54】\n【农民】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（耕作），汽车驾驶（或运货马车），一项社交技能（魅惑、话术、恐吓、说服），机械维修，自然，操作重型机械，追踪，任意一项其他个人或时代特长。\n【介绍】：\n农民可能自己拥有土地，自己从事农牧业，也可能是受雇在农场工作。农业劳动繁重而枯燥，特别适合那些喜欢户外体力劳动的人。1920年代是美国城镇人口超过农村人口的首个十年。从这时起一直到现在，自耕农民都在受到规模化农业企业和剧烈波动的农产品市场的双重冲击。",
    "【55】\n【联邦探员】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：汽车驾驶，格斗（斗殴），射击，法律，说服，潜行，侦查，任意一项其他个人或时代特长。\n【介绍】：\n联邦执法机构和特工种类各异。有些身着制服，比如美国司法部的人员；另外一些则穿便服，工作内容也类似警探，比如联邦调查局的人员。",
    "【56】\n【消防员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，汽车驾驶，急救，跳跃，机械维修，操作重型机械，投掷。\n【介绍】：\n消防员是公职人员，通常为所管辖的社区服务。他们夜以继日地工作，或者连续几天的倒班工作，吃住包括娱乐活动都要局限在消防局里。消防员的管理结构类似军队，职位包括中尉上尉和局长等等。",
    "【57】\n【驻外记者】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：历史，外语，母语，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n驻外记者是新闻界的精英人才。他们拿着固定工资，靠报销单环游全世界。在1920年代，驻外记者通常供职于大型报社广播电台或者国家级通讯社。当代的驻外记者也可能自由撰稿或者为电视台网络通讯社和国际新闻通讯社工作。这个职业的工作内容五花八门，经常能激动人心。不过自然灾害政治动荡和战争也会成为驻外记者报道的主要内容，工作也不总是一帆风顺。",
    "【58】\n【法医】\n【信誉】：40-60\n【职业属性】：教育×4\n【本职技能】：外语（拉丁文），图书馆，医学，说服，科学（生物学，鉴证，制药），侦查。\n【介绍】：\n法医是一个高度专门化的职业，大多数法医为市县或州执法机构工作。工作内容包括尸体解剖，推定死因，并为公诉人提供建议。法医也常常会在刑事审判中出庭提供证言。",
    "【59】\n【赌徒】\n【信誉】：8-50\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，技艺（表演），两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，妙手，侦查。\n【介绍】：\n赌徒是罪犯世界里最花哨的一群人。他们衣着光鲜，不论朴实还是华丽都魅力四射。不论是靠赛马、纸牌游戏还是其他赌博方式，他们总是要凭自己的运气过活。老练的赌徒会频繁地光顾犯罪组织开设的地下赌场。低级的赌徒则出入于狭窄的小巷，在骰子房耍弄灌铅的骰子，或者是挤坐在阴暗的台球室里。",
    "【60】\n【黑帮-黑帮老大】\n【信誉】：60-95\n【职业属性】：教育×2＋外貌×2\n【本职技能】：格斗，射击，法律，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，侦查。\n【介绍】：\n黑帮可能是整个城市、一部分城市的大佬，老板总管业务，负责交易，并要就各种各样的问题给马仔们拿主意。更重要的是，老板可以各种高人一等，只要能找到马仔或者小弟去干的事，他基本是不肯污了自己的手去做的。黑社会在1920年代上升为突出的社会问题。现在的黑帮老大也需要大量的小弟来负责保卫、推广、在街道里推行自己的业务。",
    "【61】\n【黑帮-马仔】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，格斗，射击，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。\n【介绍】：\n也可能只是给这些大佬打工的马仔。马仔们通常有自己的保护范围，比如监管非法运输和收取保护费等等。虽然大部分黑帮是按来源的民族划分——如爱尔兰裔、意大利裔、非洲裔和犹太裔，黑帮的成员仍然可能是任何民族。除去贩私酒和贩毒以外，卖淫、保护、赌博、腐败等等都是这些犯罪组织的业务范围。",
    "【62】\n【绅士、淑女】\n【信誉】：40-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），两项社交技能（魅惑、话术、恐吓、说服），射击（步枪/霰弹枪），历史，外语（任一），导航，骑乘。\n【介绍】：\n绅士淑女指的是有良好的教养品行、举止彬彬有礼的人。通常用来称呼上流社会（通过继承或津贴）拥有相当财富的人。在上世纪20年代，这样的人至少要有一个仆人（管家、男仆、女仆、私人司机），还要有城市或乡村的宅第。家庭的富有并重要，因为家庭的社会地位往往比财产更被上流社会所看重。",
    "【63】\n【游民】\n【信誉】：0-5\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：技艺（任一），攀爬，跳跃，聆听，锁匠或妙手，导航，潜行，任意一项其他个人或时代特长。\n【介绍】：\n游民只有少数的人愿意去当，虽然失业的人、醉倒在阴沟里的醉鬼到处都是。和流浪者只会在必需时才工作不同，游民的工作本身就是流浪。他们不断地坐火车旅行，从一个城市辗转到另一个城市，他们是身无分文的诗人、漂泊者，铁路上的探索者、冒险者和盗贼。但是铁路上的生活一样充满危险。且不说穷困潦倒、无家可归，还要面对来自警察、周围居民和铁路员工的敌意。",
    "【64】\n【勤杂护工】\n【信誉】：6-15\n【职业属性】：教育×2＋力量×2\n【本职技能】：电气维修，一项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），急救，聆听，机械维修，心理学，潜行。\n【介绍】：\n勤杂护工在医院的工作包括倒垃圾、打扫房间、运送病人，还有一些其他乱七八糟的工作。总之对他们的要求不比对看门人多多少。",
    "【65】\n【记者(原作向)-调查记者】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（艺术或摄影），一项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，母语，心理学，任意两项其他个人或时代特长。\n【介绍】：\n记者用文字对当天的新闻事件进行报导与评论，一天之内就要完成一个作家一周的工作量。他们通常为报纸、杂志、广播电台、电视台或者新闻网站撰稿。优秀的调查记者在报道事件的同时，即使面对丑恶，也能保持自身的清廉正直。恶心的记者则被现实所压倒，最终丧失自己的节操，肆意操纵文字歪曲真相。",
    "【66】\n【记者(原作向)-通讯记者】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（表演），历史，聆听，母语，一项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，侦查。\n【介绍】：\n通讯记者则是新闻传媒行业大军中的一员。大部分记者从事实地工作，包括走访见证人、查看记录、收集叙述。有些记者被安排专门追踪警界、体育界或商界的热点新闻，其他人则是负责社会事件乃至园艺俱乐部之类的事情。通讯记者都会携带记者证，不过记者证除了各通讯社用来识别自己的雇员以外没有太大的作用。",
    "【67】\n【法官】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：历史，恐吓，法律，图书馆，聆听，母语，说服，心理学。\n【介绍】：\n法官是主持审判全过程的人，可能单独工作或是和同事组成合议庭。一般是推选或任命制，工作年限也分定期和终身。有的人是初出茅庐就当了法官，而其余的绝大多数，不论是在联邦最高法院还是遥远西部小镇的法官，其实至少都是经过注册的律师。",
    "【68】\n【实验室助理】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：计算机或图书馆，电气维修，外语，科学（化学和任意两项），侦查，任意一项其他个人特长。\n【介绍】：\n实验室助理在科研环境中工作，在首席科学家的监督下进行实验和行政工作。研究内容可能依首席科学家的研究学科而变化。但基本都包括取样、测试、记录和分析数据、调整和进行实验、制备标本和样品、管理实验室的日常工作，和保护工作人员的健康与安全。",
    "【69】\n【工人-非熟练工人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电气维修，格斗，急救，机械维修，操作重型机械，投掷，任意一项其他个人或时代特长。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【70】\n【工人-伐木工】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，格斗（链锯），急救，跳跃，机械维修，自然或科学（生物学或植物学），投掷。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【71】\n【工人-矿工】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，科学（地质），跳跃，机械维修，操作重型机械，潜行，侦查，任意一项其他个人或时代特长。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【72】\n【律师】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，两项社交技能（魅惑、话术、恐吓、说服），心理学，两项其他技能。\n【介绍】：\n律师或法律顾问精通他们所在地区的法律，擅长把抽象的法学理论知识联系起来，为客户解决法律方面的疑难，担任辩护代理、法律顾问的工作，为客户提供解决办法。可能受托处理个人案件、接受法院指定，也可能专门为某个富裕客户或公司服务。在美国，“律师”一词一般只指辩护律师。在英国，“律师”一词则包括高级律师、初级律师还有一些执法机构。",
    "【73】\n【图书馆管理员（原作向）】\n【信誉】：9-35\n【职业属性】：教育×4\n【本职技能】：会计，图书馆，外语，母语，任意四项其他个人特长或专业书籍主题。\n【介绍】：\n图书馆管理员在公共机构和图书馆工作，负责管理图书目录和书库，并处理图书借阅等。在现代，图书馆管理员还要负责管理视听资料、电子书库。一些大公司可能聘用图书馆管理员管理书库，偶尔还会有富有的图书藏家招收他们管理自己的私人藏书。",
    "【74】\n【技师】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：技艺（木工、焊接、管道工等），攀爬，汽车驾驶，电气维修，机械维修，操作重型机械，任意两项其他个人或时代或技术特长。\n【介绍】：\n技师包括所有需要专业训练和作为学徒或实习生工作经验的职业，例如木工、石工、管道工、电工、设备安装工人、机修工人等等这些需要技术资质的职业。通常这些工人有自己的工会组织，会和承包人和雇主争取自己的权益。",
    "【75】\n【军官】\n【信誉】：20-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，射击，导航，急救，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n军官有严格的等级，许多等级还需要高等教育学历。各国武装部队都建立了人才培养系统，其中包括大学教育。在美国，许多大学开设军校生训练项目，可以让学员同时接受文化教育和军事训练。毕业的学员可以授以陆军或海军少尉军衔，并分派到各驻地。他们通常会为国家服役四年，之后可以退役复员。许多人有专门的任命，作为医生、律师和工程师工作。",
    "【76】\n【传教士】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），急救，机械维修，医学，自然，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。\n【介绍】：\n传教士云游到世界的各个角落，传播神的旨意，在文明的地方拯救“不幸的原始人”和“迷途的灵魂”。他们可能属于天主教、新教、伊斯兰教或者其他信仰系统，比如后期圣徒教会（摩门教）在欧美就有专门的传道所。有的传教士只凭自己的意志独立行动，有的则可能有教会以外的组织支持。基督教、伊斯兰教的传教者，佛教、印度教的法师，在全世界各个时代都能遇到。",
    "【77】\n【登山家】\n【信誉】：30-60\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，急救，跳跃，聆听，导航，外语，生存（阿尔卑斯或类似），追踪。\n【介绍】：\n登山家一般都是利用业余时间和假期的运动员，只有少数攀登著名高山的人才会去寻找财力和设备的赞助。19世纪登山运动开始兴起，到了1920年代，所有美洲和阿尔卑斯地区的主要山峰都被一一征服。经过与西藏人的冗长谈判之后，外国登山队终于获准进入喜马拉雅高峰地区。到了现代，登山可以是休闲运动或职业选择。如果是后者，则工作内容包括教练、向导、运动员或救生员等。",
    "【78】\n【博物馆管理员】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：会计，估价，考古，历史，图书馆，神秘学，外语，侦查。\n【介绍】：\n博物馆管理员可能负责大学或其他公共机构的大型设施，也可能负责小一些的博物馆，往往对本地的地质或者其他的内容颇有研究。",
    "【79】\n【音乐家】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：技艺（乐器），一项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，四项其他技能。\n【介绍】：\n音乐家可能加入乐团、乐队或者独奏，演奏的乐器则可以是任何你能想象的种类。音乐家想出人头地十分困难，签约发布唱片就更难了。所以绝大多数音乐家都贫穷又无人关注，只靠街头卖艺勉强维持生计。少数幸运儿可以找到固定工作，比如在酒吧、宾馆或者市交响乐团弹钢琴。对更少的人来说，在正确的时间出现在正确的地点，再加上一点点天赋，就能获得巨大的成功和可观的财富。",
    "【80】\n【护士】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：急救，聆听，医学，一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（生物学，化学），侦查。\n【介绍】：\n护士是专业的医疗助理，通常在医院和疗养院之类的地方工作，或者和全科医生一起合作。一般来说，护士会协助健康人或病人进行保健或康复活动（或者临终关怀），虽然其他人若是有足够的力量、意志或者知识，完全不需要护士帮助的康复也是可能的。",
    "【81】\n【神秘学家】\n【信誉】：9-65\n【职业属性】：教育×4\n【本职技能】：人类学，历史，图书馆，一项社交技能（魅惑、话术、恐吓、说服），神秘学，外语，科学（天文），任意一项其他个人或时代特长 ※经KP允许 可以包含克苏鲁神话。\n【介绍】：\n神秘学家是钻研深奥秘密和神秘魔法的人。他们对超自然能力深信不疑，并竭尽所能靠他们的能力去了解这些东西。许多人对不同神秘哲学和魔法理论的知识面都相当广泛，有些甚至相信自己专注研究三十年真的成为了魔法师。需要指出的是，神秘学家熟知的基本上是“表面的魔法”——克苏鲁神话魔法的秘密对他们仍然是未知的，或者不过是古书上描述那些诱人的线索而已。",
    "【82】\n【旅行家】\n【信誉】：5-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：射击，急救，聆听，自然，导航，侦查，生存（任一），追踪。\n【介绍】：\n旅行家爱好户外，他们一年中大部分时间都呆在户外，并且一出门就是相当长的时间；通常有相当的捕鱼和狩猎技术，能在最恶劣的环境之中幸存下来。擅长的技术可能包括登山、捕鱼、滑雪、皮划艇、攀登和露营。旅行家可能在国家公园或素质拓展中心做野外向导和护林员，也可能是有其他经济来源能让他们不用工作就能以这种方式生活，也说不定只有在需要的时候才会回到文明社会。",
    "【83】\n【超心理学家】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：人类学，技艺（摄影），历史，图书馆，神秘学，外语，心理学，任意一项其他个人或时代特长。\n【介绍】：\n超心理学家从不打算欣赏超常现象。相反，他们试图去观察，记录并研究这些实例。被叫做“捉鬼人”的他们利用技术手段来获取某人或某地点的超自然活动的证据，当然比起收集到实在的证据，更多的时候他们是在揭穿假冒和误认的超常现象。选择研究这个的人往往对不可视的神秘力量抱有相当的同情态度，并希望其他的科学家也能满意地点头肯定。",
    "【84】\n【药剂师】\n【信誉】：35-75\n【职业属性】：教育×4\n【本职技能】：会计，急救，外语（拉丁文），图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（制药，化学）。\n【介绍】：\n药剂师的管理一直以来都比医生更严格。所有的药剂师都要在各州注册，注册的条件则是高中毕业并至少在药学院学习三年。他们可能在医院或者药房工作，也可能自己开药房。",
    "【85】\n【摄影师-摄影师】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（摄影），一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（化学），潜行，侦查，任意两项其他个人或时代特长。\n【介绍】：\n摄影师大部分是自由工作者，可能制作广告电影或者在照相馆做肖像拍摄。其他一些摄像师则在报纸、电视和电影产业工作。摄影作为一种艺术形式已经产生相当长的时间了，精英的摄影师可以从艺术、新闻报道、野生动物保护等多种角度出发创作他们的作品。不管是哪种立意，他们都能获得名誉和报酬。",
    "【86】\n【摄影师-摄影记者】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：技艺（摄影），攀爬，一项社交技能（魅惑、话术、恐吓、说服），外语，心理学，科学（化学），任意两项其他个人或时代特长。\n【介绍】：\n摄影记者本质上就是拿照相机，为拍摄的照片写配文的记者。在1920年代，新闻短片走上历史舞台。笨重的35mm摄像装备走遍全球各地，搜寻有价值的新闻轶事、体育赛事和泳装选美比赛。新闻片制作人员一般分为三类：一类是画面中的记者，另两个人则负责摄像和灯光等等。新闻中的声音则是在新闻稿完成以后在录音棚中录入完成的。",
    "【87】\n【飞行员-飞行员】\n【信誉】：20-70\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：电气维修，机械维修，导航，操作重型机械，驾驶（飞行器），科学（天文），任意两项其他个人或时代特长。\n【介绍】：\n飞行员可以在美国邮政这样的企业工作，也可以在大大小小的民航公司做飞行人员。美国1926年之前没有对飞行员的职业要求,1926年航空商业法案通过之后才要求有执照。这个时代的多数飞行员从事嘉年华表演、特技飞行表演、乘飞机游玩或是小机场的空中的士等服务。也有飞行员在部队服现役。许多特技飞行员是在服役期间学会的驾驶飞机，有时仍然会被军队委派任务。",
    "【88】\n【飞行员-特技飞行员（古典）】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，电气维修，聆听，机械维修，导航，驾驶（飞行器），侦查，任意一项其他个人或时代特长。\n【介绍】：\n特技飞行员在嘉年华工作或者为大胆的消费者进行休闲飞行服务。参加有组织的飞行表演赛，不论是固定路线还是越野赛，往往都可以增加自己的知名度。在1920年代，好莱坞常常使用特技飞行员，飞机制造商也会录用一些飞行员为新机作测试。许多特技飞行员是在一次大战中掌握的飞行技术，所以许多人仍然在陆海空军或海岸警卫队服役；年轻的飞行员则基本上是在和平时期接受的训练或是自学成才。",
    "【89】\n【警方(原作向)-警探】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（表演）或乔装，射击，法律，聆听，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，一项其他技能。\n【介绍】：\n警探可能指挥他的下属进行详尽的调查，但是很难有机会集中精力对付单独一个事件，在美国他们很可能要同时处理数十乃至上百的案件。警探工作最关键的部分是通过梳理证词、重建现场情况，摒弃伪证，从而收集足够逮捕嫌疑人的证据，进而促成成功的刑事审判。警探和检察官的职责是分开的，这样可以保证证据在审判之前被独立地对待。",
    "【90】\n【警方(原作向)-巡警】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），射击，急救，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦查和下面的一种个人特长：汽车驾驶或骑乘。\n【介绍】：\n巡警则属于市、城镇、县治安部门或州、地区的警察机关。他们工作时可能步行、驾驶巡逻车，或者干脆坐办公室。",
    "【91】\n【私家侦探】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（摄影），乔装，法律，图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，一项其他个人或时代特长（如计算机、锁匠、格斗、射击）。\n【介绍】：\n私家侦探通常在警察不出手的地方活跃，包括收集证据为客户准备民事诉讼，追查跑路的配偶或生意伙伴，或者代理刑事案件的私人辩护。他们和任何专业人员一样，私家侦探从不顾及自己的私人情感，只要付钱，不管是有罪还是无罪的一方的委托他们都乐得接受。私家侦探过去可能在警察队伍里工作，利用以前的业务关系为现在工作谋求优势；然而事实并非总是如此。",
    "【92】\n【教授（原作向）】\n【信誉】：20-70\n【职业属性】：教育×4\n【本职技能】：图书馆，外语，母语，心理学，任意四项其他学术、时代或个人特长。\n【介绍】：\n教授是受聘于高等院校的学者。大公司也可能聘请他们以开展学术研究与产品开发。独立的学者也靠开办业余课程作为经济来源。最重要的一点，这一职业代表了 PhD（博士）的荣誉称号，意味着可以在世界各地的大学任终身教职。教授的专长是教学和专业研究，往往在自己的专业领域内有着可圈可点的学术成就。",
    "【93】\n【淘金客】\n【信誉】：0-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬、急救、历史、机械维修、导航、科学（地质），侦查，任意一项其他个人或时代特长。\n【介绍】：\n淘金客一直是美国西部的特色，即便在加利福尼亚淘金热和内华达康姆斯塔克发现金银矿的日子早已经过去的现在。他们无休止地在山间漫游，寻找能使自己一夜暴富的矿脉。而且现在发现石油和发现金子一样给力。",
    "【94】\n【性工作者】\n【信誉】：5-50\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），两项社交技能（魅惑、话术、恐吓、说服），闪避，心理学，妙手，潜行，任意一项其他个人或时代特长。\n【介绍】：\n性工作者根据场合、背景和教养，从超级值钱的应召小姐到牛郎再到站街女都有可能。往往入这一行都是权宜之计，许多人梦想有朝一日能够脱身。少数人能够自己接客，不过绝大多数人基本都是被只认钱不认人的老鸨和皮条客逼迫着工作。",
    "【95】\n【精神病学家】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：外语，聆听，医学，说服，精神分析，心理学，科学（生物学，化学）。\n【介绍】：\n精神病学家是在现代专门从事精神失常诊断和治疗的医生。精神病学家掌握着精神药理学的治疗方法，使用精神类药物的资质，还能整理脑电图并对其进行计算机分析。到1930年代，任何一个医生都可以以精神病学家的身份进入美国医学协会名录中了。",
    "【96】\n【心理学家、精神分析学家】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：会计，图书馆，聆听，说服，精神分析，心理学，任意两项其他学术、个人或时代特长。\n【介绍】：\n心理学家虽然也经常被叫做心理治疗师和心理咨询师，不过这些工作都只是心理学的分支。临床心理学家可能实际接触病人，并且运用各种可能的心理治疗方法。注意心理学家和专业的精神病学家的区别，后者本质上还是医生。在1920年代，对人类行为的研究还是一个新兴的领域，主要的理论还是弗洛伊德心理学。",
    "【97】\n【研究员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：历史，图书馆，一项社交技能（魅惑、话术、恐吓、说服），外语，侦查，任意三项其他学术领域。\n【介绍】：\n学术界的研究课题不计其数，尤其是在天文学、物理学和其他理论领域。私人或企业也雇用了成千上万的研究员，重点在化学、制药和工程领域。石油公司则会聘用专业的地质学家，不一而足。研究员大部分的时间都在室内工作和写作，不过有的则会经常外出考察。考察研究员通常经验丰富，思想独立又足智多谋，可能受雇于私人或者为大学进行学术研究。",
    "【98】\n【海员-军舰海员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：电工或机械维修，格斗，射击，急救，导航，驾驶（船），生存（海上），游泳。\n【介绍】：\n新入伍的海员像陆军的同行一样，开始时需要接受基本的训练。这之后他们获得军衔，并被分配到各镇守府。虽然很多海员担任像水手长副手和司炉工（管理引擎）这样的传统角色，但是也有很多经过专门训练的机械师、无线电操作员、通风管理员之类。在美国，海员通常要服四年的现役和后两年的后备役，即在国家发布动员令时有应召服役的义务。",
    "【99】\n【海员-民船海员】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：急救，机械维修，自然，导航，一项社交技能（魅惑、话术、恐吓、说服），驾驶（船），侦查，游泳。\n【介绍】：\n民用船海员可能在渔船、客船，或运输原油或商品的运输船上工作。在美国，客船活跃在东西海岸和五大湖，运送渔民和游客。目前佛罗里达州在墨西哥湾和大西洋海岸拥有最多数量的客船。在禁酒令期间，许多客船船长发现把急切想喝酒的顾客运到3海里外，外国船只允许卖酒的地方是一桩赚钱的买卖。当然走私酒也报酬丰厚，但是危险就高多了。",
    "【100】\n【推销员】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，聆听，心理学，潜行或妙手，一项其他技能。\n【介绍】：\n推销员是商务工作的必需一环，他们的工作就是推广和销售公司的产品或服务。大部分推销员的时间要用来旅行、开会、和客户应酬。有些则主要坐办公室用电话联系潜在客户，还有的会在各社区巡回，挨家挨户上门推销。1920年代是企业家的年代，旅行推销成了一种日常生活方式。有些推销员在固定的地区工作，有些则可以自由漫游，寻找任何地方可能出现的商机。",
    "【101】\n【科学家】\n【信誉】：9-50\n【职业属性】：教育×4\n【本职技能】：任意三项科学专业领域，计算机或图书馆，外语，母语，一项社交技能（魅惑、话术、恐吓、说服），侦查。\n【介绍】：科学家是在追求知识的过程中挖掘真理的人。如果想要利用科学知识制造有用的物品，需要的是工程师；而如果想要扩展“可能”这个概念的范围，那就是科学家的工作了。科学家们通常在企业和大学工作，以进行他们的研究。虽然主攻一个科学领域，但是真正称职的科学家一般也能达到通晓其他数个科学领域的水平。他们对自己的母语也能使用自如，学历也相当高，甚至拥有博士学位。\n",
    "【102】\n【秘书】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计，技艺（打字或速记），两项社交技能（魅惑、话术、恐吓、说服），母语，图书馆或计算机，心理学，任意一项其他个人或时代特长。\n【介绍】：秘书的范围是从高薪的私人管理助理到普通的打字员。这份工作的重点在于以自己各种沟通协调能力，支持主管和经理人员。因为身处企业流程的中心，许多秘书比老板对企业的内部运作和经营还要熟悉。在1920年代，秘书工作主要是通信工作，例如听写打印信件，整理文档系统，并为老板安排会议时间。有的情况下，秘书还会负责老板的生活，比如安排假期、为老板和家人置办礼物，还有保护老板的安全。\n",
    "【103】\n【店老板】\n【信誉】：20-40\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），电气维修，聆听，机械维修，心理学，侦查。\n【介绍】：店老板经营小店、市场摊位或者是小饭馆。这种店往往都是小本自营，不过也有为其他东家照顾生意的。不少店是家族式管理，工作人员大部分都有亲属关系，其他的雇员即便有也很少。在1920年代，还有不少的老板娘开起了自己的理发店和帽店。\n",
    "【104】\n【士兵、海军陆战队士兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。\n【介绍】：所有应征人员首先要在“训练营（新兵连）”接受基本训练，在训练营中新兵将学习如何行军、射击和敬礼。结束训练营的训练后，大部分的新兵会分配到步兵营，虽然也有分配到炮兵营和坦克营的。少部分会接受非战斗的训练，例如通风系统、机械装备、文职甚至军官接待。海军陆战队名义上属于海军，但是和陆军士兵在背景、训练方式和技能方面都很相近。\n",
    "【105】\n【间谍】\n【信誉】：20-60\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：技艺（表演）或乔装，射击，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，妙手，潜行。\n【介绍】：间谍为国家和组织的情报部门卖命。他们能以从大使到厨房清洁工的任何职业身份作为掩饰，刺探他们所需的情报。有些间谍数年如一日的持续着卧底工作，另一些穿个马甲就换一个身份。在本国委任的间谍通常会去往外国工作。间谍除了情报收集和反情报收集的主要工作，也会被委派其他任务，例如招募新间谍和国家批准的暗杀等。\n",
    "【106】\n【学生、实习生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：语言（母语或外语），图书馆，聆听，三个学习的专业，任意两项其他个人或时代特长。\n【介绍】：学生可能在大学或学院学习，实习生则是正在接受宝贵的入职培训，获得最低报酬的公司员工。\n",
    "【107】\n【替身演员】\n【信誉】：10-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，电气维修或机械维修，格斗，急救，跳跃，游泳，下面任选一项：潜水、汽车驾驶、驾驶（任一），骑乘。\n【介绍】：替身演员在电影和电视剧工业中活跃，专门模拟坠楼、车祸等灾难场景。他们通常会接受格斗技巧和舞台格斗的训练。任何的替身特技表演都是有风险的。在现代，替身演员基本都是工会的成员，想要加入工会，他们必须有证明自己能力的证书。而且，所有的特技场景还要有特技总监负责指导动作。但是在1920年代，行业规范没有成型，所以事故率和死亡率居高不下。\n",
    "【108】\n【部落成员】\n【信誉】：0-15\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，格斗或投掷，聆听，自然，神秘学，侦查，游泳，生存（任一）。\n【介绍】：至少，从家族忠诚来说，部落文化无处不在。在部落中，亲属关系和传统习俗的首要地位是不言而喻的。一个部落通常来说是一个相对较小的群体。相比起法律和个人权利，部落更加依据个人荣耀而裁定行为。崇拜，复仇，嘉奖，以及荣耀——所有的一切都是部落成员个人所有的，而如果领袖或是仇敌被视为有荣耀的人，那么他们个人也必然在某种程度上十分有名。\n",
    "【109】\n【殡葬师】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：会计，汽车驾驶，一项社交技能（魅惑、话术、恐吓、说服），历史，神秘学，心理学，科学（生物学，化学）。\n【介绍】：殡葬师又叫殡葬业者或葬礼主持人，是负责运行丧葬仪式的职业。工作也包含土葬和火化等内容。在葬礼上，殡葬师要进行防腐、裹衣、入殓、遗体美容等等工作。殡葬师的执照由各州发放。他们可能自己拥有殡仪馆，或者在别人的殡仪馆工作\n",
    "【110】\n【工会活动家】\n【信誉】：5-50\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），法律，聆听，操作重型机械，心理学。\n【介绍】：工会活动家是组织者、领导者，有时也是空想者或者别有用心的抗议者，通常是工人的伙伴、老板的对头。各行各业都有工会，不论是码头工人、建筑工人、矿工还是演员。在20世纪早期，工会活动家所在的工会面临着诸多危险。大企业想要毁掉它，政治家在支持它和谴责它之间摇摆不定，社会主义者和共产主义者试图影响它，还有犯罪组织试图夺取它。\n",
    "【111】\n【服务生】\n【信誉】：9-20\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，技艺（任一），闪避，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：服务生在酒店、酒吧或者其他餐饮业场所服务顾客。通常薪酬很低，不过通过对顾客良好服务，可以得到他们给的小费。在禁酒令时期，售酒场所的服务员是非法职业。不过犯罪组织把控的地下酒吧中仍然存在许多工作机会。\n",
    "【112】\n【白领工人-职员、主管】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：会计，语言，法律，图书馆或计算机，聆听，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。\n【介绍】：白领工人可能是从最低等级的白领职员到中层或高层的管理人员。所属单位则可能从小型中型的本地企业直到大型的国家级甚至跨国公司。职员被扣工资是家常便饭，工作也往往单调乏味。不过如果在工作中展现出了天分，那也会被看上，将来会得到提拔。中高层管理人员的工资比较高，当然责任也比较重，要负责管理公司的日常事务。\n",
    "【113】\n【白领工人-中高层管理人员】\n【信誉】：20-80\n【职业属性】：教育×4\n【本职技能】：会计，外语，法律，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。\n【介绍】：职员被扣工资是家常便饭，工作也往往单调乏味。不过如果在工作中展现出了天分，那也会被看上，将来会得到提拔。中高层管理人员的工资比较高，当然责任也比较重，要负责管理公司的日常事务。虽然未婚的白领并不少见，但很多管理人员还是很顾家，家里一般会有配偶和孩子——家庭通常是他们的期望。\n",
    "【114】\n【狂热者】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：历史，两项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，任意三项其他个人或时代特长。\n【介绍】：热情而有动力、鄙视安逸的生活，狂热者们为人类更好的生活或者为人类中最精华部分的利益而躁动不安。一些狂热者通过暴力推进他们的信仰，但是并不能说采取和平方式的就比他们好说话，他们每个人都梦想着为自己的理想辩护。\n",
    "【115】\n【饲养员】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：驯兽，会计，闪避，急救，自然，医学，科学（制药，动物学）。\n【介绍】：饲养员负责动物的喂养和看护，场地管理员和服务员管理其他杂务。通常饲养员会专门照看某一种动物，可以对动物使用「医学」技能。\n",
    "【116】\n【大使】\n【信誉】：50-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：魅惑，历史，恐吓，话术，聆听，母语，说服，心理学。(用一到两种外语取代前面两种技能)",
    "【117】\n【运动员（游泳/潜水）】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），外语，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。",
    "【118】\n【运动员（高尔夫）】\n【信誉】：50-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），骑术，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。",
    "【119】\n【运动员（网球）】\n【信誉】：30-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：跳跃，格斗（斗殴），闪避，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦察，投掷，任意一项其他个人或时代特长。",
    "【120】\n【运动员（田径）】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），外语，一项社交技能（魅惑、话术、恐吓、说服），闪避，投掷，任意一项其他个人或时代特长。",
    "【121】\n【发言人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：乔装，闪避，三项社交技能（魅惑、话术、恐吓、说服），心理学，外语，任意一项其他个人或时代特长。",
    "【122】\n【保释担保人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，图书馆，心理学，任意两项其他个人或时代特长。",
    "【123】\n【神职人员(天主教牧师)】\n【信誉】：20-70\n【职业属性】：教育×4\n【本职技能】：会计，母语，外语(拉丁文)，图书馆，神秘学，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【124】\n【神职人员(新教牧师)】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：会计，历史，图书馆，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【125】\n【神职人员(犹太教拉比)】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：母语，外语（希伯来语），历史，图书馆，神秘学，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【126】\n【专栏作家】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），历史或图书馆，母语，外语，心理学，潜行。",
    "【127】\n【社会主义者/激进主义者】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：格斗（斗殴），两项社交技能（魅惑、话术、恐吓、说服），射击（手枪），外语，心理学，任意两项其他个人或时代特长。",
    "【128】\n【撰稿人】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：母语，艺术（文学），两项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，聆听，心理学。",
    "【129】\n【罪犯（赌博庄家）】\n【信誉】：50-80\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计,两项社交技能（魅惑、话术、恐吓、说服）,心理学，侦察，妙手，任意一项其他个人或时代特长。",
    "【130】\n【罪犯（放高利贷者）】\n【信誉】：50-80\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计，估价，两项社交技能（魅惑、话术、恐吓、说服）,心理学，侦察，任意两项其他个人或时代特长。",
    "【131】\n【罪犯（扒手）】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服）,潜行，聆听，心理学，侦察，妙手，任意一项其他个人或时代特长。",
    "【132】\n【罪犯（地下钱庄）】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，聆听，说服，侦察，任意其他两项个人或时代特长。",
    "【133】\n【罪犯（黑律师）】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，两项社交技能（魅惑、话术、恐吓、说服），心理学，两项其他技能。",
    "【134】\n【牙医】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【135】\n【外科医生/内科医生】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【136】\n【整形医生】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【137】\n【司机-公交司机】\n【信誉】：30-50\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，汽车驾驶，电气维修，机械维修，领航，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。",
    "【138】\n【实地调研员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：会计，攀爬或跳跃，急救，图书馆，外语，一项社交技能（魅惑、话术、恐吓、说服），两项研究领域相关技能。",
    "【139】\n【电影摄制人员】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：艺术/工艺(任一,如摄影)，攀爬，汽车驾驶，电气维修，机械维修，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【140】\n【司法科学家】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），医学，法律，科学（化学，司法科学，药学），侦察，任意一项其他个人或时代特长。",
    "【141】\n【运动经理】\n【信誉】：20-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，格斗（斗殴），闪避，两项社交技能（魅惑、话术、恐吓、说服），急救，心理学，任意一项其他个人或时代特长。",
    "【142】\n【商船队船员】\n【信誉】：20-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：人类学，攀爬，电气维修或机械维修，跳跃，操作重型机械，外语，生存（海上），任意一项其他个人或时代特长。",
    "【143】\n【古典音乐家】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：会计，技艺（乐器），一项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，三项其他技能。",
    "【144】\n【赛车手/ 赛艇手】\n【信誉】：30-70\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：汽车驾驶，电气维修，机械维修，驾驶（船），心理学，侦察，任意两项其他个人或时代特长。",
    "【145】\n【电台播音员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【146】\n【推销员（圣经推销员）】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，聆听，心理学，潜行或妙手，一项其他技能。",
    "【147】\n【推销员（旅行推销员）】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，领航，聆听，心理学，一项其他技能。",
    "【148】\n【小企业家】\n【信誉】：50-70\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），心理学，四项经营业务相关技能。",
    "【149】\n【舞台工作人员】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：艺术/ 工艺（任一），母语，两项社交技能（魅惑、话术、恐吓、说服），乔装，心理学，任意两项其他个人或时代特长。",
    "【150】\n【证券经纪人】\n【信誉】：60-90\n【职业属性】：教育×4\n【本职技能】：会计，估价，母语，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。",
    "【151】\n【勘测员】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，艺术（摄影），图书馆，博物学，领航，生存（任一），侦察，任意一项其他个人或时代特长。",
    "【152】\n【电话接线员】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：母语，外语，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【153】\n【星探】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦察，任意两项其他个人或时代特长。",
    "【154】\n【医疗技术员】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），电气维修，图书馆，机械维修，医学，科学（生物，化学，药学）。",
    "【155】\n【队医】\n【信誉】：9-30\n【职业属性】：\n【本职技能】：两项社交技能（魅惑、话术、恐吓、说服），急救，医学，科学（药学），心理学，侦察，任意一项其他个人或时代特长。",
    "【156】\n【寻宝猎人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：估价，攀爬，汽车驾驶或驾驶（飞行器或船），电气维修或机械维修，历史，跳跃，一项社交技能（魅惑、话术、恐吓、说服），侦察。",
    "【157】\n【西部治安官】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，射击（任一），格斗（斗殴，鞭），法律，说服或心理学，骑术，追踪。",
    "【158】\n【暴走族】\n【信誉】：5-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），汽车驾驶，机械维修，话术，恐吓，任意三项其他个人或时代特长。",
    "【159】\n【神职人员(和尚,尼姑)】\n【信誉】：5-60\n【职业属性】：教育×4\n【本职技能】：艺术（书法），历史或图书馆，外语（汉语或梵语），学问（佛教），一项社交技能（魅惑、话术、恐吓、说服），心理学，聆听，任意一项其他个人或时代特长。",
    "【160】\n【神职人员(神官,巫女)】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：艺术（书法，另任一），图书馆，神秘学，学问（神道教），一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。",
    "【161】\n【风水师】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：艺术（任一），图书馆，神秘学，学问（道教），一项社交技能（魅惑、话术、恐吓、说服），科学（天文，地质），任意一项其他个人或时代特长。",
    "【162】\n【家传降妖人】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），博物学，神秘学，学问（佛教或神道教），心理学，潜行，任意两项其他个人或时代特长。",
    "【163】\n【高中生(教育60以下)】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：攀爬、潜行、跳跃、图书馆、格斗（任一）、母语、科学（任一）或历史、外语（英语或其他）。",
    "【164】\n【市子（盲人）】\n【信誉】：5-30\n【职业属性】：教育×4\n【本职技能】：艺术（表演），聆听，学问（神道教），神秘学，历史，话术或说服，心理学，任意一项特长。※经KP同意，可以用「灵媒」技能代替一项自选技能。",
    "【165】\n【言灵师/阴阳师】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：艺术（书法，另任一），历史或图书馆，母语，学问（阴阳道），科学（天文），神秘学，任意一项其他个人或时代特长。",
    "【166】\n【炼丹师】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：图书馆，医学，神秘学，科学（化学），博物学，学问（道教），外语（汉语），急救或精神分析。",
    "【167】\n【外语教师】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：历史，聆听，母语，心理学，两项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【168】\n【非法移民】\n【信誉】：0-5\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：乔装，话术，聆听，侦察，潜行，妙手，心理学，任意一项其他个人或时代特长。",
    "【169】\n【相扑力士(SIZ>80,STR>70)】\n【信誉】：9-60\n【职业属性】：教育×2＋力量×2\n【本职技能】：闪避，格斗（斗殴），恐吓，跳跃，心理学，侦察，任意两项其他个人或时代特长。(体型+2D6,你的体型可以超过99)",
    "【170】\n【渔民】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：机械维修，操作重型机械，游泳，驾驶（船），科学（天文），领航，博物学，侦察。",
    "【171】\n【心理治疗师】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（任一），两项社交技能（魅惑、话术、恐吓、说服），法律，外语，心理学，精神分析，任意一项其他个人或时代特长。",
    "【172】\n【女学生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：一项社交技能（魅惑、话术、恐吓、说服），自行车驾驶，急救，聆听，艺术/ 工艺（任一），图书馆，格斗（矛）或射击（弓），外语（任一）。",
    "【173】\n【寄居学生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：急救，会计，手艺（木匠），说服，图书馆，外语（任一），任意两项其他个人或时代特长。",
    "【174】\n【动物辅助治疗师】\n【信誉】：30-50\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：聆听，心理学，精神分析，科学（动物学），跳跃，追踪，博物学，任意一项其他个人或时代特长。跳跃，追踪，博物学，任意一项其他个人或时代特长。",
    "【175】\n【急诊医生/救援队员】\n【信誉】：10-50\n【职业属性】：教育×4\n【本职技能】：医学，急救，科学（化学），锁匠，机械维修，电气维修，攀爬，跳跃。",
    "【176】\n【密医】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：医学，急救，会计，一项社交技能（魅惑、话术、恐吓、说服），法律，科学（药学），外语，任意一项其他个人或时代特长。",
    "【177】\n【科学搜查研究员】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），医学，法律，科学（化学，司法科学，药学），侦察，任意一项其他个人或时代特长。",
    "【178】\n【山岳救援队员】\n【信誉】：10-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：急救，聆听，跳跃，追踪，攀爬，领航，生存（山地），外语。",
    "【179】\n【舞者】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演类，如表演、演唱、喜剧等），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【180】\n【服装设计师】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，技艺（摄影），技艺（任一），计算机或图书馆，乔装，心理学，侦察，任意一项其他个人特长。※可以通过成功的「侦察」检定，从对方的服饰判定其地位和收入等。",
    "【181】\n【海上自卫队员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：电气维修或机械维修，格斗，射击，急救，领航，驾驶（船），生存（海上），游泳。",
    "【182】\n【海警】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：急救，机械维修，博物学，领航，一项社交技能（魅惑、话术、恐吓、说服），驾驶（船），侦察，游泳。",
    "【183】\n【陆上自卫队员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【184】\n【私人军事公司成员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【185】\n【冒险家教授】\n【信誉】：55-80\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬或游泳，射击，历史，跳跃，博物学，领航，外语，生存。",
    "【186】\n【评论家】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），历史或图书馆，母语，外语，心理学，潜行。",
    "【187】\n【偶像】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演,歌唱,舞蹈），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【188】\n【歌手】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（歌唱,舞蹈,乐器），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【189】\n【搞笑艺人】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演,杂技,喜剧），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【190】\n【运动员艺人】\n【信誉】：9-20\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：攀爬，闪避，跳跃，投掷，侦察，游泳，任意两项其他个人或时代特长。",
    "【191】\n【播音员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【192】\n【主持人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【193】\n【电视解说员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【194】\n【网络明星】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演，歌唱，喜剧），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，计算机，电气维修。",
    "【195】\n【经纪人】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：汽车驾驶、两项社交技能（魅惑、话术、恐吓、说服），潜行，聆听，法律，任意两项其他个人或时代特长。",
    "【196】\n【捉鬼人】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：神秘学，科学（物理，化学，生物），机械维修，艺术（摄影），电气维修，一项社交技能（魅惑、话术、恐吓、说服）。",
    "【197】\n【占卜师、灵媒师】\n【信誉】：9-30\n【职业属性】：教育×2＋教育或外貌×2\n【本职技能】：艺术（表演），历史，图书馆，两项社交技能（魅惑、话术、恐吓、说服），神秘学，心理学，任意一项其他个人或时代特长。",
    "【198】\n【机械师】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：技艺（木工、焊接、管道工等），攀爬，汽车驾驶，电气维修，机械维修，操作重型机械，任意两项其他个人或时代或技术特长。",
    "【199】\n【厨师】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：手艺（烹饪），科学（生物，化学），格斗（斗殴），博物学，侦察，外语，任意一项其他个人或时代特长。",
    "【200】\n【网络犯罪者】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学，图书馆，侦察，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他技能。",
    "【201】\n【佣兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【202】\n【自宅警备员】\n【信誉】：1-10\n【职业属性】：教育×4\n【本职技能】：计算机，聆听，潜行，图书馆，母语，任意三项符合尼特族形象的特长。",
    "【203】\n【壮汉保镖】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），射击，急救，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦察和下面的一种个人特长：汽车驾驶或骑术。",
    "【204】\n【游戏测试员】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：手艺（游戏），计算机，电气维修，电子学，聆听，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【205】\n【交际花】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：艺术（任意），估价，潜行，一项社交技能（魅惑、话术、恐吓、说服），急救，其他语言（欧洲），心理学，骑术，（乔装、钳工）中的一种，任意一项其他个人或时代特长",
    "【206】\n【考古学家】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，艺术（任意），估价，历史，图书馆，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意两项其他个人或时代特长",
    "【207】\n【贵族】\n【信誉】：70-99\n【职业属性】：教育×2＋教育或外貌×2\n【本职技能】：拉丁语，法律，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），骑术，射击（霰弹枪），任意三项其他个人或时代特长",
    "【208】\n【艺术家】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷或意志×2\n【本职技能】：艺术及手艺（任意多种），估价，历史，图书馆，其他语言（欧洲），侦查，任意两项其他个人或时代特长",
    "【209】\n【作家】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：艺术（写作），历史，图书馆，其他语言（欧洲），母语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长",
    "【210】\n【马车夫】\n【信誉】：3-10\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：闪避，马车驾驶，跳跃，聆听，机械维修，博物学，导航，一项社交技能（魅惑、话术、恐吓、说服），侦查，格斗（鞭），任意一项其他个人或时代特长",
    "【211】\n【牧师】\n【信誉】：20-65\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：历史，拉丁语，图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长",
    "【212】\n【咨询侦探】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：人类学，估价，科学（化学），急救，历史，法律，图书馆，聆听，心理学，其他语言（任意），侦查，追踪，任意两项其他个人或时代特长",
    "【213】\n【工匠】\n【信誉】：9-35\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，估价，手艺（任意多种），机械维修，一项社交技能（魅惑、话术、恐吓、说服），侦查，任意一项其他个人或时代特长",
    "【214】\n【罪犯】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：估价，乔装，一项社交技能（魅惑、话术、恐吓、说服），潜行，锁匠，格斗（任意两项），任意一项其他个人或时代特长",
    "【215】\n【业余艺术爱好者】\n【信誉】：10-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：任意六项个人或时代特长",
    "【216】\n【艺人】\n【信誉】：10-40\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：艺术（任意多种），乔装，闪避，两项社交技能（魅惑、话术、恐吓、说服），聆听，母语，心理学，任意三项其他个人或时代特长",
    "【217】\n【退役军官】\n【信誉】：40-75\n【职业属性】：教育×4\n【本职技能】：潜行，急救，射击（手枪、来复枪）,导航，其他语言（任意）,一项社交技能（魅惑、话术、恐吓、说服）,心理学，骑术,格斗（剑），侦查，（攀爬、游泳）中的一种",
    "【218】\n【探险家】\n【信誉】：45-70\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：人类学，考古学，估价，科学（生物学），攀爬，急救，射击（手枪、来复枪），格斗（斗殴），博物学，导航，其他语言（任意），驾驶（小艇，船，热气球），骑术，潜行，侦查，游泳，追踪",
    "【219】\n【私家侦探】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，图书馆，聆听，锁匠，艺术及手艺（摄影），侦查，任意一项其他个人或时代特长",
    "【220】\n【记者】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：估价，闪避，两项社交技能（魅惑、话术、恐吓、说服），图书馆，聆听，其他语言（欧洲），母语，艺术及手艺（摄影），心理学，侦查。",
    "【221】\n【劳工】\n【信誉】：0-10\n【职业属性】：教育×2＋力量×2\n【本职技能】：估价，一项社交技能（魅惑、话术、恐吓、说服），闪避，急救，机械维修，重型机械操作，任意一项其他个人或时代特长，以及从以下任选两种：（攀爬，斗殴，手艺（任意），马车驾驶，驾驶：船）",
    "【222】\n【律师】\n【信誉】：20-80\n【职业属性】：教育×4\n【本职技能】：会计，估价，两项社交技能（魅惑、话术、恐吓、说服），历史，拉丁语，法律，图书馆，聆听，心理学，任意两项其他个人或时代特长",
    "【223】\n【医生】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：科学（生物学、药剂学），急救，拉丁语，图书馆，医学，心理学，任意两项其他个人或时代特长",
    "【224】\n【警察】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），闪避，一项社交技能（魅惑、话术、恐吓、说服），急救，射击（手枪），法律，聆听，心理学，潜行，侦查",
    "【225】\n【教授/学者】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：图书馆，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），心理学，至多六种额外的学问技巧作为个人专长",
    "【226】\n【科学家】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：手艺（任意），历史，图书馆，机械维修，一项社交技能（魅惑、话术、恐吓、说服），侦查，至多六种其他学问技巧作为个人专长",
    "【227】\n【佣人】\n【信誉】：0-10\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：手艺（任意），闪避，聆听，潜行，任意一项其他个人或时代特长，以及从以下中最多选取三个：（会计，估价，马车驾驶，礼仪，急救，其他语言（欧洲），说服）",
    "【228】\n【店主】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，估价，手艺（任意），聆听，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意一项其他个人或时代特长",
    "【229】\n【士兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，急救，潜行，聆听，机械维修，射击（来复枪），潜行，侦查，任意两项其他个人或时代特长",
    "【230】\n【密探】\n【信誉】：30-70\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），潜行，历史，图书馆，聆听，锁匠，导航，其他语言（欧洲），心理学，侦查，格斗（任意）"
]
# xp列表
xp_list = ["叙述猛烈的感谢之语",
           "净说讽刺的话",
           "对对方的话肯定然后又否定",
           "嗤笑然后道歉",
           "不听人说话光顾着自己说",
           "「不能不考虑到这个吧」",
           "「还是说，有隐藏着什么吗？」",
           "「真是奇妙」",
           "「大体上已经明白了」",
           "「保持沉默」",

           "随便将搜查对象的包或者抽屉打开搜查",
           "横插一脚进警察的搜查",
           "为了搜查非法入室或者黑客",
           "进入禁止进入的地方",
           "偷听或者偷看警察的搜查",
           "没有许可就拆解证据",
           "欺骗搜查对象问出情报",
           "随便碰触助手/同伴的随身物品",
           "随便将证据拿走",
           "随便就开始了鉴定",

           "隐藏自己身份和关联者说话",
           "隐瞒情报的同时询问",
           "和搭档/他人一起以演技问出情报",
           "假装路过的人偷听关联者的对话",
           "假装偶然拿到证物",
           "故意一直做作地装傻",
           "以演技故意惹怒关联者来引出情报",
           "轻微威胁关联者",
           "主张自己有遗失物品在现场寻找证物",
           "对关联者诱导询问",

           "用搭档/他人的身体重现事件",
           "解开谜题后很开心地笑",
           "废寝忘食搜查后突然倒下",
           "考虑事情时谁的声音都听不见",
           "开始在附近的地上或者墙壁上画事件的相关图",
           "不断冒出和事件相关的句子难以停止",
           "完全没考虑除了解决事件之外的事情",
           "开始连绵不断地说事件的流程",
           "踏入事件现场进行调查",
           "就算在用餐也不断说着事件的话",

           "老实不客气地接受搭档/他人的信任",
           "丢下搭档/他人先走了",
           "质问搭档/他人对事件的看法",
           "对搭档/他人自我炫耀",
           "关于事件对搭档/他人出题",
           "和搭档/他人因为细枝末节的事情吵架",
           "对搭档/他人摆出一副老师的样子",
           "以搭档/他人会跟上的前提随意行动",
           "对搭档/他人进行详尽仔细的事件说明",
           "突然开始在搭档/他人的耳边说话",

           "阅读大量书籍",
           "大声放喜欢的音乐",
           "在解什么算式",
           "吃大量喜欢的东西",
           "一直对着电脑或者手机屏幕调查着什么",
           "解小谜题",
           "指点国际象棋或者将棋",
           "坐在饮茶店等着什么",
           "一直在睡觉，突然起来了",
           "暂时什么都不干",

           "在进餐的时候突然就解开了谜",
           "和助手/同伴闲聊的时候突然就解开了谜",
           "听到聊天内容的时候突然就解开了谜",
           "洗澡的时候突然就解开了谜",
           "梦中突然就解开了谜",
           "风吹过的东西解开了迷",
           "看书时找到了事件的启发",
           "再次访问场景的时候灵光一闪",
           "确认资料的中途灵光一闪",
           "和关系者交谈中途灵光一闪",

           "突然哭泣",
           "突然愤怒",
           "突然笑出声来",
           "突然变得情绪高涨",
           "突然高兴",
           "突然大声喊叫",
           "突然开始嗤笑",
           "突然开始讲述事件的悲伤",
           "淡然行事",
           "机械一样只是在做已经决定好的事情",

           "做会被叫停的事情",
           "消失一段时间又回来了",
           "从预想外的地方（地下或者空中等）登场",
           "想到什么突然跑了起来",
           "责怪自己不中用",
           "在不知道的时候就解开了事件的一个谜",
           "一副知道事件相关事件的样子但是对谁都不说",
           "有留下便条或者邮件报告但是看不到人影",
           "看到钟表突然开始行动",
           "阅读和事件看来没什么关系的报纸记事",

           "读取人心，完成那人所想(拜托)的事",
           "与他人的悲喜同步，同喜或同悲 ",
           "时常不忘笑容，用平稳的话语使周围的人安心",
           "通过饮食，与人打好关系",
           "准确地将知识引用发挥出来，得到周围人的尊敬",
           "通过计算推导感情，理解人心",
           "考虑被害者的心情，慨叹着已失去的人或物",
           "讲述自己打算要做的事，促进他人理解",
           "谈论故乡或双亲的话题，尝试从源头上了解那个人",
           "认同助手/同伴所说的话",

           "过分地读取人心，引起不适",
           "想与他人同喜同悲却做过头，让人害怕",
           "虽然总是挂着笑容，但笑得太假反而让人不适",
           "虽想通过饮食打好关系，用餐方式却很奇怪",
           "展示学识时却炫耀起罕有人知的知识范畴，引人害怕",
           "想装作理解感情的样子，却没能理解关键之处 ",
           "慨叹已失去的人或物时，只能用数字来表达",
           "做事想有人情味，结果却采取了乍看很难懂的行动 ",
           "想要谈论故乡或双亲，却合不上话题",
           "装作认同助手/同伴所说的话，却被看穿",

           "将搭档/他人的小物件调包（调换） ",
           "向食物中加入大量调味料",
           "披着床单现身吓人",
           "变装打扮后登场 ",
           "对休息中的搭档/他人恶作剧，让对方理睬自己",
           "唐突地戳一戳搭档/他人的脸 ",
           "不经意地试着触碰搭档/他人",
           "试着撒很难懂的谎 ",
           "试着撒很明显的谎",
           "试着开始躲猫猫（捉迷藏）",

           "露出知晓事件相关重要事项的表情，却不肯说 ",
           "“这样啊，原来是这么一回事啊”",
           "得意洋洋地点头，却不明说详情 ",
           "做出仿佛已预知未来的言行",
           "扬言已有关于犯人/敌人的头绪，却不细说",
           "让一无所知的周围群众看到自己不耐烦的样子",
           "一言一行摆起架子",
           "每次遇到人都露出冷笑",
           "一瞬间露出悲伤神色，马上又变回平常的表情",
           "“还没得到确信”",

           "快要想起什么，却想不起来",
           "在助手/同伴或客座的提醒下想起自己有话还没说 ",
           "有想说的内容，却因时机不佳说不出口",
           "跟不上话题/情节的发展 ",
           "滔滔不绝，却不说关键的部分",
           "发出“啊——！”的大叫，却不肯说为何 ",
           "表露出因不遂愿而急躁不爽的样子 ",
           "想起稍早前不顺利的事而闷闷不乐 ",
           "表露出对搭档/他人抱持着焦躁心绪的样子",
           "有话想对搭档/他人说，却最终都没说出口",

           "吐血或流鼻血",
           "抱住助手/同伴",
           "开始引用古典诗歌或小说 ",
           "毫无关系的前提下突然开始谈论兴趣话题",
           "吟诵诗歌（念诗） ",
           "突然开始回想有关回忆之物的事",
           "事到如今重新想起上次事件时发生的事",
           "撒娇表示哪里都不想去",
           "突然开始挥霍游玩并把账都推给助手/同伴付",
           "重新考虑与搭档/他人之间的关系",

           "对没有集中精力在事件上的搜查相关人员发火",
           "对犯人/敌人感到非常气愤",
           "试图推理搭档/他人的想法",
           "过于集中精神地思考谜题的各种可能性",
           "直接用「这样不行」这样的话否定别人",
           "在聊着别的话题时，突然开始说关于事件的事",
           "短时间内，只吃喜欢吃的东西",
           "一直在玩游戏或者进行兴趣活动",
           "没什么干劲",
           "突然冒出干劲",

           "不等获得许可就拿走别人的东西",
           "谈话或调查的途中就突然开始移动",
           "没有铺垫也不打招呼，唐突向人打听事件的事",
           "说着「对了！」的同时拽着搭档/他人的手开始移动",
           "突然对人说出「你就是犯人/敌人吧」",
           "装成突然想起搭档/他人曾经欲言又止的话并追究",
           "不作任何说明直接给出结论",
           "比搭档/他人更快地展开行动",
           "做出难以理解的行动，也不给任何说明",
           "指示大家的行动，但不解释理由或目的",

           "使用「能做到是当然的啊」这种说话方式",
           "使用「连这种事都做不到吗」这种说话方式",
           "做出一副无语的样子",
           "对做不到的事感到绝望，也不再理会",

           "了解了想知道的事情后对之后的内容失去兴趣",
           "毫不避讳地在人前说起别人的失误或失败",
           "不会直说，但摆出一副搭档/他人或搭档/他人的物品是自己的所有物的态度",
           "拜托别人帮忙，不等回应就自顾自地行动",
           "态度傲慢地使唤别人，也不道谢",
           "无自觉地采取高高在上的态度",

           "无论遇上什么事，都想要霸占搭档/他人身旁的位置",
           "搭档/他人跟别人说话时露骨地表现不爽",
           "当搭档/他人集中于思考事件而忽视自己就会发火",
           "总是站在搭档/他人的身后，监视其一举一动",
           "当搭档/他人想要做什么的时候吵嚷着吸引其注意力",
           "不跟搭档/他人以外的人说话",
           "唐突地准备搭档/他人喜欢的东西",
           "没有任何预兆地感到不安，尽量地靠近搭档/他人",
           "担心会失去搭档/他人而感到不安",
           "拼命引导搭档/他人说出能让自己安心的话",

           "非常认真地搜查",
           "好好地听事件相关人员的话",
           "认真地听搭档/他人说话",
           "与人闲聊而不跑题",
           "不抱怨地认真工作",
           "好好休息",
           "阅读搜查资料",
           "在行动前会先说明理由",
           "体谅搭档/他人",
           "难过的时候会说难过，开心的时候会说开心",

           "任性地对搭档/他人提出想吃到自己喜欢的食物，在要求被回应前不会进行任何行动",
           "对搭档/他人提出自己失去干劲了，要求其做点什么能让自己拿出干劲的事情",
           "收集癖爆发，在把现在正在收集的收藏道具集齐前不会进行其他行动",
           "任性地让搭档/他人快去做点什么有趣的事",
           "每当遇上什么事都会说任性的话",
           "直截了当地重复自己的欲求，在欲求被达成前都会不停地重复",
           "试图将事情向着自己所想的方向诱导，如果失败就会摆出一张臭脸",
           "试图隐藏自己的欲求，但无法完全藏住",
           "在自己的任性行为被满足前会一直发脾气",
           "说出任性的话。不管有没有得到解决，都会继续说别的任性的话",

           "对嫌疑人、搭档/他人、同伴进行诱导询问",
           "目的不明地让搭档/他人或同伴去刺探",
           "在指示下达之前就抵达了现场",
           "不管怎样先全力以赴地探查相关者的情况",
           "将相关资料全部阅览完毕",
           "自己对事件情况进行了假设",
           "向搭档/他人说明现阶段对事件的见解",
           "总而言之先探索眼下可见的东西",
           "将可疑的物件或人物记录在笔记里",
           "将类似的过往案例作为参考引证",

           "把搭档/他人撂下一个人去了现场",
           "一言不发的拉着搭档/他人一起出去",
           "留下写有目的地的纸条先走了",
           "突然开始找东西",
           "好像想到了什么但是什么都不说",
           "意味深长地点点头",
           "浮现出意味深长的笑容",
           "「……好」",
           "「就这么做吧」",
           "「我理解了」",

           "优雅地喝茶",
           "优雅地下国际象棋或者将棋",
           "听古典音乐",
           "阅读和工作无关的书",
           "看报纸",
           "开始整理身边的东西",
           "用端正优美的姿势落座",
           "转瞬之间完成了文书工作",
           "开始冥想",
           "开始预约餐食",

           "不让人看见脸或者表情",
           "目测他人脚的尺寸",
           "判别他人的话语是否为谎言",
           "学习说话的方式与动作",
           "探查是否违法",
           "调查是否有可疑的人物或者证物",
           "擅长聆听",
           "嗅闻气味",
           "用地图确定场所位置",
           "确认监视摄像头的位置",
           "怪癖：单箭头",
           "怪癖：间谍被同化",
           "怪癖：愚忠",
           "怪癖：走上歧途",
           "怪癖：自卑",
           "怪癖：狼狈为奸",
           "怪癖：真小人",
           "怪癖：假君子",
           "怪癖：替身",
           "怪癖：貌合神离",
           "怪癖：一人独活",
           "怪癖：团灭结局",
           "怪癖：意难平",
           "怪癖：由恨生爱",
           "怪癖：由爱生恨",
           "怪癖：嫉妒",
           "怪癖：互相背叛",
           "怪癖：一方背叛",
           "怪癖：NTR",
           "怪癖：小妈",
           "怪癖：骨科",
           "怪癖：绑架幻想",
           "XP：生理性xx",
           "怪癖：父子",
           "XP：边做边骂（？？？？？）",
           "XP：痴汉变态",
           "XP：角色的加冕与脱冕（Power Play）",
           "XP：调教",
           "XP：只有一个人的PWP（Porn Without Plot）",
           "XP：蒙眼",
           "XP：捆绑",
           "XP：PWP（Porn Without Plot）（请自行决定各种不堪入耳的细节和名词...）",
           "XP：醉酒",
           "XP：道具",
           "XP：制服（名词）",
           "XP：SM",
           "XP：野外",
           "XP：镜面",
           "XP：下药",
           "XP：克苏鲁（？）",
           "XP：生子/怀孕",
           "XP：跨种族",
           "XP：兽化",
           "XP：公共场合",
           "XP：窒息",
           "XP：Mob",
           "XP：战损",
           "XP：乱伦",
           "XP：主仆",
           "XP：绝对不可以欺负小孩子",
           "XP：Gore",
           "XP：异装",
           "XP：囚禁",
           "XP：边做边打（？？？）",
           "XP：恶堕：洗脑（调教、药物污染、精神改造）",
           "XP：恶堕：改造（身体、大脑）",
           "XP：恶堕：同步（连锁恶堕）",
           "XP：恶堕：凭依（夺舍、附体）",
           "XP：恶堕：绝望（人为、故意造成的绝望，挫折、私仇、不惜一切、生存危机、个中缘由、其他日常）",
           "XP：恶堕：同化（收留、融合）",
           "XP：恶堕：寄生",
           "XP：恶堕：怨灵化",
           "XP：恶堕：尸体操纵",
           "XP：恶堕：(被)觉醒",
           "XP：恶堕：人格改变",
           "XP：恶堕：地位（尊卑）改变",
           "怪癖：打死不说",
           "怪癖：工具人",
           "怪癖：一见误终身",
           "怪癖：守寡",
           "怪癖：生错阵营",
           "怪癖：道德绑架",
           "怪癖：心理阴影",
           "怪癖：夜不能寐",
           "怪癖：小孩子气",
           "怪癖：泥塑",
           "怪癖：护短，但失败了",
           "怪癖：至死都蒙在鼓里",
           "怪癖：不该愈合的伤口",
           "怪癖：为了某项原则拍案而起，昭告天下，之后却发现自己是错的。",
           "XP：触手（及其衍生）"
           ]
# 特征列表
trait_mec_list = [
    "特征是娇生惯养 ：效果：智力(INT)-1(5)，体质(CON)+2(10)",
    "特征是粗壮 ：效果：体型(SIZ)+1(5)",
    "特征是灵敏 ：效果：敏捷(DEX)+1(5)。当体型(SIZ)小于等于9(45)时，灵敏而又娇小，敏捷(DEX)+2(10)",
    "特征是时尚 ：效果：一直注意着衣装打扮，外貌(APP)+1(5)",
    "特征是天才 ：效果：天生脑袋动得快，智力(INT)+1(5)",
    "特征是意志坚定 ：效果：不会对意志(POW)和SAN带来变动，现在的理智值+5点。但是不能超过最大理智值。",
    "特征是努力家 ：效果：教育(EDU)+1(5)。且无视教育(EDU)带来的年龄下限。",
    "特征是幸运的守护符 ：效果：拥有幸运守护符。只要带在身边意志(POW)+1，如果没带在身边就会招来不幸意志(POW)-1。意志(POW)的增减会影响幸运，但不会影响理智值。",
    "特征是家传的宝物 ：效果：拥有画卷、书籍、武器、家具等宝物，对于探索者或者故事整体带来特别的价值。也许宝物是拥有魔法力量的神器",
    "特征是无法预期的协助者 ：效果：探索者拥有一位对自己尽忠、也许会前来救援的协助者。KP决定协助者是谁，LUCK决定协助者的影响力。",
    "特征是手指灵活 ：效果：任意一个“手艺”的基本成功率为50%。且“机械维修”和“电器维修”+10%",
    "特征是存在感弱 ：效果：一出生就不受人注目。“潜行”和“躲藏”+20%",
    "特征是有名人之子 ：效果：“信用”+20%",
    "特征是藏书者 ：效果：“图书馆”+20%。且就算不去图书馆也可以在自己的书库里进行“图书馆”判定",
    "特征是观察力敏锐 ：效果：“侦查”+30%",
    "特征是户外爱好者 ：效果：“方向感”、“自然史”、“跟踪”+20%",
    "特征是技能稀奇 ：效果：探索者可以在KP的同意下，获得一个对日常生活没有帮助只有特定的人感兴趣的技能，“智力(INT)*5”%",
    "特征是艺术天赋 ：效果：任意的一个“艺术”技能加“智力(INT)*3”%，玩家指定音乐、评论等专业。",
    "特征是海归 ：效果：获得“教育(EDU)*5”%点数，加到最多3个“其他语言”技能上",
    "特征是前职业 ：效果：获得“教育(EDU)*3”%点数，加到玩家决定的前职业的职业技能上",
    "特征是天气预报员 ：效果：看向外面，通过“灵感(IDEA)”判定，则可以预知短时间([1D6+1]小时)内的天气。可以预测到降水概率、风向、风强度、台风的时间带、容易产生落雷的地方等。",
    "特征是职业车手 ：效果：所有“汽车驾驶”技能基本成功率为50%",
    "特征是暴走族 ：效果：所有“驾驶(Pliot)”技能基本成功率为50%",
    "特征是战士 ：效果：把周围的一切都当做武器。所有近战武器(不包括使用肉体的技能)的基本成功率为50%",
    "特征是枪炮达人 ：效果：5个枪支技能的基本成功率为50%",
    "特征是格斗家 ：效果：3个空手战斗技能的基本成功率为50%",
    "特征是骏捷 ：效果：“回避”的基本成功率变为“敏捷(DEX)×5”",
    "特征是能够信赖的人 ：效果：只要还保持自己的好名声，就可以选择任意3个交流系技能，各+10%",
    "特征是体育全能 ：效果：任选4个运动系技能，其中1个技能+20%，3个技能+10%",
    "特征是平凡的姿容 ：效果：“乔装”+20%。对方只见过你一回，并且对方没有通过“灵感(IDEA)”判定的话，你可以用“我大众脸”的借口，让对方以为没见过你。",
    "特征是眼神凶煞(D) ：效果：外貌(APP)-1(5)，且“信用”-10%",
    "特征是路痴(D) ：效果：“方向感”基本成功率为1%，且无法通过经验判定获得成长",
    "特征是害羞(D) ：效果：对异性的“快速交谈”、“说服”、“信用”各-10%",
    "特征是被动物讨厌(D) ：效果：大多数动物只要看到探索者就会进行恐吓",
    "特征是不可思议(D) ：效果：也许从别的世界来的精神交换者或是妄想延伸出来的人格会渐渐显形",
    "特征是吸引物(D) ：效果：容易招怪物的喜爱。如果被怪物带走了的话，不会被杀，而是会被监禁或是更糟糕。",
    "特征是带着眼镜(D) ：效果：失去眼镜的话，在KP的判断下，关于视觉的技能-20%",
    "特征是重要的东西(D) ：效果：一直将其他人不重视但是对自己很重要的东西带在身边，如果失去的话丧失理智点1/1D8",
    "特征是暗黑的祖先(D) ：效果：你是邪恶一族、食人者、超自然怪物的后裔。查看LUCK，骰目越高祖先越邪恶",
    "特征是害怕夜晚(D) ：效果：深夜12点以后还要活动的话，“灵感(IDEA)”和“知识”判定的成功范围变为各自的1/2。但是擅长早起",
    "特征是受动物喜欢 ：效果：大多数动物会跟探索者亲近",
    "特征是脑洞 ：效果：发疯后，探索者特有的感性可以看穿隐藏在恐怖身后的真相。KP可以在黑幕时为之揭示一部分的宇宙恐怖吧。(但黑幕以外可以什么也不告诉)",
    "特征是失败是发明之母 ：效果：技能判定中骰出“96”或以上骰目，并“失败”的话，立即进行特别的经验判定，失败的话0点，成功则获得1点技能点数",
    "特征是宠物 ：效果：探索者拥有最爱的狗、猫、鸟等。在游戏的一段故事结束后，可以通过相互互动，回复理智值1D3点。但是不能超过能力值SAN或最大理智值点数。",
    "特征是马虎 ：效果：马上就会忘记不好的事情。可以在精神病院或精神治疗科回复的理智值+1。",
    "特征是病毒抗性 ：效果：骰毒物(POT)抵抗表时，成功范围+20%",
    "特征是潜水达人 ：效果：对窒息的体质(CON)判定的成功范围+20%",
    "特征是酒鬼 ：效果：以酒精为毒物的时候，对探索者来说，所有关于酒精的POT为1/2(小数入)。",
    "特征是顽强 ：效果：所有使用抵抗表的时候，成功范围+5%",
    "特征是招架者 ：效果：冲击的体质(CON)判定的成功范围+20%",
    "特征是奇妙的幸运 ：效果：当神格或神话生物随机指定攻击目标时，你被排除在外。单独攻击或范围攻击时，不适用。",
    "特征是投掷天才 ：效果：<投掷>时的武器伤害加值不是1/2，而是适用通常的伤害加值。",
    "特征是钢铁力量 ：效果：伤害加值上升一段(-1D4变成0,0变成+1D4)。但伤害加值是1D6或以上的时候，不上升一段而是加值再+1",
    "特征是还活着 ：效果：从死亡中生还的机会不是下一回合，而是5回合以内。",
    "特征是看穿弱点 ：效果：贯穿的几率不是通常的1/5，而是1/2，但最大为40%。",
    "特征是快速恢复 ：效果：生命力的回复判定结果+1",
    "特征是不屈精神 ：效果：晕倒，则可在接下来的各回合开始时进行[体质(CON)×2]的判定，成功则就算不接受治疗，该回合起也可以再次行动",
    "特征是收集爱好者 ：效果：任选一种收集物。你在该收集方面很有名，通过<幸运>判定的话，对方会感同身受，被你感动。",
    "特征是失踪的家人 ：效果：探索者有家人失踪了，长篇跑团过程中可能会出现(遇到海难、据说死于异国他乡、被其他亲人带走等)",
    "特征是抱有好感 ：效果：你对游戏中登场的某人抱有好感，由KP裁定，该人是谁、为何抱有好感。LUCK决定抱有多大好感(越高越喜欢)"]
# mbti列表
mbti_list = ["INFP：调停者（Mediator）“凡是金子未必都发光，流浪的人未必都迷茫，老而弥坚者不会凋零，深根不会被寒霜触及。（托尔金）”",
             "INTP：逻辑学家（Logician）“借鉴昨天，活在今天，憧憬明天。 重要的是绝不停止质疑。（爱因斯坦）”",
             "INTJ：建筑师（Architect）“你并非有权力发表看法。你的权利是发表有根据的看法。没人有无知的权利。（哈伦·埃利森）”",
             "INFJ：提倡者/倡导者（Advocate）“每个人都需要做出选择，是走在富有创造力的利他主义之光中，还是具有破坏性的自私自利的黑暗中。（马丁·路德·金）”",
             "ENFP：竞选者（Campaigner）“你用什么谋生方式，我不关心；我想知道，你的追求，你是否敢于梦想去触碰你内心的渴望。你的年龄多大，我不关心；我想知道，你是否愿意像傻瓜一样不顾风险，为了爱，梦想，还有活着就该有的冒险。（山居梦客(Oriah Mountain Dreamer)）”",
             "ENTP：辩论家（Debater）“追寻危险而独立的思想者的脚步。不畏争议表达观点。说出你的想法，宁愿被当作精神病也不受盲从的耻辱。对于你认为重要的问题，无论如何也要表达立场且坚决拥护。（托马斯·约翰·沃森）”",
             "ENTJ：指挥官（Commander）“你的时间是有限的，所以不要浪费它为别人而活。不要陷入教条 — 活在其他人的思想成果之中。不要让他人意见产生的噪音淹没你自己的心声。最重要的是，要拥有追随你的内心和直觉的勇气。他们已经知道你真正想成为什么。其他所有都是次要的。（史蒂夫·乔布斯）”",
             "ENFJ：主人公（Protagonist）“你此时此刻做的任何事都会激起涟漪影响他人。你的姿态可以照亮心扉也可以传播焦虑。你的气息可以将爱散发也可以使愁云笼罩。你的一瞥可以唤起欢乐。你的言语可以启发自由。你的每个动作都可能打开一扇心灵之窗。（大卫·戴达）”",
             "ISFP：探险家（Adventurer）“在一天中我会变化。醒来时是一个人，睡觉时却明明是另一个人。（鲍勃·迪伦）”",
             "ISTP：鉴赏家/艺术能手（Virtuoso）“我想要享受人生，一个不同的人生。我不想每天去去到同一个地方，遇见同样的人，做一样的工作。我期待有趣的挑战。（哈里森·福特）”",
             "ISTJ：物流师/军需官（Logistician）“我的观察是每当某个任务一个人就可以完成… 两个人就会做得更差，三个或更多人时则几乎没什么行动。（华盛顿）”",
             "ISFJ：守卫者（Defender）“只有分享才能把爱增加。只用奉献更多才能得到更多。（博恩·崔西）”",
             "ESFP：表演者（Entertainer）“我自私，没耐心，还有点缺少安全感。我会犯错，会失控，而且有时让人难以应付。但如果你接受不了我最坏的一面，你就不配拥有我最好的一面。（玛丽莲·梦露）”",
             "ESTP：企业家（Entrepreneur）“生活，要么是场大胆的冒险，要么什么都不是。（海伦·凯勒）”", "ESTJ:总经理/执行官（Executive）“良好的秩序是一切的基础。（埃德蒙·伯克）”",
             "ESFJ：执政官（Consul）“让我们互相支持，鼓舞，赋予力量。 让每个人的正能量都被所有人感受到。（黛博拉·戴）”"]
# 穿着列表
app_list = ["奢华",
    "西装",
    "休闲装",
    "正装",
    "运动装",
    "平价",
    "墨镜",
    "衬衫",
    "T恤",
    "项链",
    "帽子",
    "军装风格",
    "耳钉/钉",
    "套衫/针织衫",
    "接发",
    "和服",
    "戒指",
    "项圈/贴颈项链",
    "凉鞋",
    "宽松夹克/套头衫/无袖连衣裙",
    "不注意打扮",
    "西装",
    "披肩外套",
    "白大褂",
    "手套",
    "烟斗",
    "背心",
    "和服",
    "色彩缤纷",
    "和搭档/他人一样",
    "有特征的唇膏",
    "眼罩",
    "靴子",
    "卫衣",
    "围巾",
    "挑染",
    "全权交由理发店决定",
    "内层染",
    "没打理的头发",
    "露肩装",
    "凉鞋",
    "交由妈妈/姐姐/友人等决定24",
    "蝴蝶领结",
    "厚底鞋",
    "汉字 T 恤",
    "高筒礼帽",
    "带有蝴蝶结",
    "编织帽",
    "绷带",
    "爆炸头",
    "（袖口衣领帽边镶毛的）毛边大衣",
    "超高级品牌",
    "单片眼镜",
    "动画角色的Cosplay",
    "放大镜",
    "米字旗图案",
    "女仆装或管家服",
    "学生服",
    "浴衣和服",
    "在哪都穿 T 恤",
    "喜欢的Cosplay"]
# 动机列表
motive_list = {"_年龄": [
    "考虑到其岗位，异常年轻。",
    "年轻的，也许是在其岗位上崭露头角的人。",
    "在他们的岗位上已经年长或成熟。",
    "衰朽的，也许已经过了以前的辉煌期，或者还在坚守。"
],
    "_职业": [
        "街头罪犯、妓女、暴徒、扒手或类似人员。",
        "政府官员，警察，或国家的代理人。",
        "教师、教授或其他教育工作者。",
        "医生、护士、家庭保健员或保健工作者。",
        "日工、油炸厨师、园艺师或地位低下的蓝领。",
        "程序员、技术员、IT官员或其他技术人员。",
        "木匠，水管工，或熟练的蓝领工人。",
        "音乐家、歌手、舞者或其他艺人。",
        "商人、文员、银行家或其他白领工作。",
        "退休或丧失工作能力；重骰得到原来的工作。"
    ],
    "_令人难忘的怪癖": [
        "一个非常令人讨厌的口癖或重复的词语。",
        "保养得一尘不染或时尚的服装。",
        "明显的整容手术，品味不高。",
        "肢体缺失或明显的大疤痕。",
        "非常喜欢动物，可能有很多宠物。",
        "明显的性取向或少数族裔身份。",
        "与其工作有关的不寻常的气味在他们身上萦绕。",
        "总是忘记事情或对简单的事情摸不着头脑。",
        "习惯性的神经性运动抽搐。",
        "对当地的某一民族、阶级或政治团体有强烈的蔑视感。",
        "不得体的着装，太多或太少。",
        "总是要求别人帮忙或 '借钱'，无论是小事还是大事。",
        "有一个难以置信的梦想，以一种无效的方式追梦。",
        "对他们发现的任何情况都有充分的准备。",
        "极其沉默寡言，喜欢用手势交流。",
        "面部有刺青、穿孔或其他积极的身体修饰。",
        "对一个人有不合理的好感或厌恶。",
        "有一个引人注目的不寻常的身体特征。",
        "总是谈论和思考他们的家庭。",
        "性格极其平淡，只对自己的工作感兴趣。"
    ],
    "_社会地位": [
        "一个被遗弃的人，无论是因为职业还是个人素质。",
        "一个未经证实的人或不被信任的新来者。",
        "一个可靠的社区成员。",
        "一个当地的支柱，但却在暗地里犯着违反礼节的罪行。",
        "以前受人尊敬，但现在名声不佳的人。",
        "被许多人爱戴和钦佩，被其他同行羡慕的人。"
    ],
    "_与情况的关系": [
        "一个偶然闯入事件本身的旁观者。",
        "工作与情况的某些部分有关的人。",
        "一个不知情的卒子，对某人的计划是必要的。",
        "被威胁或利益诱导的不情愿的参与者。",
        "有亲戚或朋友成为其受害者的人。",
        "负责隐藏它或调查它的人。",
        "偶然发现其后果或遗迹的人。",
        "已经躲藏起来，被认为已经死亡或沉默的人。"
    ],
    "_驱使他们的问题": [
        "他们或所爱的人受到了暴力威胁。",
        "他们欠了涉事者很多钱。",
        "涉事者对他们进行了严重的勒索。",
        "他们觉得对涉事者有很大的人情债务。",
        "他们对涉事者提供的某种东西上瘾。",
        "他们在犯罪中合作过，现在不敢反抗了。",
        "他们需要一个人情，必须为之服务才能从某人那里赢得。",
        "涉事者如果愿意，可以在经济上毁掉他们。",
        "他们令人不安地经常做出糟糕的选择。",
        "有凶猛的野心，只能由涉事者协助。",
        "他们想要复仇，而涉事者可能会协助他们。",
        "他们对涉事者有严重的误解。"
    ],
    "_他们在这一情况中的优势": [
        "大量的金钱和它所能购买的服务。",
        "个人力量和强大的暴力容忍度。",
        "社区的热爱和他们的快速合作。",
        "一群愿意为他们做任何事的朋友。",
        "在需要时可以获得非法物品和武器装备。",
        "知道一个有利于对付PC的秘密。",
        "对处理问题有帮助的亲属网络。",
        "出色的欺骗和背叛的能力。",
        "一个可怕的庇护者，会惩罚任何伤害他们的人。",
        "作为一个地方官员或政府代理人的认可。",
        "获得一种神秘的力量或邪恶的魔法。",
        "对PC或其朋友和盟友的勒索。"
    ]}
# 特质列表
trait_list = {"描述": [
    "结实的",
    "英俊的",
    "笨拙的",
    "机灵的",
    "迷人的",
    "娃娃脸",
    "聪明的",
    "邋遢的",
    "死人脸",
    "肮脏的",
    "耀眼的",
    "书呆子",
    "年轻的",
    "疲倦脸",
    "肥胖的",
    "啤酒肚",
    "长头发",
    "苗条的",
    "优雅的",
    "稀烂的",
    "矮壮的",
    "苍白的",
    "阴沉的",
    "平庸的",
    "乐观的",
    "棕褐色",
    "皱纹人",
    "古板的",
    "狐臭的",
    "狡猾的",
    "健壮的",
    "娇俏的",
    "筋肉人",
    "魁梧的",
    "迟钝的",
    "虚弱的"
], "思想信念": ["你信仰并祈并一位大能。（例如毗沙门天、耶稣基督、海尔·塞拉西一世）",
            "人类无需上帝。（例如坚定的无神论者，人文主义者，世俗主义者）",
            "科学万能！科学万岁！你将选择其中之一。（例如进化论，低温学，太空探索）",
            "命中注定。（例如因果报应，种姓系统，超自然存在）",
            "社团或秘密结社的一员。（例如共济会，女协，匿名者）",
            "社会坏掉了，而你将成为正义的伙伴。应斩除之物是？（例如毒品，暴力，种族歧视）",
            "神秘依然在。（例如占星术，招魂术，塔罗）",
            "诸君，我喜欢政治。（例如保守党，共产党，自由党）",
            "“金钱就是力量，我的朋友，我将竭尽全力获取我能看到的一切。”（例如贪婪心，进取心，冷酷心）",
            "竞选者/激进主义者。（例如女权运动人，平等主义家，工会权柄）"], "重要之人": ["父辈。（例如母亲，父亲，继母）",
                                                        "祖父辈。（例如外祖母，祖父）",
                                                        "兄弟。（例如妹妹，半血亲妹妹，无血缘妹妹）",
                                                        "孩子。（儿子或女儿）",
                                                        "另一半。（例如配偶，未婚夫，爱人）",
                                                        "那位指引你人生技能的人。指明该技能和该人。（例如学校教师，师傅，父亲）",
                                                        "青梅竹马。（例如同学，邻居，幼驯染）",
                                                        "名人。偶像或者英雄。当然也许你从未见过他。（例如电影明星，政治家，音乐家。）",
                                                        "游戏中的另一位调查员伙伴。随机或自选。",
                                                        "游戏中另一外ＮＰＣ。详情咨询你的守秘人。"],
    "原因": ["你欠了他们人情。他们帮助了你什么？（例如，经济上，困难时期的庇护，给你第一份工作）",
           "他们教会了你一些东西。（例如，技能，如何去爱，如何成为男子汉）",
           "他们给了你生命的意义。（例如，你渴望成为他们那样的人，你苦苦追寻着他们，你想让他们高兴）",
           "你曾害了他们，而现在寻求救赎。例如，偷窃了他们的钱财，向警方报告了他们的行踪，在他们绝望时拒绝救助）",
           "同甘共苦。（例如，你们共同经历过困难时期，你们携手成长，共同度过战争）",
           "你想向他们证明自己。（例如，自己找到工作，自己搞到老婆，自己考到学历）",
           "你崇拜他们。（例如，崇拜他们的名头，他们的魅力，他们的工作）",
           "后悔的感觉。（例如，你本应死在他们面前，你背弃了你的誓言，你在可以助人之时驻足不前）",
           "你试图证明你比他们更出色。他们的缺点是？（例如，懒惰，酗酒，冷漠）",
           "他们扰乱了你的人生，而你寻求复仇。发生了什么？（例如，射杀爱人之日，国破家亡之时，明镜两分之际）"], "意义非凡之地": ["你最爱的学府。（例如，中学，大学）",
                                                                           "你的故乡。（例如，乡下老家，小镇村，大都市）",
                                                                           "相识初恋之处。（例如，音乐会，度假村，核弹避难所）",
                                                                           "静思之地。（例如，图书馆，你的乡土别墅，钓鱼中）",
                                                                           "社交之地。（例如，绅士俱乐部，地方酒吧，叔叔的家）",
                                                                           "联系你思想/信念的场所。（例如，小教堂，麦加，巨石阵）",
                                                                           "重要之人的坟墓。（例如，另一半，孩子，爱人）",
                                                                           "家族所在。（例如，乡下小屋，租屋，幼年的孤儿院）",
                                                                           "生命中最高兴时的所在。（例如，初吻时坐着的公园长椅，你的大学）",
                                                                           "工作地点。（例如，办公室，图书馆，银行）"],
    "宝贵之物": ["与你得意技相关之物。（例如华服，假ＩＤ卡，青铜指虎）",
             "职业必需品。（例如医疗包，汽车，撬锁器）",
             "童年的遗留物。（例如漫画书，随身小刀，幸运币）",
             "逝者遗物。（例如烛堡，钱包里的遗照，信）",
             "重要之人给予之物。（例如戒指，日志，地图）",
             "收藏品。（例如撤票，标本，记录）",
             "你发掘而不知真相的东西。答案追寻中。（例如，橱柜里找到的未知语言信件，一根奇怪的从父亲出继承来的来源不明的风琴，花园里挖出来的奇妙的银球）",
             "体育用品。（例如，球棒，签名棒球，鱼竿）",
             "武器。（例如，半自动左轮，老旧的猎用来福，靴刃）",
             "宠物。（例如狗，猫，乌龟）"], "特点": ["慷慨大方。（例如，小费大手，及时雨，慈善家）",
                                      "善待动物。（例如，爱猫人士，农场出生，与马同舞）",
                                      "梦想家。（例如，惯常异想天开，预言家，创造者）",
                                      "享乐主义者。（例如，派对大师，酒吧醉汉，“放纵到死”）",
                                      "赌徒，冒险家。（例如，扑克脸，任何事都来一遍，活在生死边缘）",
                                      "好厨子，好吃货。（例如，烤得一手好蛋糕，无米之炊都能做好，优雅的食神）",
                                      "女人缘/万人迷。（例如，长袖善舞，甜言蜜语，电眼乱放）",
                                      "忠心在我。（例如，背负自己的朋友，从未破誓，为信念而死）",
                                      "好名头。（例如，村里最好的饭后聊天人士，虔信圣徒，不惧任何危险）",
                                      "雄心壮志。（例如，梦想远大，目标是成为BOSS，渴求一切）"]}

# timer计算
place = "某地"
weather = "晴"
time = datetime.now().strftime("%H:%M")
date = datetime.now().strftime("%Y/%m/%d %A")
# 自动Timer计算
_secondsTime = 0
# 角色语速（字/秒）
_speechspeed = 5

time_1s = ["语", "法律", "历史", "司法科学", "地质学", "估价", "人类学", "考古学", "天文学", "生物学", "植物学", "化学", "密码学", "克苏鲁神话", "数学", "气象学",
           "博物学", "神秘学", "药学", "物理", "读唇", "骑术", "生存", "动物学"]
time_3s = ["心理学", "聆听", "侦查", "斗殴", "闪避", "斧头", "连枷", "矛", "剑", "鞭子", "弓", "手枪", "机枪", "步枪", "霰弹枪", "步枪/霰弹枪", "冲锋枪",
           "急救",
           "困难跳跃", "跳跃", "攀爬", "困难攀爬", "妙手", "投掷", "困难投掷", "炮术", "爆破"]
time_1min = ["困难骑术", "困难法律", "驾驶", "会计", "困难侦查", "困难聆听", "困难心理学", "恐吓", "说服", "魅惑", "话术", "链锯", "困难急救", "极难跳跃", "极难攀爬",
             "困难妙手", "极难投掷", "困难潜行", "重武器", "火焰喷射器", "锁匠"]
time_5min = ["极难骑术", "重型机械", "极难法律", "潜水", "乔装", "医学", "极难急救", "困难锁匠", "领航", "伪造", "极难妙手", "极难潜行", "极难聆听", "极难心理学"]
time_10min = ["困难乔装", "表演", "美术", "写作", "书法", "舞蹈", "歌剧", "声乐", "摄影", "困难恐吓", "困难说服", "图书馆", "计算机", "电脑", "困难会计",
              "困难魅惑", "困难话术", "极难急救", "困难锁匠", "困难领航"]
time_30min = ["极难乔装", "极难话术", "困难医学", "极难领航", "精神分析", "困难追踪", "木匠", "厨艺", "雕塑", "陶艺", "极难侦查"]
time_1h = ["困难表演", "困难美术", "困难写作", "困难书法", "困难舞蹈", "困难歌剧", "困难声乐", "困难摄影", "困难电气维修", "困难电子学", "困难机械维修", "极难锁匠",
           "困难精神分析", "困难图书馆", "困难计算机", "困难电脑", "极难会计", "困难伪造"]
time_3h = ["极难表演", "极难书法", "极难舞蹈", "极难歌剧", "极难声乐", "极难摄影", "极难电子学", "极难电气维修", "极难医学", "极难精神分析", "极难追踪", "极难计算机", "极难电脑",
           "困难雕塑", "困难陶艺", "困难木匠", "困难厨艺", "极难伪造"]
time_12h = ["极难图书馆", "极难美术", "极难写作", "极难木匠", "极难厨艺", "极难雕塑", "极难陶艺"]
time_1d = []
time_1w = []
time_skill = {"time_1s": time_1s, "time_3s": time_3s, "time_1min": time_1min, "time_5min": time_5min,
              "time_10min": time_10min,
              "time_30min": time_30min,
              "time_1h": time_1h, "time_3h": time_3h, "time_12h": time_12h, "time_1d": time_1d,
              "time_1w": time_1w}

env = {"Place": place, "Weather": weather, "Time": time, "Date": date}

Fumble_SKill = 20  # 启用96以上大失败的技能水平
Critical_Success_SKill = 60  # 启用5以下大成功的技能水平

bot_personality_ = {"Critical_Success": string_list_Critical_Success, "Extreme_Success": string_list_Extreme_Success,
                    "Hard_Success": string_list_Hard_Success, "Success": string_list_Success,
                    "Failure": string_list_Failure, "Fumble": string_list_Fumble,
                    "Fumble_at_96_SKill_Level": Fumble_SKill, "Critical_at_5_SKill_Level": Critical_Success_SKill,
                    "妙语": mav_words, "reason_string_list": reason_string_list,
                    "reason_silent_string_list": reason_silent_string_list}
bot_personality = bot_personality_
bot_personality_by_name_ = {"卢骰": bot_personality_, "DiceBot": bot_personality_}


# 成功率: 61.85%/70%[60/97]  →eval(_success/_fail+_success)/均值(_luck_exp_value)[成功/成功+失败] →_luck/_luck_exp[_success/_fail+_success]
# 排名: 2[≥73.80%]      →遍历计算 _luck排名 →排名[≥高于百分比%]
# 大成功出现率: 2.06%(2) →大成功出现率 →出现率(出现数): 大成功/成功+失败eval(_critical/_fail+_success)[_critical/_fail+_success] →_critical_rate
# 大失败出现率: 8.24%(8) →大失败出现率 →出现率(出现数): 大失败/成功+失败eval(_fumble/_fail+_success)[_critical/_fail+_success] →
# 加权成功率: 61.85%  →eval(_luck*0.5 + (_critical_rate - _fumble_rate)*0.5) →_luck_weight
# 加权排名: 2[≥73.80%]      →遍历计算 _luck_weight排名:  →加权排名[≥高于百分比%]
# D100统计次数: 161     →掷骰总次数_d100
# 均值/期望[标准差]: 49.04/50.5[25.72%] →d100出目均值(_d100_value)/期望=50.5[标准差(_d100_value)]

def load_luck_by_name():
    try:
        # 尝试从JSON文件加载每个角色的luck(掷骰统计)
        with open('Bots/luck_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {
            'KP': {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0, "_fail": 0, "_fumble": 0,
                   "_fumble_rate": 0, "_critical": 0, "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []},
            'DiceBot': {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0, "_fail": 0,
                        "_fumble": 0, "_fumble_rate": 0, "_critical": 0, "_critical_rate": 0, "_d100_value": [],
                        "_luck_exp_value": []}}


def load_settings_status_icon():
    try:
        # 尝试从JSON文件加载状态的图标信息
        with open('AppSettings/status_icon_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[AppSettings/status_icon_settings.json]不存在，已重新创建json文件！")
        return {'状态名': {"_path": "", "des": ""}}


def load_settings_codename():
    try:
        # 尝试从JSON文件加载每个角色的codename
        with open('AppSettings/codename_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[AppSettings/codename_settings.json]不存在，如需使用codename替换功能，请创建json文件！")
        return {'_status': False, 'KP': 'KP', 'DiceBot': 'DiceBot'}


def load_settings_avatar():
    try:
        # 尝试从JSON文件加载头像路径
        with open('AppSettings/avatar_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': '', 'DiceBot': '',
                'PL 1': ''}


def load_items():
    try:
        # 尝试从JSON文件加载物品，附于状态栏之后，标记为“===物品===”
        with open('GameSaves/item_settings_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[GameSaves/item_settings_by_name.json]不存在，已重新创建json文件！")
        return {'KP': {"物品": [], "备注": [], "其他": []}, 'DiceBot': {"物品": [], "备注": [], "其他": []}}


def load_DiceBot_personality():
    try:
        # 尝试从JSON文件加载骰子性格路径
        with open('Bots/bot_personality_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return bot_personality_by_name_


def load_env():
    try:
        # 尝试从JSON文件加载
        with open('GameSaves/env_info.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return env


def load_settings_name():
    try:
        # 尝试加载姓名牌路径
        with open('AppSettings/name_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': 'KP', 'DiceBot': 'DiceBot',
                'PL 1': 'PL 1'}


def load_health_data():
    try:
        # 尝试加载角色可变数值路径
        with open('GameSaves/health_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': {'HP': 0, 'MP': 0, '状态': "正常"}, 'DiceBot': {'HP': 0, 'MP': 0, '状态': "正常"},
                'PL 1': {'HP': 0, 'MP': 0, '状态': "正常"}}


def load_health_data_by_name():
    try:
        # 尝试加载角色可变数值路径
        with open('GameSaves/health_data_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': {'HP': 0, 'MP': 0, '状态': "正常"}, 'DiceBot': {'HP': 0, 'MP': 0, '状态': "正常"}}


def load_infoCanvas_data():
    try:
        # 尝试加载角色简卡图片路径
        with open('AppSettings/infoCanvas_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_CardDeck(name):
    try:
        # 尝试加载角色简卡图片路径
        with open(f'CardDecks/{name}.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_icon_data():
    try:
        # 尝试加载角色状态icon路径
        with open('GameSaves/icon_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_role_skill_menu():
    try:
        # 尝试加载角色状态icon路径
        with open('GameSaves/skill_menu_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print("不存在GameSaves/skill_menu_by_name.json 无法使用快捷技能列表功能！")
        return {'KP': {'技能名[鉴定](要求)效果公式：描述': "skill", '法术名[效果公式](消费)：描述': "spell", '战技/特技名:效果[鉴定](要求)公式': "maneuver"}}


def undo(event, text_box):
    text_box.edit_undo()


def load_infoCanvas_data_by_name():
    try:
        # 尝试加载角色简卡图片路径
        with open('AppSettings/infoCanvas_data_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_dir_path():
    try:
        # 尝试加载角色差分目录路径
        with open('AppSettings/avatar_dir_path.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_PL_INFO():
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/pl_info.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_role_count():
    # 从配置文件加载角色数量，默认为0
    config = configparser.ConfigParser()
    config.read('AppSettings/config.ini')
    return int(config.get('Settings', 'RoleCount', fallback=0))


role_Chart_detail_demo = {
    "EDU": 0,
    "APP": 0,
    "DEX": 0,
    "STR": 0,
    "INT": 0,
    "CON": 0,
    "POW": 0,
    "SIZ": 0,
    "LUCK": 0,
    "教育": "EDU",
    "外貌": "APP",
    "敏捷": "DEX",
    "力量": "STR",
    "智力": "INT",
    "体质": "CON",
    "灵感": "INT",
    "意志": "POW",
    "体型": "SIZ",
    "幸运": "LUCK",
    "MOV": 8,
    "HP": "(CON+SIZ)/10",
    "MP": "POW/5",
    "SAN": "POW",
    "理智": "POW",
    "克苏鲁神话": 0,
    "克苏鲁": 0,
    "cm": 0,
    "信用": 0,
    "信用评级": 0,
    "会计": 5,
    "表演": 5,
    "美术": 5,
    "写作": 5,
    "书法": 5,
    "木匠": 5,
    "厨艺": 5,
    "舞蹈": 5,
    "歌剧": 5,
    "声乐": 5,
    "摄影": 5,
    "雕塑": 5,
    "伪造": 5,
    "陶艺": 5,
    "人类学": 1,
    "估价": 5,
    "考古学": 1,
    "魅惑": 15,
    "攀爬": 20,
    "计算机": 5,
    "计算机使用": 5,
    "电脑": 5,
    "乔装": 5,
    "闪避": "DEX/2",
    "汽车驾驶": 20,
    "电气维修": 10,
    "电子学": 1,
    "话术": 5,
    "斗殴": 25,
    "链锯": 10,
    "斧头": 25,
    "连枷": 10,
    "矛": 20,
    "剑": 20,
    "鞭子": 5,
    "弓": 15,
    "手枪": 20,
    "重武器": 10,
    "火焰喷射器": 10,
    "机枪": 10,
    "步枪": 25,
    "霰弹枪": 25,
    "步枪/霰弹枪": 25,
    "冲锋枪": 15,
    "急救": 30,
    "历史": 5,
    "恐吓": 15,
    "跳跃": 20,
    "拉丁语": 1,
    "汉语": 1,
    "日语": 1,
    "英语": 1,
    "德语": 1,
    "法语": 1,
    "西班牙语": 1,
    "意大利语": 1,
    "丹麦语": 1,
    "土著语": 1,
    "格陵兰语": 1,
    "俄语": 1,
    "母语": "EDU",
    "法律": 5,
    "图书馆": 20,
    "聆听": 20,
    "锁匠": 1,
    "机械维修": 10,
    "医学": 1,
    "博物学": 10,
    "天文学": 1,
    "生物学": 1,
    "植物学": 1,
    "化学": 1,
    "数学": 1,
    "密码学": 1,
    "工程学": 1,
    "法学": 1,
    "司法科学": 1,
    "地质学": 1,
    "气象学": 1,
    "药学": 1,
    "物理学": 1,
    "动物学": 1,
    "领航": 10,
    "神秘学": 5,
    "重型机械": 1,
    "说服": 10,
    "精神分析": 1,
    "驾驶": 1,
    "飞行器驾驶": 1,
    "船驾驶": 1,
    "心理学": 10,
    "骑术": 5,
    "科学": 1,
    "妙手": 10,
    "侦查": 25,
    "潜行": 20,
    "生存": 10,
    "游泳": 20,
    "投掷": 20,
    "追踪": 10,
    "驯兽": 5,
    "潜水": 1,
    "爆破": 1,
    "读唇": 1,
    "催眠": 1,
    "炮术": 1,
    "DB": 1,
    "#斗殴": "1D3+DB",
    "#链锯": "2D8穿",
    "#斧头": "1D8+2+DB穿",
    "#连枷": "1D8+DB",
    "#矛": "1D8+1穿",
    "#剑": "1D6+DB穿",
    "#鞭子": "1D3+DB/2",
    "#弓": "1D6+DB/2",
    "#手枪": "1D8穿",
    "#重武器": "5D10穿",
    "#火焰喷射器": "2D6+烧穿",
    "#机枪": "2D6+4穿",
    "#步枪": "1D6+1穿",
    "#霰弹枪": "4D6/2D6/1D6",
    "#冲锋枪": "1D10穿",
    "#步枪/霰弹枪": "1D6+1穿",
}


def load_Chart():
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/pl_Chart.json', 'r', encoding='utf-8') as file:
            # print(f"Problematic data: {file.read()}")
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {"KP": {
            "EDU": 0,
            "APP": 0,
            "DEX": 0,
            "STR": 0,
            "INT": 0,
            "CON": 0,
            "POW": 0,
            "SIZ": 0,
            "LUCK": 0,
            "教育": "EDU",
            "外貌": "APP",
            "敏捷": "DEX",
            "力量": "STR",
            "智力": "INT",
            "体质": "CON",
            "灵感": "INT",
            "意志": "POW",
            "体型": "SIZ",
            "幸运": "LUCK",
            "MOV": 8,
            "HP": "(CON+SIZ)/10",
            "MP": "POW/5",
            "SAN": "POW",
            "克苏鲁神话": 0,
            "克苏鲁": 0,
            "cm": 0,
            "信用": 0,
            "信用评级": 0,
            "会计": 5,
            "表演": 5,
            "美术": 5,
            "写作": 5,
            "书法": 5,
            "木匠": 5,
            "厨艺": 5,
            "舞蹈": 5,
            "歌剧": 5,
            "声乐": 5,
            "摄影": 5,
            "雕塑": 5,
            "伪造": 5,
            "陶艺": 5,
            "人类学": 1,
            "估价": 5,
            "考古学": 1,
            "魅惑": 15,
            "攀爬": 20,
            "计算机": 5,
            "计算机使用": 5,
            "电脑": 5,
            "乔装": 5,
            "闪避": "DEX/2",
            "汽车驾驶": 20,
            "电气维修": 10,
            "电子学": 1,
            "话术": 5,
            "斗殴": 25,
            "链锯": 10,
            "斧头": 25,
            "连枷": 10,
            "矛": 20,
            "剑": 20,
            "鞭子": 5,
            "弓": 15,
            "手枪": 20,
            "重武器": 10,
            "火焰喷射器": 10,
            "机枪": 10,
            "步枪": 25,
            "霰弹枪": 25,
            "步枪/霰弹枪": 25,
            "冲锋枪": 15,
            "急救": 30,
            "历史": 5,
            "恐吓": 15,
            "跳跃": 20,
            "拉丁语": 1,
            "汉语": 1,
            "日语": 1,
            "英语": 1,
            "德语": 1,
            "法语": 1,
            "西班牙语": 1,
            "意大利语": 1,
            "丹麦语": 1,
            "土著语": 1,
            "格陵兰语": 1,
            "俄语": 1,
            "母语": "EDU",
            "法律": 5,
            "图书馆": 20,
            "聆听": 20,
            "锁匠": 1,
            "机械维修": 10,
            "医学": 1,
            "博物学": 10,
            "天文学": 1,
            "生物学": 1,
            "植物学": 1,
            "化学": 1,
            "数学": 1,
            "密码学": 1,
            "工程学": 1,
            "法学": 1,
            "司法科学": 1,
            "地质学": 1,
            "气象学": 1,
            "药学": 1,
            "物理学": 1,
            "动物学": 1,
            "领航": 10,
            "神秘学": 5,
            "重型机械": 1,
            "说服": 10,
            "精神分析": 1,
            "驾驶": 1,
            "飞行器驾驶": 1,
            "船驾驶": 1,
            "心理学": 10,
            "骑术": 5,
            "科学": 1,
            "妙手": 10,
            "侦查": 25,
            "潜行": 20,
            "生存": 10,
            "游泳": 20,
            "投掷": 20,
            "追踪": 10,
            "驯兽": 5,
            "潜水": 1,
            "爆破": 1,
            "读唇": 1,
            "催眠": 1,
            "炮术": 1,
            "DB": 1,
            "#斗殴": "1D3+DB",
            "#链锯": "2D8穿",
            "#斧头": "1D8+2+DB穿",
            "#连枷": "1D8+DB",
            "#矛": "1D8+1穿",
            "#剑": "1D6+DB穿",
            "#鞭子": "1D3+DB/2",
            "#弓": "1D6+DB/2",
            "#手枪": "1D8穿",
            "#重武器": "5D10穿",
            "#火焰喷射器": "2D6+烧穿",
            "#机枪": "2D6+4穿",
            "#步枪": "1D6+1穿",
            "#霰弹枪": "4D6/2D6/1D6",
            "#冲锋枪": "1D10穿",
            "#步枪/霰弹枪": "1D6+1穿"
        }
            , "DiceBot": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿"}
            , "PL 1": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿"
            }}
    except json.JSONDecodeError as e:
        print(f"Error in JSON decoding: {e}")
        print(f"Problematic data: {file.read()}")


def load_Chart_at_name():
    try:
        # 按姓名牌加载自定义角色数值信息
        with open('GameSaves/pl_Chart_at_name.json', 'r', encoding='utf-8') as file:
            # print(f"Problematic data: {file.read()}")
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {"KP": {
            "EDU": 0,
            "APP": 0,
            "DEX": 0,
            "STR": 0,
            "INT": 0,
            "CON": 0,
            "POW": 0,
            "SIZ": 0,
            "LUCK": 0,
            "教育": "EDU",
            "外貌": "APP",
            "敏捷": "DEX",
            "力量": "STR",
            "智力": "INT",
            "体质": "CON",
            "灵感": "INT",
            "意志": "POW",
            "体型": "SIZ",
            "幸运": "LUCK",
            "MOV": 8,
            "HP": "(CON+SIZ)/10",
            "MP": "POW/5",
            "SAN": "POW",
            "克苏鲁神话": 0,
            "克苏鲁": 0,
            "cm": 0,
            "信用": 0,
            "信用评级": 0,
            "会计": 5,
            "表演": 5,
            "美术": 5,
            "写作": 5,
            "书法": 5,
            "木匠": 5,
            "厨艺": 5,
            "舞蹈": 5,
            "歌剧": 5,
            "声乐": 5,
            "摄影": 5,
            "雕塑": 5,
            "伪造": 5,
            "陶艺": 5,
            "人类学": 1,
            "估价": 5,
            "考古学": 1,
            "魅惑": 15,
            "攀爬": 20,
            "计算机": 5,
            "计算机使用": 5,
            "电脑": 5,
            "乔装": 5,
            "闪避": "DEX/2",
            "汽车驾驶": 20,
            "电气维修": 10,
            "电子学": 1,
            "话术": 5,
            "斗殴": 25,
            "链锯": 10,
            "斧头": 25,
            "连枷": 10,
            "矛": 20,
            "剑": 20,
            "鞭子": 5,
            "弓": 15,
            "手枪": 20,
            "重武器": 10,
            "火焰喷射器": 10,
            "机枪": 10,
            "步枪": 25,
            "霰弹枪": 25,
            "步枪/霰弹枪": 25,
            "冲锋枪": 15,
            "急救": 30,
            "历史": 5,
            "恐吓": 15,
            "跳跃": 20,
            "拉丁语": 1,
            "汉语": 1,
            "日语": 1,
            "英语": 1,
            "德语": 1,
            "法语": 1,
            "西班牙语": 1,
            "意大利语": 1,
            "丹麦语": 1,
            "土著语": 1,
            "格陵兰语": 1,
            "俄语": 1,
            "母语": "EDU",
            "法律": 5,
            "图书馆": 20,
            "聆听": 20,
            "锁匠": 1,
            "机械维修": 10,
            "医学": 1,
            "博物学": 10,
            "天文学": 1,
            "生物学": 1,
            "植物学": 1,
            "化学": 1,
            "数学": 1,
            "密码学": 1,
            "工程学": 1,
            "法学": 1,
            "司法科学": 1,
            "地质学": 1,
            "气象学": 1,
            "药学": 1,
            "物理学": 1,
            "动物学": 1,
            "领航": 10,
            "神秘学": 5,
            "重型机械": 1,
            "说服": 10,
            "精神分析": 1,
            "驾驶": 1,
            "飞行器驾驶": 1,
            "船驾驶": 1,
            "心理学": 10,
            "骑术": 5,
            "科学": 1,
            "妙手": 10,
            "侦查": 25,
            "潜行": 20,
            "生存": 10,
            "游泳": 20,
            "投掷": 20,
            "追踪": 10,
            "驯兽": 5,
            "潜水": 1,
            "爆破": 1,
            "读唇": 1,
            "催眠": 1,
            "炮术": 1,
            "DB": 1,
            "#斗殴": "1D3+DB",
            "#链锯": "2D8穿",
            "#斧头": "1D8+2+DB穿",
            "#连枷": "1D8+DB",
            "#矛": "1D8+1穿",
            "#剑": "1D6+DB穿",
            "#鞭子": "1D3+DB/2",
            "#弓": "1D6+DB/2",
            "#手枪": "1D8穿",
            "#重武器": "5D10穿",
            "#火焰喷射器": "2D6+烧穿",
            "#机枪": "2D6+4穿",
            "#步枪": "1D6+1穿",
            "#霰弹枪": "4D6/2D6/1D6",
            "#冲锋枪": "1D10穿",
            "#步枪/霰弹枪": "1D6+1穿",
            "_AvatarPath": ""
        }
            , "DiceBot": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿",
                "_AvatarPath": ""
            }
        }
    except json.JSONDecodeError as e:
        print(f"Error in JSON decoding: {e}")
        print(f"Problematic data: {file.read()}")


role_Chart = load_Chart().copy()
role_Chart_at_name = load_Chart_at_name().copy()
bot_personality_by_name = load_DiceBot_personality()
adv_comment = ""
Cards_list_by_role = {}


# logging.debug("Variable value: %s", role_Chart_at_name)


class ChatApp:
    def __init__(self, root):
        self.root = root
        self.autoSave_firstTime()
        # 一系列字符串
        string_list_encouragement = [" - Made by 咩碳@mebily & ChatGPT", " - 人品100！这就是全部的陛下庇护！", " - 陛下所言甚是/陶醉", " - "
                                                                                                               "你生而有翼，为何竟愿一生匍匐前进，形如虫蚁？",
                                     " - 好的国王千篇一律 坏的国王万里挑一", " - 变成卢学家后能看自己的头衔互相贴贴吗", " - 导演因染新冠七天没到片场发现剧组被新来的演员带去溜冰",
                                     " - 你的Bug我的Bug好像都一样", " - 新约是不是就像陛下一样可爱", " - 傻卢，罚你一天不见陛下",
                                     " - 送你默默饮泪的泪城纪念雨景球", " - 送你向着它告白就能获得陛下碎片的勇气流星", " - 陛下正在搭建他的绝对帝国", " - 一半的陛下庇护",
                                     " - 陛下那么肥干什么，没有陛下的气质",
                                     " - 陛下很便宜的", " - 情人眼里出陛下", " - 陛下很好养活的", " - 有王吗？", " - 只能说没有陛下漂亮",
                                     ' - "你们都没有我懂陛下！"', " - 就像陛下",
                                     ' - "我是真的对陛下没感觉"',
                                     " - 曾经有一只超可爱的陛下在我面前，我却没有珍惜", " - 感觉陛下有危险！", " - 这个陛下救不了我", " - 成为陛下",
                                     ' - "有毛的都被我干掉了"', " - 陛下，本命链顶端的男人", " - 王学家和卢卢跳舞被陛下追着打",
                                     " - 陛下笑着吃了这个蛋糕，他久违的微笑也让我开心了起来", " - 下午好，今天的小骑士是要油炸呢还是要清蒸呢",
                                     " - 我需要陛下来平息我胸中怒火/翻进白宫", " - 噢可爱的生灵，请告诉我陛下为什么这么美好", " - 咩碳睡了！咩碳希望能梦到陛下！/大声",
                                     " - 有时候，只需一个代名词就能拯救别人一天的好心情。—— 王学家咩碳",
                                     " - 沃姆是不能飞的，所以你一说飞天沃姆，我想到的是被打飞的沃姆你知道吗", " - INTJ可不会被绊倒 —— 会被ENTJ绊倒",
                                     " - 我不懂，我没有背叛过陛下", " - 陛下束紧了我的缰绳，让我无法发疯", " - 陛下，您离遍布生物圈又近了一步",
                                     " - 突然感受到了人类的可爱，我祝福人类（拿着橄榄枝洒圣水）", " - 我去带陛下做核酸", " - 白宫：警惕蛾族打旧日之光牌",
                                     " - 给我一个世设，我能适配整只陛下", " - 死了也是死在陛下怀里", " - 陛下一笑倾城，圣巢虫子都跳虚空自杀以保陛下周全",
                                     " - 太久不上供 就会被踢出白宫", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", ""]
        # 从列表中随机选择一个字符串
        encouragement = random.choice(string_list_encouragement)
        self.root.title("自嗨团 v1.89" + encouragement)

        # 设置图标
        self.root.iconbitmap("AppSettings/icon.ico")

        # 其他窗口内容
        # self.label = tk.Label(root, text="Hello, Tkinter!")

        # 绑定回车键和Alt+回车键
        root.bind("<Return>", lambda event: self.send_message(self.current_role.get()))
        root.bind("<Alt-Return>", lambda event: self.insert_newline())
        root.bind("<Control-Return>", lambda event: self.newline_on_ctrl_enter(event))

        # self.chat_log_huozi = ""
        self.new_combat_windows = {}
        self.luck_by_name = load_luck_by_name()
        self.babel_data = {}
        self.Iconcanvas = {}
        self.Icon_on_avatar = {}
        self.canvas_icon_animate = {}
        self.image_references_on_Avatar = {}
        self.frames_avatar = {}
        self.current_frame_avatar = {}
        self.frames_icon = {}
        self.current_frame_icon = {}
        self.frames_map = {}
        self.current_frame_map = {}
        self.frames_icon_on_canvas = {}
        self.current_frame_icon_on_canvas = {}
        self.role_entries_name_NPC = {}
        self.role_statusbar_health = {}
        self.role_statusbar_icon = {}
        self.role_sstatusbar_mp = {}
        self.image_references_PC = []
        self.image_references_new_map = []
        self.infoCanvas_data = load_infoCanvas_data()
        self.infoCanvas_data_by_name = load_infoCanvas_data_by_name()

        self.health_data = load_health_data()
        self.health_data_by_name = load_health_data_by_name()

        self.role_Icon_paths = load_icon_data()

        self.role_skill_menu = load_role_skill_menu()
        self.role_items = load_items()

        self.status_icon = load_settings_status_icon()

        self.NowBGM = ["全部"]
        self.NowImage = []
        self.NowEffect = []
        self.NowDialogState = True
        self.NowCharacterEffect = []

        self.role_dir_path = load_dir_path()
        for role in self.role_dir_path:
            if "Images/AvatarImages" not in self.role_dir_path[role]:
                self.role_dir_path[role] = "Images/AvatarImages"

        # 初始化角色列表
        self.role_count = load_role_count()
        self.roles = ["KP", "DiceBot", "PL 1"]
        self.enemy_matches = {}
        self.codename_by_name = load_settings_codename()
        if "_status" not in self.codename_by_name:
            self.codename_by_name["_status"] = True

        # 初始化当前聚焦的头像和文本框
        self.current_role = tk.StringVar(value=self.roles[0])
        self.highlighted_role = self.current_role

        # 初始化TRPG模块
        self.trpg_module = TRPGModule(self, root)
        # self.COC_module = COCModule()
        # 添加按钮，用于展开或缩进掷骰按钮和信息面板
        toggle_button = tk.Button(self.root, text="展开/缩进\nTRPG模块", command=self.toggle_trpg)
        toggle_button.grid(row=2, column=1, padx=10, pady=10, sticky="nsew")
        self.trpg_toggle = "off"

        global date
        global time
        global place
        global weather
        global bot_personality
        global bot_personality_by_name
        global mav_prob
        # 初始化时间、地点记录栏
        self.env = load_env()
        date = self.env["Date"]
        time = self.env["Time"]
        place = self.env["Place"]
        weather = self.env["Weather"]
        self.time_log = tk.Text(root, wrap=tk.WORD, width=10, height=0, undo=True)
        self.time_log.grid(row=3, column=2, padx=10, pady=10, rowspan=3, sticky="nsew")
        self.time_log.insert(tk.END, "【时间】" + time.upper() + "【地点】" + place + "【天气】" + weather + "【日期】" + date)
        self.time_log.bind("<Button-3>", lambda event, r="timelog": self.add_menu(event, r))
        self.time_log.bind("<Button-1>", lambda event: self.refreshTime(event))
        self.time_log.bind("<FocusIn>", lambda event: self.env_focus(event))

        # 初始化聊天LOG
        self.chat_log = scrolledtext.ScrolledText(root, wrap=tk.WORD, width=50, height=20, undo=True)
        self.chat_log.grid(row=0, column=0, padx=10, pady=10, rowspan=3, sticky="nsew")
        self.chat_log.bind("<Button-3>", lambda event, r="chatlog": self.add_menu(event, r))
        # 在 Text 组件中插入初始文本
        initial_text = "Updates/Todo：详情见readme" \
                       "\nTips:\n.st HP、MP时均修改的是上限，修改实时hp/mp需使用掷骰栏掷骰，或者直接修改\n使用 .st#斗殴@1D3+5 " \
                       "来载入武器伤害公式\n小地图可用于追逐、探索和战斗，更好的战斗体验可以结合CCF。小地图中的M是MOV，不是MP\nNPC活动也可以用程序多开+复制粘贴，但如此就无法无缝RP" \
                       "（而且战斗时无法触发PC的Armor显示、无法同步计算时间等），建议KP栏装载至少一个常用NPC，或者保证留有NPC栏位。\n一些复杂操作：\n[右键姓名牌] 选择简卡图片\n[" \
                       "左键头像栏] 选择头像\n[左键Icon栏] 选择状态Icon\n[右键头像栏/Icon栏] " \
                       "状态Icon叠加/撤销\n[左键@] 在Focus文本框插入@角色名\n[右键@] 插入活字命令\n如果没有头像和状态Icon，就会缩进到Frame内的左侧，左上是状态，左中是头像\n[Enter世界状态栏]发送游戏世界状态至Log\n右键各文本框有惊喜\n" \
                       "===以上可删除===\n\n"
        self.chat_log.insert(tk.END, initial_text)

        # 创建按钮，点击按钮时调用 open_new_window 函数
        self.new_window_button = tk.Button(root, text="推理信息", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

        # 创建按钮，点击按钮时调用 add_NPC 函数
        load_NPC_button = tk.Button(root, text="装载NPC至栏位", command=self.Combat_NPC)
        load_NPC_button.grid(row=3, column=3, padx=10, pady=10, sticky="nsew")

        # 初始化输出聊天LOG按钮
        output_button = tk.Button(root, text="输出聊天LOG", command=self.output_chat_log)
        output_button.grid(row=3, column=0, padx=10, pady=10, sticky="nsew")

        # 初始化输出HTML按钮
        # output_html_button = tk.Button(root, text="输出HTML(施工中)", command=self.output_html_log)
        # output_html_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

        # 初始化角色对应的文字输入框、发送按钮和角色名编辑
        self.role_entries_frame = {}
        self.role_entries = {}
        self.role_entries_name = {}
        self.role_entries_roll = {}
        self.role_roll_button = {}
        self.role_values_tags = {}  # 新增保存数值的tag
        self.role_values_entry = {}
        self.role_values_tags_text = {}  # 新增保存的数值

        for role in self.roles:
            self.role_entries_name[role] = role
            self.image_references_on_Avatar[role] = []
            self.canvas_icon_animate[role] = tk.Canvas(self.root, width=20, height=20)
            self.frames_avatar[role] = []
            self.current_frame_avatar[role] = []
            self.frames_icon[role] = []
            self.current_frame_icon[role] = []
            self.frames_map[role] = []
            self.current_frame_map[role] = []
            self.frames_icon_on_canvas[role] = []
            self.current_frame_icon_on_canvas[role] = []
            if load_settings_name() != "":
                self.role_entries_name = load_settings_name()  # 从文件加载设置
            for r_, rolename_ in self.role_entries_name.items():
                if rolename_ not in self.role_items:
                    self.role_items[rolename_] = {"物品": [], "备注": [], "其他": []}
                if rolename_ not in self.luck_by_name:
                    self.luck_by_name[rolename_] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                    "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                    "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                    "_critical_rate": 0, "_d100_value": [],
                                                    "_luck_exp_value": []}
                if rolename_ not in self.role_skill_menu:
                    self.role_skill_menu[rolename_] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                       '法术名[效果公式](消费)：描述': "spell",
                                                       '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            for r_, rolename_ in load_Chart_at_name().copy().items():
                if r_ not in self.role_items:
                    self.role_items[r_] = {"物品": [], "备注": [], "其他": []}
                if r_ not in self.luck_by_name:
                    self.luck_by_name[r_] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                             "_luck_exp": 0, "_success": 0, "_fail": 0,
                                             "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                             "_critical_rate": 0, "_d100_value": [],
                                             "_luck_exp_value": []}
                if r_ not in self.role_skill_menu:
                    self.role_skill_menu[r_] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                '法术名[效果公式](消费)：描述': "spell",
                                                '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if role in self.role_entries_name:
                if self.role_entries_name[role] not in self.role_skill_menu:
                    self.role_skill_menu[self.role_entries_name[role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
                if self.role_entries_name[role] not in self.role_items:
                    self.role_items[self.role_entries_name[role]] = {"物品": [], "备注": [], "其他": []}
                if role not in self.codename_by_name:
                    if role in self.role_entries_name:
                        self.codename_by_name[role] = self.role_entries_name[role]
                    else:
                        self.codename_by_name[role] = role
            if role in self.role_entries_name:
                if self.role_entries_name[role] not in self.luck_by_name:
                    self.luck_by_name[self.role_entries_name[role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
            else:
                if role not in self.luck_by_name:
                    self.luck_by_name[role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        babel(self)

        self.create_role_frames()
        for i in range(self.role_count):
            self.add_role_init()

        # 为每个文本框绑定焦点变化事件
        self.chat_log.bind("<FocusIn>", lambda event3: self.reset_focus(event3))
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

        # 初始化删除角色按钮
        delete_role_button = tk.Button(root, text="删除角色", command=self.delete_role)
        delete_role_button.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        # 初始化添加角色按钮
        add_role_button = tk.Button(root, text="添加角色", command=self.add_role)
        add_role_button.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        for names in bot_personality_by_name:
            if names == self.role_entries_name["DiceBot"]:
                bot_personality = bot_personality_by_name[names]
                self.trpg_module.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                self.trpg_module.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                self.trpg_module.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                self.trpg_module.Success = random.choice(bot_personality["Success"]["通用"])
                self.trpg_module.Failure = random.choice(bot_personality["Failure"]["通用"])
                self.trpg_module.Fumble = random.choice(bot_personality["Fumble"]["通用"])
                self.trpg_module.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
                self.trpg_module.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]
                mav_prob = bot_personality["妙语"]["_mav_prob"]  # 妙语概率
                print("妙语概率：" + str(mav_prob))
                self.role_entries["DiceBot"].insert("1.0", f"已录入[{names}]的性格！")
                break
            else:
                break

    def display_image(self, file_path, text, name=None, seconds=-1):
        if file_path:
            new_window_HO = tk.Toplevel(root)
            new_window_HO.title("图片展示：" + text)
            # label = tk.Label(new_window_HO, text=text)
            # label.pack()
            image_references = []  # Add this list attribute to store references to images
            # 创建 Canvas 组件
            image = Image.open(file_path)
            # 获取图像的宽和高
            width, height = image.size
            canvas_w = int(width / 3)
            canvas_h = int(height / 3)
            canvas_HO = tk.Canvas(new_window_HO, width=canvas_w, height=canvas_h, bg="white")
            canvas_HO.pack(fill=tk.BOTH, expand=True)
            image = image.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
            tk_image = ImageTk.PhotoImage(image)
            canvas_HO.create_image(canvas_w / 2, canvas_h / 2, image=tk_image, tags="image")
            canvas_HO.image = tk_image
            # 监听窗口大小变化事件
            # canvas_HO.bind("<Configure>", lambda event: self.resize_image(canvas_HO, tk_image))
            new_window_HO.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_image(new_window_HO, text, name))

    def display_FX(self, file_path, text):
        if file_path:
            new_window_FX = tk.Toplevel(root)
            new_window_FX.title("FX展示：" + text)
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                self.canvas_animate_FX = tk.Canvas(new_window_FX, width=width, height=height)
                self.canvas_animate_FX.pack(fill=tk.BOTH, expand=True)
                self.frames_FX = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                  ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_FX = self.canvas_animate_FX.create_image(0, 0, anchor=tk.NW, image=self.frames_FX[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_FX, self.current_frame_FX, self.frames_FX)
            else:
                # 创建 Canvas 组件
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                canvas_w = int(width / 3)
                canvas_h = int(height / 3)
                canvas_FX = tk.Canvas(new_window_FX, width=canvas_w, height=canvas_h, bg="white")
                canvas_FX.pack(fill=tk.BOTH, expand=True)
                image = image.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
                tk_image = ImageTk.PhotoImage(image)
                canvas_FX.create_image(canvas_w / 2, canvas_h / 2, image=tk_image, tags="image")
                canvas_FX.image = tk_image
            new_window_FX.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_image(new_window_FX, "FX", text))

    def resize_image(self, canvas, tk_image):
        canvas.delete("image")  # 删除之前的图片
        width = canvas.winfo_width()  # 获取Canvas的新宽度
        height = canvas.winfo_height()  # 获取Canvas的新高度
        resized_image = tk_image.subsample(int(tk_image.width() / width), int(tk_image.height() / height))  # 缩放图片
        canvas.create_image(0, 0, anchor=tk.NW, image=resized_image, tags="image")  # 在Canvas上绘制调整后的图片
        canvas.image = resized_image  # 更新图片引用

    def on_kill_image(self, window, type, name):
        if type == "FX":
            if name in self.NowEffect:
                self.NowEffect.remove(name)
                content = f"【高级特效】结束{name}"
                # 搜索包含 ">>>" 的行的起始索引
                start_index = "1.0"
                while True:
                    match_index = self.chat_log.search(">>>", start_index, tk.END)
                    if not match_index:
                        break
                    # 删除包含 ">>>" 的行
                    line_start = self.chat_log.index(match_index)
                    line_end = self.chat_log.index(match_index + " lineend")
                    self.chat_log.delete(line_start, line_end)
                    # 更新搜索的起始位置
                    start_index = line_end

                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【等待】0.2\n\n')
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
                # self.chat_log_huozi = self.chat_log_huozi + f"{content}\n\n"
                self.chat_log.yview(tk.END)
        elif type == "HandOut":
            if name in self.NowImage:
                self.NowImage.remove(name)
                content = f"【撤除图片】{name}"

                # 搜索包含 ">>>" 的行的起始索引
                start_index = "1.0"
                while True:
                    match_index = self.chat_log.search(">>>", start_index, tk.END)
                    if not match_index:
                        break
                    # 删除包含 ">>>" 的行
                    line_start = self.chat_log.index(match_index)
                    line_end = self.chat_log.index(match_index + " lineend")
                    self.chat_log.delete(line_start, line_end)
                    # 更新搜索的起始位置
                    start_index = line_end

                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【等待】1\n\n')
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
                # self.chat_log_huozi = self.chat_log_huozi + f"{content}\n\n"
                self.chat_log.yview(tk.END)
        window.destroy()

    def kill_image(self, name):
        pass
        # audio_list[name].stop()
        # audio_list.pop(name)

    def refreshTime(self, event):
        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>{log}\n"
        # 滚动到最底部
        self.save_settings()

    def create_role_frames(self):
        num_cols = 3
        for idx, role in enumerate(self.roles):
            row = idx % num_cols
            col = idx // num_cols
            self.create_role_frame(role, row, col)

        # 自动调整列宽
        for i in range(num_cols + 2):
            self.root.columnconfigure(i, weight=1)

    def create_role_frame(self, role, row, col):

        if role not in role_Chart:
            role_Chart[role] = role_Chart_detail_demo.copy()

        frame = tk.LabelFrame(self.root, text=role, relief=tk.GROOVE)
        frame.grid(row=row, column=col + 2, padx=10, pady=10, sticky="nsew")
        self.role_entries_frame[role] = frame
        # 初始化头像路径
        self.role_avatar_paths = {}
        if load_settings_avatar() != "":
            self.role_avatar_paths = load_settings_avatar()  # 从文件加载设置
        # 头像点击事件
        # self.avatar_click_event = None

        # 每个角色的消息框
        entry = tk.Text(frame, wrap=tk.WORD, width=30, height=3, undo=True)
        entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")
        entry.bind("<Button-3>", lambda event, r=role: self.add_menu(event, r))
        self.role_entries[role] = entry
        # 加载并显示头像
        self.load_and_display_avatar(role, frame)
        self.load_and_display_icon(role, frame)

        if role == "DiceBot":
            # 在 Text 组件中插入初始文本
            initial_text = "复制Bot消息至此并发送，或：\n【掷骰】点击每个角色的掷骰按钮进行掷骰，公式栏填写公式或技能，留空默认1d100" \
                           "\n【优劣势】命令头部的+/-表示优劣势（++意志30）" \
                           "\n【补正骰】命令后部的+/-表示补正（意志+30）" \
                           "\n【联合骰】技能1+技能2+技能3..." \
                           "\n【对抗骰】在角色消息栏@其他对抗人 并点击掷骰" \
                           "\n【全体掷骰】保持焦点在Bot消息框，点击Bot的掷骰按钮" \
                           "\n【多轮掷骰】命令头部的*表示轮数（3*意志）" \
                           "\n【暗骰】保持焦点在暗骰角色的消息框，点击Bot的掷骰按钮（公式取自暗骰角色，是否显示技能名取决于Bot公式栏）" \
                           "\n【掷骰原因】消息栏填写掷骰原因，可以包括技能文字点掷骰按钮来触发检定（例如“我使用r斗殴击晕敌人”）" \
                           "\n【HP/MP+-】在公式栏填写（例如“HP+1d3”）" \
                           "\n【.st draw who[+理由] whoabcd[+理由] yesno[+理由]】输入后点击发送按钮或回车（而不是掷骰按钮）" \
                           "\n===以上可删除===\n\n"
            self.role_entries[role].insert(tk.END, initial_text)
        if role == "KP":
            initial_text = "如何创建NPC模板：" \
                           "\n0.如果巴别塔报错，先关闭巴别塔（把文件名改一下就行）" \
                           "\n1.创建新角色，更名为模板名（比如“基本怪物”、“基本人类”、“基本邪教徒”、“Muffin Stinger”（姓名也可以在创建 / 导入模板后再改））" \
                           "\n2. 。st录入数值" \
                           "\n3.重启程序（关闭程序时会自动保存）" \
                           "\n4.在KP栏把自己的名字改成模板名，会自动录入数值(即时数值例如HP、MP变化不会录入)。如果不想更改KP，新建一个NPC栏来用也行，最好不用骰子栏，会出奇怪BUG" \
                           "。或者多开程序也行，但注意一定要分开保存程序数据文件，被覆盖就会哭哭。" \
                           "\n5.如果要重新启用巴别塔，删除新创建的角色，改回第0步的文件名（除非把新添加的角色也加入巴别塔）" \
                           "\n===以上可删除===\n\n"
            self.role_entries[role].insert(tk.END, initial_text)

            # 创建数值tag，显示数值
        role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
        SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        POW = role_Chart_detail.get("POW")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        DB = role_Chart_detail.get("DB")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        if "#SAN" in role_Chart_detail:
            _SAN = role_Chart_detail.get("#SAN")
        else:
            _SAN = 100
        entry2 = tk.Text(frame, wrap=tk.WORD, width=10, height=6, undo=True)
        entry2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
        entry2.bind("<Button-3>", lambda event, r="statuslog" + role: self.add_menu(event, r))
        # entry2.bind("<Button-1>", lambda event, r="statuslog" + role: self.add_menu(event, r))
        value_tag = f"{role}_values_tag"
        self.role_values_tags[role] = value_tag
        entry2.tag_config(value_tag, justify=tk.LEFT)
        self.role_values_tags_text = load_PL_INFO()
        if role not in self.role_values_tags_text:
            entry2.insert(tk.END, f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB',
                          value_tag)
        else:
            entry2.insert(tk.END, self.role_values_tags_text[role], value_tag)
        if f"===状态===" not in entry2.get("1.0", tk.END).strip():
            entry2.insert(tk.END, f"\n===状态===\n无(永久)\n")
        if role in self.role_entries_name:
            if self.role_entries_name[role] in self.role_items:
                for key, value in self.role_items[self.role_entries_name[role]].items():
                    if value != "":
                        for value_ in value:
                            if value_ != "":
                                if f"==={key}===" not in entry2.get("1.0", tk.END).strip():
                                    entry2.insert(tk.END, f"\n==={key}===\n" + "\n".join(value),
                                                  value_tag)
            else:
                self.role_items[self.role_entries_name[role]] = {"物品": [], "备注": [], "其他": []}
        # 为每个文本框绑定焦点变化事件
        entry2.bind("<FocusOut>", lambda event, r=role, t=entry2: self.save_info(event, r))
        entry2.bind("<FocusIn>", lambda event, r=role: self.update_health_bar(r))
        self.role_values_entry[role] = entry2
        if HP == "(CON+SIZ)/10":
            HP = "0"
        if MP == "POW/5":
            MP = "0"
        if SAN == "POW":
            SAN = "0"
        if self.role_values_entry[role].get("1.0", "2.0").split("/")[0] != "POW" and \
                self.role_values_entry[role].get("2.0", "3.0").split("/")[0] != "(CON+SIZ)/10" and \
                self.role_values_entry[role].get("3.0", "4.0").split("/")[0] != "POW/5":
            __SAN = int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0])
            _HP = int(self.role_values_entry[role].get("2.0", "3.0").split("/")[0])
            _MP = int(self.role_values_entry[role].get("3.0", "4.0").split("/")[0])
            # 状态条（血量）
            statusbar_health = tk.Label(frame, text=self.draw_health_bar(_HP, int(HP), bar_length=18), relief=tk.FLAT)
            statusbar_health.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
            statusbar_health.bind("<Button-1>", lambda event, r=role: self.hide_health_bar(r))
            statusbar_health.bind("<Enter>", lambda event, r=role: self.update_health_bar(r))
            self.role_statusbar_health[role] = statusbar_health
            # 状态条（状态图标）
            statusbar_icon = tk.Label(frame, image="", relief=tk.FLAT)
            statusbar_icon.grid(row=3, column=2, padx=0, pady=0, sticky="nsew")
            statusbar_icon.bind("<Button-1>", lambda event: self.update_status_icon(event))
            statusbar_icon.bind("<Enter>", lambda event, r=role: self.draw_status_icon_canvas(event, r))
            statusbar_icon.bind("<Leave>", lambda event, r=role: self.destroy_status_icon_canvas(r))
            self.role_statusbar_icon[role] = statusbar_icon
            # 状态条（mp量）
            statusbar_mp = tk.Label(frame, text="MP " + self.draw_health_bar(_MP, int(MP), bar_length=5,
                                                                             show_text=False) + "\nSAN " + self.draw_health_bar(
                __SAN, int(_SAN), bar_length=5, show_text=False),
                                    relief=tk.FLAT, font=("Times New Roman", 7))
            statusbar_mp.grid(row=3, column=0, padx=0, pady=0, sticky="nsew")
            statusbar_mp.bind("<Button-1>", lambda event, r=role: self.hide_health_bar(r))
            statusbar_mp.bind("<Enter>", lambda event, r=role: self.update_health_bar(r))
            self.role_sstatusbar_mp[role] = statusbar_mp

        send_button = tk.Button(frame, text="发送", command=lambda role=role: self.send_message(role))
        send_button.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        label = tk.Label(frame, text=role, relief=tk.FLAT,
                         font=("Times New Roman", 16, "bold"))  # flat, groove, raised, ridge, solid, or sunken
        label.grid(row=0, column=1, pady=0, sticky="nsew")
        label.bind("<Button-1>", lambda event, role=role, label=label: self.edit_role_name(event, role, label))
        label.bind("<Button-3>", lambda event, role=role: self.on_avatar_click(role))
        label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
        label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

        if self.role_entries_name[role] != role:
            label.configure(text=self.role_entries_name[role])
            # print(self.role_entries_name[role])

        label = tk.Label(frame, text="@", relief=tk.FLAT)
        label.grid(row=2, column=0, pady=0, sticky="nsew")
        # label点击事件绑定
        label.bind("<Button-1>", lambda event, role=role: self.on_at_click(role))
        label.bind("<Button-3>", lambda event, role=role: self.on_at_right_click(role))

        # 添加选择头像按钮
        # choose_avatar_button = tk.Button(frame, text="选择简卡", command=lambda role=role: self.on_avatar_click(role))
        # choose_avatar_button.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        # 添加保存名牌按钮
        # choose_avatar_button = tk.Button(frame, text="保存", command=lambda role=role: self.choose_avatar(role))
        # choose_avatar_button.grid(row=2, column=3, padx=5, pady=5, sticky="nsew")

        # 添加掷骰按钮和面数输入框
        entry_roll = tk.Text(frame, wrap=tk.WORD, width=3, height=1, undo=True)
        entry_roll.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")
        entry_roll.bind("<Button-3>", lambda event, r=role: self.add_menu_skills(event, role))
        self.role_entries_roll[role] = entry_roll
        roll_button = tk.Button(frame, text="掷骰", command=lambda r=role: self.get_and_roll(r))
        roll_button.grid(row=2, column=2, padx=5, pady=5)
        self.role_roll_button[role] = roll_button
        # 在 Text 组件中插入初始文本
        initial_text = "1d100"
        self.role_entries_roll[role].insert(tk.END, initial_text)

    def hide_health_bar(self, role):
        global is_hiding_health_bar
        if is_hiding_health_bar:
            self.role_statusbar_health[role].config(font=None)
            # self.role_statusbar_icon[role].config(font=None)
            self.role_sstatusbar_mp[role].config(font=None)
            is_hiding_health_bar = False
        else:
            # self.role_statusbar_health[role].config(font=("Times New Roman", 1))
            # self.role_statusbar_icon[role].config(font=("Times New Roman", 1))
            self.role_sstatusbar_mp[role].config(font=("Times New Roman", 1))
            is_hiding_health_bar = True

    def apng_to_gif(self, apng_file, gif_file):
        # 使用 apng2gif 工具将 APNG 转换成 GIF
        subprocess.run(["apng2gif", apng_file, gif_file])
        return gif_file

    def save_info(self, event, role):
        self.update_health_bar(role)
        self.role_values_tags_text[role] = self.role_values_entry[role].get("1.0", tk.END).strip()
        # print(self.role_values_entry[role].get("1.0", tk.END).strip())

    def show_menu(self, event, menu):
        menu.post(event.x_root, event.y_root)

    def insert_text_to_Bot(self, text, send=None):
        self.role_entries["DiceBot"].insert("1.0", text)
        if send:
            self.send_message("DiceBot")
            if self.role_entries["DiceBot"].get("1.0", tk.END).strip() == text:
                self.role_entries["DiceBot"].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries["DiceBot"].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries["DiceBot"].delete("1.0", tk.END)
                self.role_entries["DiceBot"].insert("1.0", temp_)
        else:
            pass

    def insert_text_to_PC(self, text, role, send=None):
        self.role_entries[role].insert("1.0", text)
        if send:
            self.send_message(role)
            if self.role_entries[role].get("1.0", tk.END).strip() == text:
                self.role_entries[role].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries[role].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", temp_)
        else:
            pass

    def insert_roll_to_PC(self, text, role, send=False):
        self.role_entries_roll[role].delete("1.0", tk.END)
        self.role_entries_roll[role].insert("1.0", text)
        if send and self.role_entries_roll[role].get("1.0", tk.END).strip() != "":
            if "NPC_name" not in role:
                self.role_entries[role].delete("1.0", tk.END)
            self.get_and_roll(role)
            if self.role_entries_roll[role].get("1.0", tk.END).strip() == text:
                self.role_entries_roll[role].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries_roll[role].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries_roll[role].delete("1.0", tk.END)
                self.role_entries_roll[role].insert("1.0", temp_)
        else:
            pass

    def clearAll(self, role):
        if role == "chatlog":
            self.chat_log.delete("1.0", tk.END)
        else:
            self.role_entries[role].delete("1.0", tk.END)

    def list_carddecks(self, event, role, command=None):
        menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的[{command}]牌堆列表")
        files = os.listdir("CardDecks")
        # 输出文件名
        if not command:
            command = ""
        if "*" in command:
            for file in files:
                if role == "Dicebot":
                    menu.add_command(label=os.path.splitext(file)[0], command=lambda
                        text=command.replace("*", "") + " " + os.path.splitext(file)[0] + "*": self.insert_text_to_Bot(
                        text))
                else:
                    menu.add_command(label=os.path.splitext(file)[0],
                                     command=lambda
                                         text=command.replace("*", "") + " " + os.path.splitext(file)[0] + "*",
                                         role=role: self.insert_text_to_PC(text, role))
        else:
            for file in files:
                if role == "Dicebot":
                    menu.add_command(label=os.path.splitext(file)[0], command=lambda
                        text=command + " " + os.path.splitext(file)[0]: self.insert_text_to_Bot(text, send=True))
                else:
                    menu.add_command(label=os.path.splitext(file)[0],
                                     command=lambda text=command + " " + os.path.splitext(file)[0],
                                                    role=role: self.insert_text_to_PC(text, role, send=True))
        self.show_menu(event, menu)

    def add_menu(self, event, role):
        menu = tk.Menu(root, tearoff=0)
        menu.delete(0, tk.END)  # 清空菜单
        if "statuslog" in role:
            role = role.replace("statuslog", "")
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                menu = tk.Menu(root, tearoff=1, title=f"NPC【{name_}】的物品列表")
                menu.delete(0, tk.END)  # 清空菜单
                textlist = self.role_values_entry[role].get("6.0", tk.END).split("\n")
                for t in textlist:
                    t = t.strip()
                    menu.add_command(label=t, command=lambda text=t, role=role: self.insert_text_to_PC(text, role))
            else:
                menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的物品列表)")
                menu.delete(0, tk.END)  # 清空菜单
                textlist = self.role_values_entry[role].get("6.0", tk.END).split("\n")
                for t in textlist:
                    t = t.strip()
                    menu.add_command(label=t, command=lambda text=t, role=role: self.insert_text_to_PC(text, role))
        elif role == "timelog":
            menu.add_command(label="快进1秒钟",
                             command=lambda timer="time_1s": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进3秒钟",
                             command=lambda timer="time_3s": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进1分钟",
                             command=lambda timer="time_1min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                            auto=False))
            menu.add_command(label="快进5分钟",
                             command=lambda timer="time_5min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                            auto=False))
            menu.add_command(label="快进10分钟",
                             command=lambda timer="time_10min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                             auto=False))
            menu.add_command(label="快进30分钟",
                             command=lambda timer="time_30min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                             auto=False))
            menu.add_command(label="快进1小时",
                             command=lambda timer="time_1h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进3小时",
                             command=lambda timer="time_3h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进12小时",
                             command=lambda timer="time_12h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                           auto=False))
            menu.add_command(label="快进1天",
                             command=lambda timer="time_1d": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进7天",
                             command=lambda timer="time_1w": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
        elif role == "DiceBot":
            menu.add_command(label="活字命令", command=lambda text="text": self.insert_text_to_Bot(text))
            menu.add_command(label="全体明抽公共牌堆",
                             command=lambda text=".alldraw", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体明抽公共牌堆(不放回)",
                             command=lambda text=".alldraw?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体明抽公共牌堆(多次)",
                             command=lambda text=".alldraw*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽公共牌堆",
                             command=lambda text=".alldraw_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽公共牌堆(不放回)",
                             command=lambda text=".alldraw_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽公共牌堆(多次)",
                             command=lambda text=".alldraw_*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="抽取幸运儿",
                             command=lambda text=".who", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="抽取幸运顺序",
                             command=lambda text=".whoabcd", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="全体今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="全体明抽个人牌堆",
                             command=lambda text=".alldrawself", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体明抽个人牌堆(不放回)",
                             command=lambda text=".alldrawself?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体明抽个人牌堆(多次)",
                             command=lambda text=".alldrawself*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽个人牌堆",
                             command=lambda text=".alldrawself_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽个人牌堆(不放回)",
                             command=lambda text=".allrawself_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体暗抽个人牌堆(多次)",
                             command=lambda text=".alldrawself_*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
        elif role == "chatlog":
            menu.add_command(label="快速保存", command=lambda: self.quickSave())
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
            menu.add_command(label="活字命令", command=lambda role=role: self.on_at_right_click(role))
            menu.add_command(label="抽取幸运儿",
                             command=lambda text=".who", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="抽取幸运顺序",
                             command=lambda text=".whoabcd", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="是与否",
                             command=lambda text=".yesno", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="全体今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_Bot(text, send=True))
        elif "NPC_name" in role:
            return
        else:
            menu.add_command(label="活字命令", command=lambda role=role: self.on_at_right_click(role))
            menu.add_command(label="明抽公共牌堆",
                             command=lambda text=".draw", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="明抽公共牌堆(多次)",
                             command=lambda text=".draw*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="明抽公共牌堆(不放回)",
                             command=lambda text=".draw?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="暗抽公共牌堆",
                             command=lambda text=".draw_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="暗抽公共牌堆(多次)",
                             command=lambda text=".draw_*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="暗抽公共牌堆(不放回)",
                             command=lambda text=".draw_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="抽取幸运儿", command=lambda text=".who", role=role: self.insert_text_to_PC(text, role))
            menu.add_command(label="抽取幸运顺序",
                             command=lambda text=".whoabcd", role=role: self.insert_text_to_PC(text, role))
            menu.add_command(label="是与否", command=lambda text=".yesno", role=role: self.insert_text_to_PC(text, role))
            menu.add_command(label="今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_PC(text, role, send=True))
            menu.add_command(label="明抽个人牌堆",
                             command=lambda text=".drawself", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="明抽个人牌堆(不放回)",
                             command=lambda text=".drawself?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="暗抽个人牌堆",
                             command=lambda text=".drawself_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="暗抽个人牌堆(不放回)",
                             command=lambda text=".drawself_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
        self.show_menu(event, menu)

    def add_menu_skills(self, event, role):
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            menu = tk.Menu(root, tearoff=1, title=f"NPC【{name_}】的技能列表")
        else:
            menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的技能列表")
        menu.delete(0, tk.END)  # 清空菜单
        # 创建一个值为列表的字典
        sorted_dict = defaultdict(list)
        # 遍历原始字典，将具有相同值的键添加到相应的列表中
        if "NPC_name" in role:
            name_ = role.split("NPC_name")[0]
            for key, value in self.role_skill_menu[name_].items():
                sorted_dict[value].append(key)
        else:
            for key, value in self.role_skill_menu[self.role_entries_name[role]].items():
                sorted_dict[value].append(key)
        # 根据字典的键的顺序构建一个新的字典
        result_dict = {}
        for value, keys in sorted(sorted_dict.items()):
            for key in keys:
                result_dict[key] = value
        if "NPC_name" in role:
            name_ = role.split("NPC_name")[0]
            self.role_skill_menu[name_] = result_dict.copy()

            for skill_, type_ in self.role_skill_menu[name_].items():
                menu.add_command(label=skill_,
                                 command=lambda skill=skill_, role=role,
                                                type=type_: self.parse_menu_skills(role, skill, type))
        else:
            self.role_skill_menu[self.role_entries_name[role]] = result_dict.copy()

            for skill_, type_ in self.role_skill_menu[self.role_entries_name[role]].items():
                menu.add_command(label=skill_,
                                 command=lambda skill=skill_, role=role,
                                                type=type_: self.parse_menu_skills(role, skill, type))
        # menu.bind("<Motion>", lambda event=event, menu=menu:self.on_hover_menu_skills(event, menu))
        menu.add_command(label="新的技能...", command=lambda event=event, role=role: self.update_roles_skills(event, role))
        self.show_menu(event, menu)

    def parse_menu_skills(self, role, skill, type):
        target = ""
        if "NPC_name" in role:
            target_list = []
            for _role in self.roles:
                if _role != "DiceBot":
                    target_list.append(self.role_entries_name[_role])
            for _role in self.role_entries_name_NPC:
                target_list.append(self.role_entries_name_NPC[_role])
            target_index = "PL " + str(random.randint(1, len(self.roles) - 2))
            target = simpledialog.askstring("选择目标PL", "选择行动目标PL(留空或0为自己，接受序号):",
                                            initialvalue=self.role_entries_name[target_index])
            if target.isdigit():
                target_index = "PL " + target
            else:
                if target == "":
                    target_index = "PL 0"
                    target = "自己"
                else:
                    # 先检索敌人，再检索队友
                    for _namein, _name in self.role_entries_name.items():
                        if target in _name:
                            target_index = _namein
                            break
                    if target_index == "":
                        for _namein, _name in self.role_entries_name_NPC.items():
                            if target in _name:
                                target_index = _namein
                                break

        else:
            target_list = []
            for _role in self.role_entries_name_NPC:
                target_list.append(self.role_entries_name_NPC[_role])
            for _role in self.roles:
                if _role != "DiceBot":
                    target_list.append(self.role_entries_name[_role])
            target_index = ""
            target = simpledialog.askstring("选择目标", "选择行动目标(留空或0为自己，接受序号):", initialvalue=self.role_entries_name[role])
            if target.isdigit():
                target_index = "PL " + target
                if target == "0":
                    target_index = role
                target = self.role_entries_name[target_index]
            else:
                if target == "":
                    target_index = role
                    target = self.role_entries_name[role]
                else:
                    # 先检索敌人，再检索队友
                    for _namein, _name in self.role_entries_name_NPC.items():
                        if target in _name:
                            target_index = _namein
                            break
                    if target_index == "":
                        for _namein, _name in self.role_entries_name.items():
                            if target in _name:
                                target_index = _namein
                                break
        print("攻击目标：" + f"[{target_index}]{target}")

        if type == "skill":  # 技能名[鉴定](要求)效果公式：描述 →要求r鉴定→鉴定技能   小刀穿刺[斗殴](小刀)1D3：针对一个敌人穿刺
            require = ""
            expression = ""
            des = skill.split("：")[1]
            skill = skill.split("：")[0]
            name = skill.split("[")[0]
            check = skill.split("[")[1].split("]")[0]
            if "(" in skill:
                require = skill.split("(")[1].split(")")[0]
                if len(skill.split("(")[1].split(")")) > 1:
                    expression = skill.split(")")[1].replace(")", "")
            weapon_list = {}
            if "NPC_name" in role:
                role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
            else:
                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
            for skill, value in role_Chart_detail.items():
                if "#" in skill:
                    weapon_list[skill.replace("#", "")] = value
            DB_ = role_Chart_detail["DB"]
            DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
            if ("D" not in DB_) and ("-" not in DB_):
                DB_ = "+" + DB_
            expression = expression.replace('+DB', DB_)
            if target != "" and target_index != "PL 0":
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                else:
                    name_ = self.role_entries_name[role]
                text = check
                self.insert_roll_to_PC(text, role, send=True)
                text = "对" + target + "以" + require + "使用" + name
                self.insert_text_to_PC(text, role)
                text = des
                self.insert_text_to_PC(text, role)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, target_index)
            else:
                text = "以" + require + "使用" + name + "，" + des
                self.insert_text_to_PC(text, role)
                text = check
                self.insert_roll_to_PC(text, role, send=True)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, role)

        elif type == "spell":  # 法术名[效果公式](消费)：描述  →计算消费  →作用 ：描述   →描述  御风术[HP-1D3](M1 S1D3+1)：扬起飞沙  恢复术[HP+1D3](M3)：绿色光晕，吟唱1回合，1天仅一次  魅惑术[心理学-20](M1+? S?) ←输入?：目标心理学-20%*M  高级魅惑术(M? S?)  ←输入?：目标心理学默然，持续M回合
            cost = ""
            expression = ""
            des = skill.split("：")[1]
            skill = skill.split("：")[0]
            name = skill.split("[")[0]
            expression = skill.split("[")[1].split("]")[0]
            mp_cost = 0
            hp_cost = 0
            san_cost = 0
            other_cost = {}
            if "(" in skill:
                cost = skill.split("(")[1].split(")")[0].replace("P", "").replace("AN", "")
            if " " in skill:
                cost = cost.split(" ")
                for c in cost:
                    if "M" in c:
                        mp_cost = int(self.cost_parse(c, "M"))
                    elif "S" in c:
                        san_cost = int(self.cost_parse(c, "S"))
                    elif "H" in c:
                        hp_cost = int(self.cost_parse(c, "H"))
            else:
                if "M" in cost:
                    mp_cost = int(self.cost_parse(cost, "M"))
                elif "S" in cost:
                    san_cost = int(self.cost_parse(cost, "S"))
                elif "H" in cost:
                    hp_cost = int(self.cost_parse(cost, "H"))
                else:
                    for char in cost:
                        if char.isalpha() and char != "D":
                            # other_cost[char] += 1
                            pass
            _SAN = int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip())
            _HP = int(self.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip())
            _MP = int(self.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip())
            _OtherDic = role_Chart.get(role, {}).copy()
            for key, value in other_cost.items():
                if key in _OtherDic:
                    if _OtherDic[key] >= value:
                        role_Chart[role][key] -= value
                        pass
                    else:
                        pass
            if mp_cost != 0 or hp_cost != 0 or san_cost != 0:
                if mp_cost != 0:
                    if mp_cost <= _MP:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"MP-{mp_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"MP-{mp_cost}", role, send=True)
                    else:
                        self.insert_text_to_PC("MP不足!", role)
                if hp_cost != 0:
                    if hp_cost <= _HP:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"HP-{hp_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"HP-{hp_cost}", role, send=True)
                        # self.role_entries[role].delete("1.0", tk.END)
                        # text = self.role_entries_name[role] + "使用了" + name + "，" + des
                        # self.insert_text_to_PC(text, role)
                        # text = expression
                        # self.insert_roll_to_PC(text, role)
                        # if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        # self.insert_roll_to_PC(expression, role)
                    else:
                        self.insert_text_to_PC("HP不足!", role)
                if san_cost != 0:
                    if san_cost <= _SAN:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"SAN-{san_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"SAN-{san_cost}", role, send=True)
                        # self.role_entries[role].delete("1.0", tk.END)
                        # text = self.role_entries_name[role] + "使用了" + name + "，" + des
                        # self.insert_text_to_PC(text, role)
                        # text = expression
                        # self.insert_roll_to_PC(text, role)
                        # if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        # self.insert_roll_to_PC(expression, role)
                    else:
                        self.insert_text_to_PC("SAN不足!", role)
                self.role_entries[role].delete("1.0", tk.END)
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    if target != "" and target_index != "PL 0":
                        pass
                        text = name_ + "对" + target + "使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, target_index)
                        if self.role_entries_roll[target_index].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, target_index)
                    else:
                        pass
                        text = name_ + "对自己使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, role)
                        if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, role)
                else:
                    pass
                    text = self.role_entries_name[role] + "使用了" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = expression
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)
            else:
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    if target != "" and target_index != "PL 0":
                        text = name_ + "对" + target + "使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, target_index)
                        if self.role_entries_roll[target_index].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, target_index)
                    else:
                        text = name_ + "对自己使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, role)
                        if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, role)
                else:
                    text = self.role_entries_name[role] + "使用了" + name + "，" + des
                    self.role_entries[role].delete("1.0", tk.END)
                    self.insert_text_to_PC(text, role)
                    text = expression
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)

        elif type == "maneuver":  # 战技/特技名:效果[鉴定](要求)公式  →鉴定  →要求 使 效果  义肢护甲:ARMOR+2(声明左臂格挡)：  擒抱:缴械2回合[斗殴](体格大于等于1)：
            require = ""
            expression = ""
            check = ""
            if "：" in skill:
                des = skill.split("：")[1]
            else:
                des = ""
            skill = skill.split("：")[0]
            name = skill.split(":")[0]
            skill = skill.split(":")[1]
            effect = skill
            if "[" in skill:
                effect = skill.split("[")[0]
                check = skill.split("[")[1].split("]")[0]
            if "(" in skill:
                require = skill.split("(")[1].split(")")[0]
                if len(skill.split("(")[1].split(")")) > 1:
                    expression = skill.split(")")[1].replace(")", "")
                if "[" not in skill:
                    effect = skill.split("(")[0]
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                else:
                    name_ = self.role_entries_name[role]
                if target != "" and target_index != "PL 0":
                    text = name_ + "对" + target + "以" + require + "声明" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = check
                    self.insert_roll_to_PC(text, role)
                    text = effect + f"({name_} → {target})"
                    self.insert_text_to_PC(text, target_index)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, target_index)
                else:
                    text = name_ + "对自己" + "以" + require + "声明" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = check
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)
            else:
                text = self.role_entries_name[role] + "以" + require + "声明" + name + "，" + des + "，" + effect
                self.insert_text_to_PC(text, role)
                text = check
                self.insert_roll_to_PC(text, role)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, role)
        else:  # other
            pass

    def cost_parse(self, cost, type):
        cost = cost.replace(type, "")
        if "D" in cost:
            result = 0
            matches = re.findall(r'\b\dD\d\b', cost)
            for m in matches:
                count = int(m.split("D")[0])
                dice = int(m.split("D")[1])
                result += count * random.randint(1, dice)
                cost = cost.replace(m, "")
            cost += "+" + str(result)
        if "?" in cost or "？" in cost:
            __c = ""
            for char in cost:
                if char == "？" or char == "?":
                    if type == "S":
                        _c = str(simpledialog.askinteger(f"SAN消费", f"输入消费的SAN:", initialvalue=1))
                    else:
                        _c = str(simpledialog.askinteger(f"{type}P消费", f"输入消费的{type}P:", initialvalue=1))
                    __c += "+" + _c
                else:
                    __c += char
            cost = __c
        cost = eval(cost)
        return cost

    def on_hover_menu_skills(self, event, menu):
        label = tk.Toplevel(root)
        hovered_item = menu.index(tk.CURRENT)
        label.config(text=f"Hovering over {menu.entrycget(hovered_item, 'label')}")
        label.geometry(f"+{event.x_root}+{event.y_root}")
        menu.bind("<Leave>", lambda label=label: self.hide_hover_menu_skills(label))

    def hide_hover_menu_skills(self, label):
        label.destory()

    def toggle_trpg(self):
        # 展开或缩进掷骰按钮和信息面板
        if self.trpg_toggle == "off":
            for role in self.roles:
                self.role_entries_roll[role].grid_forget()  # 缩进
                self.role_roll_button[role].grid_forget()
                self.role_values_entry[role].grid_forget()
            self.trpg_toggle = "on"
        else:
            for role in self.roles:
                self.role_entries_roll[role].grid(row=0, column=2, padx=5, pady=5, sticky="nsew")  # 展开
                self.role_roll_button[role].grid(row=2, column=2, padx=5, pady=5)
                self.role_values_entry[role].grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
            self.trpg_toggle = "off"

    def send_message(self, role):
        global role_Chart_at_name
        global _speechspeed
        global bot_personality

        if "NPC_name" in role:
            role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
        else:
            role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end

        message = self.role_entries[role].get("1.0", tk.END).strip()
        message = message.replace(self.trpg_module.Critical_Success, "")
        message = message.replace(self.trpg_module.Extreme_Success, "")
        message = message.replace(self.trpg_module.Success, "")
        message = message.replace(self.trpg_module.Hard_Success, "")
        message = message.replace(self.trpg_module.Failure, "")
        message = message.replace(self.trpg_module.Fumble, "")
        if message == "":
            return

        if role == "DiceBot":
            if ".draw" in message or "。draw" in message:
                num = 1
                if "*" in message:
                    num = int(message.split("*")[1])
                    message = message.split("*")[0]
                cardname = message.replace(".draw_", "").replace("。draw_", "").replace(".draw", "").replace("。draw", "")
                cardname = cardname.replace("?", "").replace("？", "").strip()
                Cards_now = load_CardDeck(cardname)
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", message)
                if Cards_now:
                    result_ = ""
                    while num > 0:
                        if "?" in message or "？" in message:
                            if cardname not in Cards_list:
                                Cards_list[cardname] = Cards_now
                            elif len(Cards_list[cardname]) == 0:
                                Cards_list[cardname] = Cards_now
                            if isinstance(Cards_now, list):
                                result = random.choice(Cards_list[cardname])
                                Cards_list[cardname].remove(result)
                                if num == 1:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'\n公有不放回牌堆[{cardname}]还余{len(Cards_list[cardname])}张卡。\n')
                            elif isinstance(Cards_now, dict):
                                result = random.choice(Cards_list[cardname][cardname])
                                if len(Cards_list[cardname][cardname]) != 1:
                                    Cards_list[cardname][cardname].remove(result)
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                while "{%" in result:
                                    result = result.replace("%}", "}")
                                    result = result.replace("}", "%}")
                                    matches = re.findall(r'\{%([^%]+)%\}', result)
                                    for m in matches:
                                        result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if num == 1:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'\n公有不放回牌堆[{cardname}]还余{len(Cards_list[cardname][cardname])}张卡。\n')
                                    if len(Cards_list[cardname][cardname]) == 0:
                                        self.role_entries[role].insert(tk.END,
                                                                       f'已自动补充牌堆。\n')
                                        Cards_list[cardname] = load_CardDeck(cardname)[cardname]
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if "{" in result or "%" in result:
                                    result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                            else:
                                print("my_var 不是列表也不是字典")
                                result = "ERR:请检查JSON牌堆格式！"
                            cardname = cardname + "(不放回)"
                        else:
                            if isinstance(Cards_now, list):
                                result = random.choice(Cards_now)
                            elif isinstance(Cards_now, dict):
                                result = random.choice(Cards_now[cardname])
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                while "{%" in result:
                                    result = result.replace("%}", "}")
                                    result = result.replace("}", "%}")
                                    matches = re.findall(r'\{%([^%]+)%\}', result)
                                    for m in matches:
                                        result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if "{" in result or "%" in result:
                                    result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                            else:
                                print("my_var 不是列表也不是字典")
                                result = "ERR:请检查JSON牌堆格式！"

                        if ".draw_" in message or "。draw_" in message:
                            if num == 1:
                                if result_ != "":
                                    result_ = result_ + f"[{num}]" + result
                                    result = result_
                                result = f"\n{result}".replace("\n\n", "\n")
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次公有牌堆[{cardname}]的暗抽。\n\n')
                                self.role_entries[role].insert(tk.END,
                                                               f'\n公有的牌堆[{cardname}]的抽取结果：{result}\n')
                                self.chat_log.yview(tk.END)
                            else:
                                result_ = result_ + f"[{num}]" + result + "\n"
                        else:
                            if num == 1:
                                if result_ != "":
                                    result_ = result_ + f"[{num}]" + result
                                    result = result_
                                result = f"\n{result}".replace("\n\n\n", "\n")
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                                self.chat_log.yview(tk.END)
                            else:
                                result_ = result_ + f"[{num}]" + result + "\n"
                        num -= 1
                else:
                    print("未找到牌堆或牌堆为空！")
                    os.startfile("CardDecks")
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif "。alldraw" in message or ".alldraw" in message or ".drawall" in message or "。drawall" in message:
                message = message.replace("all", "")
                for role in self.roles:
                    if role != "DiceBot":
                        self.drawcard(message, role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".jrrp" in message or "。jrrp" in message:
                message = ""
                for role in self.roles:
                    if role != "DiceBot":
                        self.jrrp(role)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            if ".whoabcd" in message.lower() or "。whoabcd" in message.lower() or "。who abcd" in message.lower() or ".whoabcd" in message.lower():
                rolelist = []
                result = ""
                if message.lower().replace(".who", "").replace("。who", "").replace("abcd", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").replace("abcd",
                                                                                                    "").strip() + "]"
                else:
                    reason = ""
                for role in self.roles:
                    if role != "DiceBot":
                        rolelist.append(role)
                random.shuffle(rolelist)
                for r in rolelist:
                    result = result + " > " + self.role_entries_name[r]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason}抽取幸运顺序：{result}\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".who" in message or "。who" in message:
                rolelist = []
                if message.lower().replace(".who", "").replace("。who", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").strip() + "]"
                else:
                    reason = ""
                for role in self.roles:
                    if role != "DiceBot" and role != "KP":
                        rolelist.append(role)
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason}抽取幸运儿：【{self.role_entries_name[random.choice(rolelist)]}】\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".no" in message.lower() or "。no" in message.lower() or "。yes" in message.lower() or ".yes" in message.lower():
                message = message.lower().replace(".no", "").replace(".yes", "").replace("。no", "").replace("。yes",
                                                                                                            "").replace(
                    "。yesno", "").replace(".yesno", "").strip()
                if message != "":
                    reason_ = "[" + message + "]的"
                else:
                    reason_ = ""
                list_ = ["是", "否"]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason_}是或否：【{random.choice(list_)}】\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".draw" == message.lower() or "。draw" == message.lower() or "。全牌堆列表" == message.lower() or ".全牌堆列表" == message.lower():
                os.startfile("CardDecks")
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
        else:
            if ".jrrp" in message or "。jrrp" in message:
                self.jrrp(role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            if ".draw" in message or "。draw" in message or "。selfdraw" in message or ".selfdraw" in message or "。drawself" in message or ".drawself" in message:
                self.drawcard(message, role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            if ".no" in message.lower() or "。no" in message.lower() or "。yes" in message.lower() or ".yes" in message.lower():
                message = message.lower().replace("。yesno", "").replace(".yesno", "").replace(".no", "").replace(".yes",
                                                                                                                 "").replace(
                    "。no", "").replace("。yes", "").strip()
                if message != "":
                    reason_ = "由于[" + message + "]的"
                else:
                    reason_ = ""
                list_ = ["是", "否"]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{self.role_entries_name[role]}{reason_}是或否：【{random.choice(list_)}】\n\n')
                self.chat_log.yview(tk.END)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
        if message:
            timestamp = datetime.now().strftime("%Y/%m/%d %H:%M:%S")
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                log = f"{name_} {timestamp}\n{message}\n\n"  # 不加引号
                self.chat_log.insert(tk.END, log)
                # 滚动到最底部
                self.chat_log.yview(tk.END)
                self.role_entries[role].delete("1.0", tk.END)
                return
            log = f"{self.role_entries_name[role]} {timestamp}\n{message}\n\n"  # 不加引号
            if message.startswith(".st") or message.startswith("。st"):
                message = message[len("st") + 1:].strip()

                parts_skill = re.findall(r'([\u4e00-\u9fa5a-zA-Z\s]+)(\d+)', message)
                if ("+" or "-" or "*" or "/") in message and "#" not in message:
                    parts = re.findall(r'([#+]?[\u4e00-\u9fa5a-zA-Z\s]+)([-+*/^])(\d+)', message)
                    print(parts)
                    # print(str(parts[0][0]).upper())
                    if parts and len(parts) > 0 and len(parts[0]) > 0:
                        role_Chart[role][str(parts[0][0]).upper()] = eval(
                            str(role_Chart_detail[str(parts[0][0]).upper()]) + parts[0][1] + parts[0][2])
                    # print(str(parts[0][0]).upper()+":"+str(role_Chart[role][str(parts[0][0]).upper()]))
                    self.chat_log.insert(tk.END,
                                         f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的【{str(parts[0][0]).upper()}】变更为{str(role_Chart[role][str(parts[0][0]).upper()])}\n\n')
                    # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的【{str(parts[0][0]).upper()}】变更为{str(role_Chart[role][str(parts[0][0]).upper()])}\n"
                    # 滚动到最底部
                    self.chat_log.yview(tk.END)
                else:
                    new_chart = self.parse_input_skill(message.upper()).copy()
                    print(new_chart)

                    self.update_skills(role_Chart[role], new_chart)
                    if "NPC_name" in role:
                        role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                    else:
                        role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                    # if self.role_entries_name[role] in role_Chart_at_name:
                    role_Chart_at_name[self.role_entries_name[role]] = role_Chart[role].copy()
                    if role in self.role_avatar_paths:
                        role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = self.role_avatar_paths[role]
                    self.save_role_skill_at_name()
                    # print(role_Chart_at_name[self.role_entries_name[role]])
                SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                POW = role_Chart_detail.get("POW")
                DB = role_Chart_detail.get("DB")
                if "#SAN" in role_Chart_detail:
                    _SAN = role_Chart_detail.get("#SAN")
                else:
                    _SAN = 100
                if "HP" in message.upper():
                    HP_ = self.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("2.0", "3.0")
                    self.role_values_entry[role].insert("2.0",
                                                        f'{HP_}/{HP}:HP\n')
                if "MP" in message.upper():
                    MP_ = self.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("3.0", "4.0")
                    self.role_values_entry[role].insert("3.0",
                                                        f'{MP_}/{MP}:MP\n')
                if "SAN" in message.upper():
                    SAN_ = self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                    # if SAN_ == 0 or SAN_ == "":
                    # SAN_ = POW
                    self.role_values_entry[role].delete("1.0", "2.0")
                    self.role_values_entry[role].insert("1.0",
                                                        f'{SAN_}/{_SAN}:SAN\n')
                if "MOV" in message.upper():
                    MOV_ = self.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("4.0", "5.0")
                    self.role_values_entry[role].insert("4.0",
                                                        f'{MOV_}/{MOV}:MOV\n')
                if "DB" in message.upper():
                    self.role_values_entry[role].delete("5.0", "6.0")
                    self.role_values_entry[role].insert("5.0",
                                                        f'\n{DB}:DB\n')
                else:
                    self.role_values_entry[role].insert("1.0",
                                                        f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                self.role_entries[role].delete("1.0", tk.END)
                # self.chat_log.insert(tk.END, f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime(
                # "%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\nSAN:{SAN}\nHP:{HP}\nMP:{MP}\nMOV:{
                # MOV}\n\n\n')
                if parts_skill and len(parts_skill) > 0 and len(parts_skill[0]) > 0:
                    self.role_entries[role].insert(tk.END, "已录入！")
                    if "HP" in str(parts_skill[0][0]).upper() or "MP" in str(parts_skill[0][0]).upper() or "SAN" in str(
                            parts_skill[0][0]).upper() or "MOV" in str(parts_skill[0][0]).upper():
                        self.chat_log.insert(tk.END,
                                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get("1.0", "5.0").strip()}\n\n')
                        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get('1.0', '5.0').strip()}\n"
                        self.chat_log.yview(tk.END)
                    else:
                        if len(parts_skill) == 1 and "#" not in message:
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的【{str(parts_skill[0][0]).upper()}】成长为{str(role_Chart[role][str(parts_skill[0][0]).upper()])}！\n\n')
                        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的【{str(parts_skill[0][0]).upper()}】成长为{str(role_Chart[role][str(parts_skill[0][0]).upper()])}！\n"
                        self.chat_log.yview(tk.END)
                else:
                    self.role_entries[role].insert(tk.END, "已刷新！")
                self.update_health_bar(role)
            else:
                fire_babel(self, role)
                self.chat_log.insert(tk.END, log)
                # 滚动到最底部
                self.chat_log.yview(tk.END)
                self.role_entries[role].delete("1.0", tk.END)

                # 计算字数加至时间，不计括号内的文字
                matches = re.findall(r'\(([^)]*)\)', message)
                if matches:
                    for m in matches:
                        message = message.replace(f"({m})", "")
                matches = re.findall(r'（([^）]*)）', message)
                if matches:
                    for m in matches:
                        message = message.replace(f"（{m}）", "")
                if 0 < len(message) < _speechspeed:
                    seconds = 1
                else:
                    seconds = int(len(message) / _speechspeed)
                if seconds > 0:
                    global _secondsTime
                    _secondsTime += seconds
                    while _secondsTime >= 60:
                        self.trpg_module.add_time_1min()
                        _secondsTime -= 60
                    print(f"秒表：{_secondsTime}秒")
        # 妙语
        if role != "DiceBot" and "NPC_name" not in role:
            global mav_prob
            rand_num = random.random()  # 生成0到1之间的随机数
            if rand_num >= 1 - mav_prob:
                if self.role_entries_name[role] in bot_personality["妙语"]:
                    _mav_list = []
                    _mav_list = bot_personality["妙语"][self.role_entries_name[role]] + bot_personality["妙语"]["通用"]
                    mav_words_ = random.choice(_mav_list)
                else:
                    mav_words_ = random.choice(bot_personality["妙语"]["通用"])
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                self.chat_log.yview(tk.END)

    def update_jrrp(self, role):
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
        else:
            luck_dic = self.luck_by_name[role].copy()
        if luck_dic["_success"] + luck_dic["_fail"] > 0:
            luck_dic["_luck"] = luck_dic["_success"] / (luck_dic["_success"] + luck_dic["_fail"])
            luck_dic["_fumble_rate"] = luck_dic["_fumble"] / (luck_dic["_success"] + luck_dic["_fail"])
            luck_dic["_critical_rate"] = luck_dic["_critical"] / (luck_dic["_success"] + luck_dic["_fail"])
        luck_dic["_luck_exp"] = np.mean(luck_dic["_luck_exp_value"]) / 100
        if luck_dic["_critical"] > 0 or luck_dic["_fumble"] > 0:
            luck_dic["_luck_weight"] = luck_dic["_luck"] + ((luck_dic["_critical"] - luck_dic["_fumble"]) / (
                    luck_dic["_critical"] + luck_dic["_fumble"])) * 0.1
        else:
            luck_dic["_luck_weight"] = luck_dic["_luck"]
        for key, item in luck_dic.items():
            if "_value" not in key:
                luck_dic[key] = round(item, 4)
        if luck_dic:
            if role in self.role_entries_name:
                self.luck_by_name[self.role_entries_name[role]] = luck_dic
            else:
                self.luck_by_name[role] = luck_dic

    def jrrp(self, role):
        self.update_jrrp(role)
        name = ""
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
            name = self.role_entries_name[role]
        else:
            luck_dic = self.luck_by_name[role].copy()
            name = role
        # print(luck_dic)
        rank = 0
        rank_all = 0
        rank_weight = 0
        rank_jrrp = 0
        for role_, dic in self.luck_by_name.items():
            if dic["_d100"] > 0 and (dic["_success"] > 0 or dic["_fail"] > 0):
                rank_all += 1
                rank += 1
                rank_weight += 1
                if role_ != name and luck_dic["_luck"] > dic["_luck"]:
                    rank -= 1
                if role_ != name and luck_dic["_luck_weight"] > dic["_luck_weight"]:
                    rank_weight -= 1
        rank_percentage = round(rank / rank_all * 100, 2)
        rank_weight_percentage = round(rank_weight / rank_all * 100, 2)
        d100_mean = round(np.mean(luck_dic["_d100_value"]), 2)
        d100_standard = round(np.std(luck_dic["_d100_value"]), 2)
        self.jrrp_value = {}
        value_list = []
        for r, dict in self.luck_by_name.items():
            if dict["_luck_exp"] != 0:
                self.jrrp_value[r] = int(round(dict["_luck"] / dict["_luck_exp"] * 100, 0)) - 100
        for r, value in self.jrrp_value.items():
            value_list.append(value)
        min_value = min(value_list)  # 0
        max_value = max(value_list)  # 100

        def map_to_range(value):
            return int(round(((value - min_value) / (max_value - min_value)) * 100, 0))

        self.jrrp_value = {key: map_to_range(self.jrrp_value[key]) for key in self.jrrp_value.keys()}
        for r, value in self.jrrp_value.items():
            rank_jrrp += 1
            if r != name and self.jrrp_value[name] > value:
                rank_jrrp -= 1
        rank_jrrp_percentage = round(rank_jrrp / rank_all * 100, 2)

        self.chat_log.insert(tk.END,
                             f'掷骰统计 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{name}】今日人品: {self.jrrp_value[name]} ')
        self.role_entries[role].delete("1.0", tk.END)
        self.role_entries[role].insert(tk.END, f'今日人品: {self.jrrp_value[name]}')
        if rank_all == 1:
            content_string = f'人品排名: 独孤求败...\n'
        else:
            content_string = f'人品排名: {rank_jrrp}/{rank_all}[{rank_jrrp_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'成功率: {round(luck_dic["_luck"] * 100, 2)}%→{round(luck_dic["_luck_exp"] * 100, 2)}%[{luck_dic["_success"]}/{luck_dic["_success"] + luck_dic["_fail"]}]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        if rank_all == 1:
            content_string = f'排名: 独孤求败...\n'
        else:
            content_string = f'排名: {rank}/{rank_all}[{rank_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'大成功率: {round(luck_dic["_critical_rate"] * 100, 2)}%({luck_dic["_critical"]})\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'大失败率: {round(luck_dic["_fumble_rate"] * 100, 2)}%({luck_dic["_fumble"]})\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'加权成功率: {round(luck_dic["_luck_weight"] * 100, 2)}%\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        if rank_all == 1:
            content_string = f'加权排名: 独孤求败...\n'
        else:
            content_string = f'加权排名: {rank_weight}/{rank_all}[{rank_weight_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'D100掷骰次数: {luck_dic["_d100"]}\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'D100掷骰统计: {d100_mean}→50.50[{abs(round(d100_standard - 28.58, 2))}]\n'
        self.chat_log.insert(tk.END, f'{content_string}\n')
        self.chat_log.yview(tk.END)

    def jrrp_record(self, role, content, tag):
        if "###" in content:
            conexpress = content.split("###")[1]
            content = content.split("###")[0]
        else:
            conexpress = ""
        if "\n\n[成长检定]" in content:
            self.jrrp_record(role, content.split("\n\n[成长检定]")[1], "growth")
            content = content.split("\n\n[成长检定]")[0]
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
        else:
            if "NPC_name" in role:
                return
            luck_dic = self.luck_by_name[role].copy()
        if tag == "silent":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        luck_dic["_d100"] += 1
                        luck_dic["_d100_value"].append(int(content))
                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "all":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        luck_dic["_d100"] += 1
                        luck_dic["_d100_value"].append(int(content))
                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "solo":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        luck_dic["_d100"] += 1
                        luck_dic["_d100_value"].append(int(content))
                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            if ":" in n:
                                luck_dic["_luck_exp_value"].append(int(n.split(":")[0]))
                            else:
                                luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "growth":
            content = content.split("1D100=")[1]
            comment = content.split(")")[1]
            content = content.split(")")[0]
            number = content.split("/")[0]  # 只有一个
            luck_dic["_d100_value"].append(int(number))
            exp_number = content.split("/")[1]  # 只有一个
            luck_dic["_luck_exp_value"].append(int(100 - int(exp_number)))
            if "败北" in comment:
                luck_dic["_fail"] += 1
            else:
                luck_dic["_success"] += 1
        else:
            print(content)
        self.update_jrrp(role)
        if luck_dic:
            if role in self.role_entries_name:
                self.luck_by_name[self.role_entries_name[role]] = luck_dic
            else:
                self.luck_by_name[role] = luck_dic

    def drawcard(self, message, role):
        message = message.replace("alldraw", "draw").replace("drawall", "draw")
        if "drawself" in message or "selfdraw" in message:
            message = message.replace("self", "")
            num = 1
            if "*" in message:
                num = int(message.split("*")[1])
                message = message.split("*")[0]
            cardname = message.replace("drawself", "draw").replace("selfdraw", "draw").replace(".draw_", "").replace(
                "。draw_", "").replace(".draw", "").replace("。draw", "")
            cardname = cardname.replace("?", "").replace("？", "").strip()
            Cards_now = load_CardDeck(cardname)
            # self.role_entries[role].delete("1.0", tk.END)
            if Cards_now:
                result_ = ""
                while num > 0:
                    if "?" in message or "？" in message:
                        if role not in Cards_list_by_role:
                            Cards_list_by_role[role] = {}
                        if cardname not in Cards_list_by_role[role]:
                            Cards_list_by_role[role][cardname] = Cards_now
                        elif len(Cards_list_by_role[role][cardname]) == 0:
                            Cards_list_by_role[role][cardname] = Cards_now
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_list_by_role[role][cardname])
                            Cards_list_by_role[role][cardname].remove(result)
                            if num == 1:
                                self.role_entries[role].insert(tk.END,
                                                               f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】的不放回牌堆[{cardname}]还余{len(Cards_list_by_role[role][cardname])}张卡。\n\n')
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_list_by_role[role][cardname][cardname])
                            if len(Cards_list_by_role[role][cardname][cardname]) != 1:
                                Cards_list_by_role[role][cardname][cardname].remove(result)
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if num == 1:
                                self.role_entries[role].insert(tk.END,
                                                               f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】的不放回牌堆[{cardname}]还余{len(Cards_list_by_role[role][cardname][cardname])}张卡。\n\n')
                                if len(Cards_list_by_role[role][cardname][cardname]) == 0:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'已自动补充牌堆。\n')
                                    Cards_list_by_role[role][cardname] = load_CardDeck(cardname)[cardname]
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"
                        cardname = cardname + "(不放回)"
                    else:
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_now)
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_now[cardname])
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"

                    if "draw_" in message or "draw_" in message:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n", "")
                            result = f"\n{result}".replace("\n\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的暗抽。\n\n')
                            self.role_entries[role].insert(tk.END,
                                                           f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的抽取结果：{result}\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    else:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "\n")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    num -= 1
            else:
                print("未找到牌堆或牌堆为空！")
                os.startfile("CardDecks")
            return
        else:
            num = 1
            if "*" in message:
                num = int(message.split("*")[1])
                message = message.split("*")[0]
            cardname = message.replace(".draw_", "").replace("。draw_", "").replace(".draw", "").replace("。draw", "")
            cardname = cardname.replace("?", "").replace("？", "").strip()
            Cards_now = load_CardDeck(cardname)
            # self.role_entries[role].delete("1.0", tk.END)
            if Cards_now:
                result_ = ""
                while num > 0:
                    if "?" in message or "？" in message:
                        if cardname not in Cards_list:
                            Cards_list[cardname] = Cards_now
                        elif len(Cards_list[cardname]) == 0:
                            Cards_list[cardname] = Cards_now
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_list[cardname])
                            Cards_list[cardname].remove(result)
                            if num == 1:
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n不放回公有牌堆[{cardname}]还余{len(Cards_list[cardname])}张卡。\n\n')
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_list[cardname][cardname])
                            if len(Cards_list[cardname][cardname]) != 1:
                                Cards_list[cardname][cardname].remove(result)
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if num == 1:
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n不放回公有牌堆[{cardname}]还余{len(Cards_list[cardname][cardname])}张卡。\n\n')
                                if len(Cards_list[cardname][cardname]) == 0:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'已自动补充牌堆。\n')
                                    Cards_list[cardname][cardname] = load_CardDeck(cardname)[cardname]
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"
                        cardname = cardname + "(不放回)"
                    else:
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_now)
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_now[cardname])
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"

                    if "draw_" in message or "draw_" in message:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "")
                            result = f"\n{result}".replace("\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的暗抽。\n\n')
                            self.role_entries[role].insert(tk.END,
                                                           f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    else:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "")
                            result = f"\n{result}".replace("\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    num -= 1
            else:
                print("未找到牌堆或牌堆为空！")
                os.startfile("CardDecks")
            return

    def parse_input_skill(self, input_string):
        skills = {}
        # 使用正则表达式从输入字符串中提取技能和值的组合
        if "@" in input_string:
            input_string = input_string[1:]
            input_string = input_string.split("@")
            skill = input_string[0]
            modifier = input_string[1]
            print(skill)
            print(modifier)
            skill_name = "#" + skill.strip().upper()
            skill_value = modifier
            skills[skill_name] = skill_value
        else:
            pattern = re.compile(r'([\u4e00-\u9fa5a-zA-Z\s]+)(\d+)')
            matches = pattern.findall(input_string)
            for match in matches:
                skill_name = match[0].strip().upper()
                skill_value = int(match[1])
                skills[skill_name] = skill_value
        # print(skills)
        return skills

    def update_skills(self, old_dict, new_dict):
        skill_dict = []
        for skill, value in new_dict.items():
            skill_dict.append(skill)
            if skill in old_dict:
                # 如果技能已存在于旧字典中，更新数值
                old_dict[skill] = value
            else:
                # 如果技能不存在于旧字典中，将其添加到旧字典
                old_dict[skill] = value
        if (old_dict["SIZ"] == 0) and (old_dict["体型"] != 0) and (old_dict["体型"] != "SIZ"):
            old_dict["EDU"] = old_dict["教育"]
            old_dict["APP"] = old_dict["外貌"]
            old_dict["DEX"] = old_dict["敏捷"]
            old_dict["STR"] = old_dict["力量"]
            old_dict["INT"] = old_dict["智力"]
            old_dict["CON"] = old_dict["体质"]
            old_dict["POW"] = old_dict["意志"]
            old_dict["SIZ"] = old_dict["体型"]
            old_dict["LUCK"] = old_dict["幸运"]
        if old_dict["SIZ"] >= 0 and (old_dict["体型"] == "SIZ"):
            old_dict["教育"] = old_dict["EDU"]
            old_dict["外貌"] = old_dict["APP"]
            old_dict["敏捷"] = old_dict["DEX"]
            old_dict["力量"] = old_dict["STR"]
            old_dict["智力"] = old_dict["INT"]
            old_dict["体质"] = old_dict["CON"]
            old_dict["意志"] = old_dict["POW"]
            old_dict["体型"] = old_dict["SIZ"]
            old_dict["幸运"] = old_dict["LUCK"]
        old_dict["灵感"] = old_dict["智力"]
        if (old_dict["HP"] == "(CON+SIZ)/10") or (old_dict["HP"]) == 0 or ("HP" not in skill_dict):
            old_dict["HP"] = int((old_dict["体质"] + old_dict["体型"]) / 10)
        if (old_dict["MP"] == "POW/5") or (old_dict["MP"]) == 0 or ("MP" not in skill_dict):
            old_dict["MP"] = int(old_dict["意志"] / 5)
        if old_dict["SAN"] == "POW" or ("SAN" not in skill_dict) or (old_dict["SAN"] == old_dict["意志"]):
            old_dict["SAN"] = old_dict["意志"]
            print(skill_dict)
        else:
            pass
        old_dict["理智"] = old_dict["SAN"]
        if new_dict:
            if old_dict["闪避"] > int(old_dict["敏捷"] / 2):
                pass
            elif "闪避" in new_dict:
                pass
            else:
                old_dict["闪避"] = int(old_dict["敏捷"] / 2)
            if old_dict["母语"] != "EDU" and old_dict["母语"] > old_dict["教育"]:
                pass
            elif "母语" in new_dict:
                pass
            else:
                old_dict["母语"] = old_dict["教育"]
            old_dict["魅力"] = old_dict["外貌"]
        old_dict["CM"] = old_dict["克苏鲁神话"]
        old_dict["克苏鲁"] = old_dict["克苏鲁神话"]
        old_dict["计算机"] = old_dict["计算机使用"]
        old_dict["电脑"] = old_dict["计算机使用"]
        old_dict["法学"] = old_dict["司法科学"]
        old_dict["霰弹枪"] = old_dict["步枪/霰弹枪"]
        old_dict["步枪"] = old_dict["步枪/霰弹枪"]
        if old_dict["信用评级"] > 0:
            old_dict["信用"] = old_dict["信用评级"]
        else:
            old_dict["信用评级"] = old_dict["信用"]
        if old_dict["MOV"] == 8:
            if ("mov" in new_dict) or ("MOV" in new_dict):
                pass
            elif (old_dict["敏捷"] < old_dict["体型"]) and (old_dict["力量"] < old_dict["体型"]):
                old_dict["MOV"] = 7
            elif (old_dict["敏捷"] > old_dict["体型"]) and (old_dict["力量"] > old_dict["体型"]):
                old_dict["MOV"] = 9
            else:
                old_dict["MOV"] = 8
        if old_dict["DB"] == 1:
            old_dict["DB"] = "1(+1D4)"
        if old_dict["DB"] == 2:
            old_dict["DB"] = "2(+1D6)"
        if old_dict["DB"] == -2:
            old_dict["DB"] = "-2(-2)"
        if old_dict["DB"] == -1:
            old_dict["DB"] = "-1(-1)"
        if old_dict["DB"] == 0:
            old_dict["DB"] = "0(0)"

        if old_dict["力量"] + old_dict["体型"] <= 164:
            old_dict["DB"] = "1(+1D4)"
            if old_dict["力量"] + old_dict["体型"] <= 124:
                old_dict["DB"] = "0(0)"
            if old_dict["力量"] + old_dict["体型"] <= 84:
                old_dict["DB"] = "-1(-1)"
            if old_dict["力量"] + old_dict["体型"] <= 64:
                old_dict["DB"] = "-2(-2)"
            if old_dict["力量"] + old_dict["体型"] <= 0:
                old_dict["DB"] = "0(0)"
        else:
            old_dict["DB"] = "2(+1D6)"
        if "图书馆使用" not in old_dict or old_dict["图书馆使用"] == 20:
            old_dict["图书馆使用"] = old_dict["图书馆"]
        if ("图书馆使用" in old_dict) and old_dict["图书馆使用"] > 20 and old_dict["图书馆"] == 20:
            old_dict["图书馆"] = old_dict["图书馆使用"]

        if "ARMOR" not in old_dict:
            old_dict["ARMOR"] = 0
        old_dict["#SAN"] = 100 - old_dict["克苏鲁神话"]

        # 基于年龄的调整值
        if "年龄" not in old_dict and "生日" not in old_dict and "生日" in new_dict:
            pass
        else:
            # 开启老化的年龄计算（。st生日）
            if "生日" not in old_dict and "生日" in new_dict:
                if new_dict["生日"] == "":
                    # 计算生日
                    current_date = self.time_log.get("1.0", tk.END).split("【日期】")[1].split(" ")[0]
                    date_object = datetime.strptime(current_date, "%Y/%m/%d")
                    # 提取年、月和日
                    year = date_object.year - old_dict["年龄"]
                    month = date_object.month
                    day = date_object.day
                    old_dict["生日"] = f"{year}/{month}/{day}"
                else:
                    old_dict["生日"] = new_dict["生日"]
            elif "生日" in old_dict and old_dict["生日"] != "":
                # 将日期对象格式化为统一的格式
                standard_format = "%Y/%m/%d"
                parsed_date = old_dict["生日"]
                current_date = self.time_log.get("1.0", tk.END).split("【日期】")[1].split(" ")[0]
                # 定义所有可能的日期格式
                possible_formats = ["%Y-%m-%d", "%d-%b-%Y", "%Y/%m/%d", "%b %d, %Y", "%Y年%m月%d日"]
                # 将字符串转换为日期对象
                for format_str in possible_formats:
                    try:
                        parsed_date = datetime.strptime(old_dict["生日"], format_str)
                        break
                    except ValueError:
                        continue
                        # 将日期对象格式化为统一的格式
                formatted_date = parsed_date.strftime(standard_format)
                # 将日期字符串解析为日期对象
                date_object = datetime.strptime(formatted_date, "%Y/%m/%d")
                current_date_object = datetime.strptime(current_date, "%Y/%m/%d")
                if current_date_object.month >= date_object.month and current_date_object.day >= date_object.day:
                    old_dict["年龄"] = current_date_object.year - date_object.year
                else:
                    old_dict["年龄"] = current_date_object.year - date_object.year - 1

            if "_年龄" not in old_dict and "年龄" in old_dict:  # 初始调整值
                old_dict["_年龄"] = old_dict["年龄"]
                if old_dict["年龄"] < 15:
                    old_dict["教育"] = (old_dict["年龄"] - 6) * 5
                    old_dict["EDU"] = (old_dict["年龄"] - 6) * 5
                    old_dict["体型"] -= 1
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["体型"], old_dict["力量"], old_dict["体质"])
                    # 将最小的变量减1
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["体型"]:
                        old_dict["体型"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["力量"] = min_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["SIZ"] = old_dict["体型"]
                    old_dict["CON"] = old_dict["体质"]
                else:
                    if 15 <= old_dict["年龄"] <= 19:
                        old_dict["教育"] -= 5
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["体型"] -= 2
                        old_dict["力量"] -= 2
                        # 找到最小的变量
                        min_var = min(old_dict["体型"], old_dict["力量"])
                        # 将最小的变量减1
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["体型"]:
                            old_dict["体型"] = min_var
                        else:
                            old_dict["力量"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["SIZ"] = old_dict["体型"]
                    elif 20 <= old_dict["年龄"] <= 39:
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                    elif 40 <= old_dict["年龄"] <= 49:
                        old_dict["MOV"] -= 1
                        old_dict["APP"] -= 5
                        old_dict["外貌"] = old_dict["APP"]
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["力量"] -= 1
                        old_dict["体质"] -= 1
                        old_dict["敏捷"] -= 1
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 50 <= old_dict["年龄"] <= 59:
                        old_dict["MOV"] -= 2
                        old_dict["APP"] -= 10
                        old_dict["外貌"] -= 10
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 3
                        old_dict["体质"] -= 3
                        old_dict["敏捷"] -= 3
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 60 <= old_dict["年龄"] <= 69:
                        old_dict["MOV"] -= 3
                        old_dict["APP"] -= 15
                        old_dict["外貌"] -= 15
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 6
                        old_dict["体质"] -= 6
                        old_dict["敏捷"] -= 6
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 70 <= old_dict["年龄"] <= 79:
                        old_dict["MOV"] -= 4
                        old_dict["APP"] -= 20
                        old_dict["外貌"] -= 20
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 13
                        old_dict["体质"] -= 13
                        old_dict["敏捷"] -= 13
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 80 <= old_dict["年龄"] <= 89:
                        old_dict["MOV"] -= 5
                        old_dict["APP"] -= 25
                        old_dict["外貌"] -= 25
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 26
                        old_dict["体质"] -= 26
                        old_dict["敏捷"] -= 26
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]
                    else:
                        old_dict["MOV"] = 1
                        old_dict["APP"] -= 30
                        old_dict["外貌"] -= 30
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["力量"] = 1
                        old_dict["体质"] = 1
                        old_dict["敏捷"] = 1
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]
                self.update_skills(old_dict, {})

            if old_dict["_年龄"] != old_dict["年龄"]:  # 老化规则：
                if 15 > old_dict["年龄"] >= 8 and old_dict["_年龄"] < 15:
                    old_dict["教育"] = (old_dict["年龄"] - 6) * 5
                    old_dict["EDU"] = (old_dict["年龄"] - 6) * 5
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["体型"])
                    min_var += 4
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["体型"] = min_var
                    # 找到最大的变量
                    max_var = max(old_dict["力量"], old_dict["体质"], old_dict["体型"])
                    max_var += 4
                    # 根据最大的变量是哪一个，更新原始变量
                    if max_var == old_dict["力量"]:
                        old_dict["力量"] = max_var
                    elif max_var == old_dict["体质"]:
                        old_dict["体质"] = max_var
                    else:
                        old_dict["体型"] = max_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["SIZ"] = old_dict["体型"]
                if 15 <= old_dict["年龄"] <= 20 and old_dict["_年龄"] < 20:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["体型"] += 2
                    old_dict["力量"] += 2
                    # 找到最大的变量
                    max_var = max(old_dict["体型"], old_dict["力量"])
                    # 将最大的变量加1
                    max_var += 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if max_var == old_dict["体型"]:
                        old_dict["体型"] = max_var
                    else:
                        old_dict["力量"] = max_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["SIZ"] = old_dict["体型"]
                if 40 <= old_dict["年龄"] <= 49 and old_dict["_年龄"] < 40:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    old_dict["敏捷"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 50 <= old_dict["年龄"] <= 59 and old_dict["_年龄"] < 50:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    old_dict["敏捷"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 60 <= old_dict["年龄"] <= 69 and old_dict["_年龄"] < 60:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 3
                    old_dict["体质"] -= 3
                    old_dict["敏捷"] -= 3
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 70 <= old_dict["年龄"] <= 79 and old_dict["_年龄"] < 70:
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 6
                    old_dict["体质"] -= 6
                    old_dict["敏捷"] -= 6
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 80 <= old_dict["年龄"] <= 89 and old_dict["_年龄"] < 80:
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 13
                    old_dict["体质"] -= 13
                    old_dict["敏捷"] -= 13
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 90 <= old_dict["年龄"] <= 99 and old_dict["_年龄"] < 90:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 100 <= old_dict["年龄"] <= 109 and old_dict["_年龄"] < 100:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 110 <= old_dict["年龄"] <= 119 and old_dict["_年龄"] < 110:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 120 <= old_dict["年龄"] <= 129 and old_dict["_年龄"] < 120:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 130 <= old_dict["年龄"] <= 139 and old_dict["_年龄"] < 130:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 140 <= old_dict["年龄"] <= 149 and old_dict["_年龄"] < 140:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 150 <= old_dict["年龄"] <= 159 and old_dict["_年龄"] < 150:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                old_dict["_年龄"] = old_dict["年龄"]
                self.update_skills(old_dict, {})
            else:
                pass

    def edit_role_name(self, event, role, label):
        label.config(relief=tk.GROOVE)
        entry = tk.Entry(label, width=10)
        entry.insert(0, role)
        entry.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        entry.bind("<FocusOut>",
                   lambda event, role=role, entry=entry, label=label: self.update_role_name(event, role, entry, label))

    def update_role_name(self, event, role, entry, label):
        global bot_personality
        global bot_personality_by_name
        global mav_prob
        label.config(relief=tk.FLAT, font=("Times New Roman", 16, "bold"))
        new_name = entry.get().strip()
        if new_name and new_name != "":
            if "NPC_name" in role:
                entry.grid_forget()
                label.configure(text=new_name)
                return
            # 更新角色名
            index = self.roles.index(role)
            # self.roles[index] = new_name
            self.role_entries_name[role] = new_name
            babel(self)
            # 更新当前角色名
            # if self.current_role.get() == role:
            # self.current_role.set(new_name)

            # 初始化当前角色codename
            if role in self.role_entries_name:
                self.codename_by_name[role] = self.role_entries_name[role]
            else:
                self.codename_by_name[role] = role

            entry.grid_forget()
            label.configure(text=new_name)

            if role == "DiceBot":
                # 按名牌加载Bot性格
                for names in bot_personality_by_name:
                    if names == self.role_entries_name["DiceBot"]:
                        bot_personality = bot_personality_by_name[names]
                        self.trpg_module.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                        self.trpg_module.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                        self.trpg_module.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                        self.trpg_module.Success = random.choice(bot_personality["Success"]["通用"])
                        self.trpg_module.Failure = random.choice(bot_personality["Failure"]["通用"])
                        self.trpg_module.Fumble = random.choice(bot_personality["Fumble"]["通用"])
                        self.trpg_module.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
                        self.trpg_module.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]
                        mav_prob = bot_personality["妙语"]["_mav_prob"]  # 妙语概率
                        print("妙语概率：" + str(mav_prob))
                        self.role_entries["DiceBot"].insert("1.0", f"已录入[{names}]的性格！\n")
                        break

            # 按名牌加载设置
            if new_name in role_Chart_at_name and (new_name != role) and ("PL " not in new_name):
                if new_name in self.infoCanvas_data_by_name:
                    self.infoCanvas_data[role] = self.infoCanvas_data_by_name[new_name]
                role_Chart[role] = role_Chart_at_name[new_name].copy()
                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                # self.role_entries[role].delete("1.0", tk.END)
                self.role_avatar_paths[role] = role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"]
                self.load_and_display_avatar(role, self.role_entries[role].master)
                SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                POW = role_Chart_detail.get("POW")
                DB = role_Chart_detail.get("DB")
                if "#SAN" in role_Chart_detail:
                    SAN_ = role_Chart_detail.get("#SAN")
                else:
                    _SAN_ = 100
                self.role_values_entry[role].insert("1.0",
                                                    f'{SAN}/{SAN_}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                # self.role_entries[role].delete("1.0", tk.END)
                # self.role_entries[role].insert(tk.END, "已录入！")
                # self.chat_log.insert(tk.END,
                # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\nSAN:{SAN}\nHP:{HP}\nMP:{MP}\nMOV:{MOV}\n\n\n')
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get("1.0", "5.0").strip()}\n\n')
                self.chat_log.yview(tk.END)
                self.role_entries[role].insert("1.0", "已加载名牌为[" + new_name + "]的角色卡！\n")
            else:
                role_Chart[role] = role_Chart_detail_demo.copy()
            if f"===状态===" not in self.role_values_entry[role].get("1.0", tk.END).strip():
                self.role_values_entry[role].insert(tk.END, f"\n===状态===\n无(永久)\n")
            if new_name in self.role_items:
                for key, value in self.role_items[new_name].items():
                    if value != "":
                        for value_ in value:
                            if value_ != "":
                                self.role_values_entry[role].insert(tk.END, f"\n==={key}===\n" + "\n".join(value))
            # 重新创建角色框架
            # for widget in self.root.grid_slaves(column=2):
            # widget.grid_forget()

            # self.create_role_frames()

    def add_role(self):
        self.role_count += 1
        # print(self.role_count)
        # self.role_count = self.role_count
        new_role = f"PL {len(self.roles) - 1}"
        self.roles.append(new_role)
        if new_role not in self.codename_by_name:
            self.codename_by_name[new_role] = new_role
        if new_role not in self.role_entries_name:
            self.role_entries_name[new_role] = new_role
            self.codename_by_name[new_role] = new_role
        elif self.role_entries_name[new_role] != new_role:
            self.codename_by_name[new_role] = self.role_entries_name[new_role]
            pass
        if new_role in self.role_entries_name:
            if self.role_entries_name[new_role] not in self.role_skill_menu:
                self.role_skill_menu[self.role_entries_name[new_role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if self.role_entries_name[new_role] not in self.luck_by_name:
                self.luck_by_name[self.role_entries_name[new_role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
        else:
            if new_role not in self.luck_by_name:
                self.luck_by_name[new_role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        num_cols = 3
        idx = len(self.roles) - 1
        row = idx % num_cols
        col = idx // num_cols
        self.create_role_frame(new_role, row, col)

        # 超过3列时自动换列
        if col > 2:
            self.root.columnconfigure(col + 2, weight=1)

        # 重新创建角色框架
        # for widget in self.root.grid_slaves(column=2):
        # widget.grid_forget()

        # self.create_role_frames()
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

    def add_role_init(self):
        self.role_count = self.role_count
        new_role = f"PL {len(self.roles) - 1}"
        self.roles.append(new_role)
        self.canvas_icon_animate[new_role] = tk.Canvas(self.root, width=20, height=20)
        self.image_references_on_Avatar[new_role] = []
        self.frames_avatar[new_role] = []
        self.current_frame_avatar[new_role] = []
        self.frames_icon[new_role] = []
        self.current_frame_icon[new_role] = []
        self.frames_map[new_role] = []
        self.current_frame_map[new_role] = []
        self.frames_icon_on_canvas[new_role] = []
        self.current_frame_icon_on_canvas[new_role] = []
        if new_role not in self.role_entries_name:
            self.role_entries_name[new_role] = new_role
        elif self.role_entries_name[new_role] != new_role:
            pass
        if new_role not in self.codename_by_name:
            if new_role in self.role_entries_name:
                self.codename_by_name[new_role] = self.role_entries_name[new_role]
            else:
                self.codename_by_name[new_role] = new_role
        if new_role in self.role_entries_name:
            if self.role_entries_name[new_role] not in self.role_skill_menu:
                self.role_skill_menu[self.role_entries_name[new_role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if self.role_entries_name[new_role] not in self.luck_by_name:
                self.luck_by_name[self.role_entries_name[new_role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
        else:
            if new_role not in self.luck_by_name:
                self.luck_by_name[new_role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        num_cols = 3
        idx = len(self.roles) - 1
        row = idx % num_cols
        col = idx // num_cols
        self.create_role_frame(new_role, row, col)

        # 超过3列时自动换列
        if col > 2:
            self.root.columnconfigure(col + 2, weight=1)

        # 重新创建角色框架
        # for widget in self.root.grid_slaves(column=2):
        # widget.grid_forget()

        # self.create_role_frames()
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

    def delete_role(self):
        if len(self.roles) > 3:
            self.role_count -= 1
            role_to_delete = self.roles.pop()
            self.role_entries[role_to_delete].destroy()
            # self.roles[len(self.roles)-1].destroy()
            del self.role_entries[role_to_delete]
            # del self.roles[len(self.roles)]
            self.role_entries_frame[role_to_delete].destroy()
            # 更新当前角色名
            if role_to_delete == self.current_role.get():
                self.current_role.set(self.roles[0])

            # 重新创建角色框架
            # for widget in self.root.grid_slaves(column=2):
            # widget.grid_forget()

            # self.create_role_frames()

    def insert_newline(self):
        current_text = self.role_entries[self.current_role.get()].get("1.0", tk.END)
        self.role_entries[self.current_role.get()].delete("1.0", tk.END)
        self.role_entries[self.current_role.get()].insert(tk.END, current_text)
        self.highlight_role_frame(self.current_role.get())

    def bind_enter_to_send_message(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.current_role.set(role)
        self.root.bind("<Return>", lambda event, role=role: self.send_message_on_enter(event, role))
        self.highlight_role_frame(role)

    def bind_enter_to_send_message_NPC(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.new_combat_window = self.new_combat_windows[role]
        self.current_role.set(role)
        self.new_combat_window.bind("<Return>", lambda event, role=role: self.send_message_on_enter(event, role))
        self.highlight_role_frame(role)

    def env_focus(self, event):
        self.reset_focus(event)
        self.root.bind("<Return>", lambda event, role="env": self.send_message_on_enter(event, role))

    def reset_focus(self, event):
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end
        self.current_role.set("")
        self.root.bind("<Return>", lambda event: self.send_message_on_enter(event))
        self.chat_log.config(relief=tk.SOLID)
        for role in self.role_entries:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)

    def bind_enter_to_send_roll(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.current_role.set(role)
        self.root.bind("<Return>", lambda event, role=role: self.send_roll_on_enter(event, role))
        self.highlight_role_frame_roll(role)

    def bind_enter_to_send_roll_NPC(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.new_combat_window = self.new_combat_windows[role]
        self.current_role.set(role)
        self.new_combat_window.bind("<Return>", lambda event, role=role: self.send_roll_on_enter(event, role))
        self.highlight_role_frame_roll(role)

    def send_message_on_enter(self, event, role=None):
        global datenamelist
        if role == None:
            pass
        elif role == "env":
            env_text = self.time_log.get("1.0", tk.END).strip()
            # self.chat_log.insert(tk.END,
            # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text}\n\n')
            time_info = env_text.split("【时间】")[1]
            date = time_info.split("【日期】")[1]
            time = time_info.split("【地点】")[0]
            time_info = time_info.split("【地点】")[1]
            place = time_info.split("【天气】")[0]
            time_info = time_info.split("【天气】")[1]
            weather = time_info.split("【日期】")[0]
            # 上下午
            if int(time.split(":")[0]) > 12:
                time_ = time + "㏘"
            else:
                time_ = time + "㏂"
            # 季节
            if 5 >= int(date.split("/")[1]) >= 3:
                date_ = "春♧" + date
            elif 8 >= int(date.split("/")[1]) >= 6:
                date_ = "夏♡" + date
            elif 11 >= int(date.split("/")[1]) >= 9:
                date_ = "秋♤" + date
            else:
                date_ = "冬♢" + date
            # 昼夜
            if "夏" in date_:
                if 19 >= int(time.split(":")[0]) >= 6:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            elif "冬" in date_:
                if 17 >= int(time.split(":")[0]) >= 8:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            else:
                if 18 >= int(time.split(":")[0]) >= 7:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            date_ = date_.replace("Monday", datenamelist[0]).replace("Tuesday", datenamelist[1]).replace("Wednesday",
                                                                                                         datenamelist[
                                                                                                             2]).replace(
                "Thursday",
                datenamelist[3]).replace(
                "Friday", datenamelist[4]).replace("Saturday", datenamelist[5]).replace("Sunday", datenamelist[6])
            env_text_ = f"【时间】{time_}【地点】{place}\n【天气】{weather}【日期】{date_}"
            env_text = f"【时间】{time}【地点】{place}【天气】{weather}【日期】{date}"
            self.chat_log.insert(tk.END, f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text_}\n\n')
            self.chat_log.yview(tk.END)
            self.time_log.delete("1.0", tk.END)
            self.time_log.insert("1.0", env_text)
            self.save_settings()
        else:
            self.current_role.set(role)
            # 判断是否同时按下了 Ctrl 键
            if event.state - 4 == 0:  # 4 表示 Ctrl 键的状态值
                return
            # 发送消息
            current_role = role or self.current_role.get()
            self.send_message(current_role)
            self.highlight_role_frame(current_role)

    def send_roll_on_enter(self, event, role=None):
        self.current_role.set(role)
        # 判断是否同时按下了 Ctrl 键
        if event.state - 4 == 0:  # 4 表示 Ctrl 键的状态值
            return
        # 发送消息
        current_role = role or self.current_role.get()
        self.get_and_roll(current_role)
        self.highlight_role_frame_roll(current_role)

    def newline_on_ctrl_enter(self, event):
        # 换行
        current_role = self.current_role.get()
        self.role_entries[current_role].insert(tk.END, "")
        # self.role_entries_roll[current_role].insert(tk.END, "")
        self.highlight_role_frame(current_role)

    def highlight_role_frame(self, role):
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end
        current_role = self.highlighted_role.get()
        # 高亮指定角色的 Frame
        self.highlighted_role.set(role)
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            self.chat_log.insert(tk.END, ">>> 【NPC】" + name_ + "正在输入...")
        else:
            self.chat_log.insert(tk.END, ">>> " + self.role_entries_name[role] + "正在输入...")
        self.chat_log.yview(tk.END)
        for role in self.roles:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        for role in self.new_combat_windows:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        self.role_entries_frame[self.highlighted_role.get()].config(relief=tk.SOLID)
        # self.create_role_frames()
        self.chat_log.config(relief=tk.GROOVE)

    def highlight_role_frame_roll(self, role):
        # 高亮指定角色的 Frame
        self.highlighted_role.set(role)
        for role in self.roles:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        for role in self.new_combat_windows:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        self.role_entries_frame[self.highlighted_role.get()].config(relief=tk.SOLID)
        self.role_entries_roll[self.highlighted_role.get()].config(relief=tk.SOLID)
        # self.create_role_frames()

    def on_at_click(self, role):
        # @点击事件处理
        # self.current_at_role.set(role)
        self.avatar_click_event = role
        current_role = self.current_role.get()
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = role.split("NPC_name")[0]
            self.role_entries[current_role].insert(tk.END, "@" + name_ + " ")
        else:
            self.role_entries[current_role].insert(tk.END, "@" + self.role_entries_name[role] + " ")

    def on_at_right_click(self, role):
        # @右键事件处理
        filename_ = ""
        avatar_path = ""
        # self.current_at_role.set(role)
        if role == "chatlog":
            role = "KP"
        self.avatar_click_event = role
        current_role = self.current_role.get()
        options = ["【背景】", "【背景】纯黑", "【BGM】", "【停止BGM】", "【音效】", "【展示图片】", "【撤除图片】", "【特效】震动", "【特效】闪屏", "【高级特效】开始",
                   "【高级特效】结束", "【改变名字】[+(之后出场角色被改成的名字, 留空为恢复)]", "【对话框特效】震动", "【隐藏/显示对话框】",
                   f"【开始角色特效】({self.role_entries_name[role]})", "【结束角色特效(连续和剪影)】", "【更换对话框样式】[+(对话框样式名, 留空为撤除样式)]",
                   "【等待】[+(秒数)]", "【角色退场】[+(角色名, 留空为清退)]"]
        # content_ = simpledialog.askstring("Select Option", "请选择下拉项：", initialvalue=options[0], options=options)
        # 创建新的顶级窗口
        self.top_ask = tk.Toplevel(root)
        # 设置窗口标题
        self.top_ask.title("选择活字命令")
        # 创建下拉菜单
        var = tk.StringVar()
        var.set(options[0])  # 默认选择第一个选项
        dropdown = tk.OptionMenu(self.top_ask, var, *options)
        dropdown.pack(padx=10, pady=10)
        confirm_button = tk.Button(self.top_ask, text="确认", command=lambda: self.confirm_selection(var, role))
        confirm_button.pack(pady=10)

    def create_dropdown(self, role, options, title):
        self.avatar_click_event = role
        current_role = self.current_role.get()
        # 创建新的顶级窗口
        self.top_ask2 = tk.Toplevel(root)
        # 设置窗口标题
        self.top_ask2.title(title)
        # 创建下拉菜单
        var = tk.StringVar()
        var.set(options[0])  # 默认选择第一个选项
        dropdown2 = tk.OptionMenu(self.top_ask2, var, *options)
        dropdown2.pack(padx=20, pady=10)
        confirm_button2 = tk.Button(self.top_ask2, text="确认", command=lambda: self.confirm_selection2(var))
        confirm_button2.pack(pady=10)

        # 让程序等待窗口被关闭
        self.top_ask2.wait_window()
        # return str(var)

    def confirm_selection2(self, var):
        self.top_ask2.destroy()  # 销毁窗口
        self.content_ = var.get()

    def confirm_selection(self, var, role):
        self.top_ask.destroy()  # 销毁窗口
        content_ = var.get()

        if (content_ == "【背景】") or ("【BGM】" in content_) or ("音效" in content_) or ("【展示图片】" in content_):
            if "背景" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【背景】图片文件名",
                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg")],
                    initialdir="ReplayResources/BG")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    content = f"【背景】{filename_}"
                    self.display_image(avatar_path, "背景图")
                    if os.path.exists(
                            'ReplayResources/BG/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/BG/' + filename_ + dotextension)
                else:
                    return
            elif "音效" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【音效】音频文件名",
                    filetypes=[("Audio files", "*.mp3;*.wav;*.ogg")],
                    initialdir="ReplayResources/SE")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    play_audio(avatar_path, filename_, 0)
                    content = f"【音效】{filename_}"

                    if os.path.exists(
                            'ReplayResources/SE/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/SE/' + filename_ + dotextension)
                else:
                    return
            elif "BGM" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【BGM】音频文件名",
                    filetypes=[("Audio files", "*.mp3;*.wav;*.ogg")],
                    initialdir="ReplayResources/BGM")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    self.NowBGM.append(filename_)
                    play_audio(avatar_path, filename_)
                    content = f"【BGM】{filename_}"
                    if os.path.exists(
                            'ReplayResources/BGM/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/BGM/' + filename_ + dotextension)
                else:
                    return
            else:
                avatar_path = filedialog.askopenfilename(
                    title="选择【展示图片】图片文件名",
                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg")],
                    initialdir="ReplayResources/HandOut")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    if os.path.exists(
                            'ReplayResources/HandOut/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/HandOut/' + filename_ + dotextension)
                    self.NowImage.append(filename_)
                    content = f"【展示图片】{filename_}"
                    self.display_image(avatar_path, "HandOut", filename_)
                    content_ = simpledialog.askstring("展示秒数(0为忽略)", "请输入展示秒数(0或不输入为忽略)：")
                    if content_ == "" or content_ == "0":
                        pass
                    else:
                        content = content + "\n【等待】" + content_ + f"\n【撤除图片】{self.NowImage.pop()}"
                else:
                    return
        elif "隐藏/显示对话框" in content_:
            if self.NowDialogState:
                content = "【隐藏对话框】隐藏"
                content_ = simpledialog.askstring("隐藏秒数(0为忽略)", "请输入隐藏秒数(0或不输入为忽略)：")
                if content_ == "" or content_ == "0":
                    self.NowDialogState = False
                else:
                    content = content + "\n【等待】" + content_ + f"\n【隐藏对话框】显示"
                    self.NowDialogState = True
            else:
                content = "【隐藏对话框】显示"
                self.NowDialogState = True
        elif "恢复名字" in content_:
            content = "【改变名字】"

        elif "停止BGM" in content_:
            if len(self.NowBGM) > 1:
                self.create_dropdown(role, self.NowBGM, "请选择要停止的BGM：")
                content_ = self.content_
                if content_:
                    if content_ == "全部":
                        content = f"【停止BGM】"
                        for name in self.NowBGM:
                            if name != "全部":
                                kill_audio(name)
                        self.NowBGM.clear()
                        self.NowBGM.append("全部")
                    else:
                        kill_audio(content_)
                        content = f"【停止BGM】{content_}"
                        self.NowBGM.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的BGM！")
                messagebox.showwarning("警告", "没有使用中的BGM！")
                content = f"【停止BGM】[+(BGM名称)]"

        elif "撤除图片" in content_:
            if self.NowImage:
                self.create_dropdown(role, self.NowImage, "请选择要撤除的图片：")
                content_ = self.content_
                if content_:
                    content = f"【撤除图片】{content_}"
                    self.NowImage.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的图片！")
                messagebox.showwarning("警告", "没有使用中的图片！")
                content = f"【撤除图片】[+(HandOut名称)]"
        elif "【高级特效】开始" in content_:
            _list = ["[自定义...]", "---环境---", "下雨", "下雪", "暴风雪", "大雾", "水下", "---设备---", "监控录像", "胶卷", "黑白电视", "彩色电视",
                     "黑白电影",
                     "---故障---", "轻微故障", "中等故障", "严重故障", "---漫画---", "黑色集中线", "白色集中线", "---事件---", "幻觉", "血迹", "直面古神"]
            self.create_dropdown(role, _list, "请选择要使用的高级特效：")
            content_ = self.content_
            if content_:
                if content_ == "[自定义...]":
                    avatar_path = filedialog.askopenfilename(
                        title="选择【特效】图片文件名",
                        filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.gif;*.apng")],
                        initialdir="ReplayResources/FX")
                    if avatar_path:
                        filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                        if os.path.exists(
                                'ReplayResources/FX/' + filename_ + dotextension):
                            pass
                        else:
                            shutil.copyfile(avatar_path,
                                            'ReplayResources/FX/' + filename_ + dotextension)
                        content_ = filename_
                        self.display_FX(avatar_path, filename_)
                else:
                    pass
                content = f"【高级特效】开始{content_}"
                self.NowEffect.append(content_)
            else:
                return
        elif "【高级特效】结束" in content_:
            if self.NowEffect:
                self.create_dropdown(role, self.NowEffect, "请选择要结束的高级特效：")
                content_ = self.content_
                if content_:
                    content = f"【高级特效】结束{content_}"
                    self.NowEffect.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的高级特效！")
                messagebox.showwarning("警告", "没有使用中的高级特效！")
                content = f"【高级特效】结束[+(特效名)]"
        elif "开始角色特效" in content_:
            _list = [f"({self.role_entries_name[role]})震动",
                     f"({self.role_entries_name[role]})左右震动",
                     f"({self.role_entries_name[role]})连续震动",
                     f"({self.role_entries_name[role]})剪影",
                     f"({self.role_entries_name[role]})转圈",
                     f"({self.role_entries_name[role]})连续转圈",
                     f"({self.role_entries_name[role]})跳动",
                     f"({self.role_entries_name[role]})下沉"]
            self.create_dropdown(role, _list, "请选择要进行的角色特效：")
            content_ = self.content_
            if ("连续" in content_) or ("剪影" in content_):
                self.NowCharacterEffect.append(content_)
            content = f"【角色特效】" + content_
        elif "结束角色特效" in content_:
            if self.NowCharacterEffect:
                self.create_dropdown(role, self.NowCharacterEffect, "请选择要结束的角色特效：")
                content_ = self.content_
                if content_:
                    content = f"【角色特效】" + content_.replace("连续", "结束").replace("剪影", "结束剪影")
                    self.NowCharacterEffect.remove(content_)
                else:
                    return
            else:
                content = f"【角色特效】([+(角色名)])结束[+(震动/转圈/剪影)]"
                # print("没有使用中的角色特效！")
                messagebox.showwarning("警告", "没有使用中的角色特效！")
        elif "角色退场" in content_:
            content = "【角色退场】"
        else:
            content = content_

        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end

        # 发布到LOG
        self.chat_log.insert(tk.END,
                             f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
        self.chat_log.yview(tk.END)

    def on_avatar_right_click(self, role):
        # Icon、Avatar右击事件处理
        avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择[会附加到头像上的]状态Icon文件",
                                                 filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                 initialdir="Images/IconImages")
        if avatar_path:
            if os.path.exists('Images/IconImages/' + role + '-' + self.role_entries_name[role] + '.png'):
                pass
            else:
                shutil.copyfile(avatar_path,
                                'Images/IconImages/' + role + '-' + self.role_entries_name[role] + '.png')

            # 更新头像路径
            self.role_Icon_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_icon_on_avatar(role, frame)
            self.load_and_display_icon(role, frame)
        else:
            self.role_Icon_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_icon_on_avatar(role, frame)
            self.load_and_display_icon(role, frame)

    def on_avatar_click(self, role):
        # 头像点击事件处理
        # self.current_at_role.set(role)
        self.avatar_click_event = role
        current_role = self.current_role.get()
        # self.role_entries[current_role].insert(tk.END, "@" + self.role_entries_name[role] + " ")
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            filename = filedialog.askopenfilename(title="为【" + name_ + "】选择简卡图片",
                                                  filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                  initialdir="Images/SheetImages")
        else:
            filename = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择简卡图片",
                                                  filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                  initialdir="Images/SheetImages")
        _, extension = os.path.splitext(filename)
        filename_, dot = os.path.splitext(os.path.basename(filename))
        if extension == ".apng" or extension == ".APNG":
            filename = self.apng_to_gif(filename, _ + ".gif")
        if filename:
            if "NPC_name" in role:
                pass
            else:
                if os.path.exists(
                        'Images/SheetImages/' + role + '-' + self.role_entries_name[
                            role] + "-" + filename_ + extension):
                    pass
                else:
                    if os.path.exists('Images/SheetImages/' + filename_ + extension):
                        pass
                    else:
                        shutil.copyfile(filename,
                                        'Images/SheetImages/' + role + '-' + self.role_entries_name[
                                            role] + '-' + filename_ + extension)
                        shutil.copyfile(filename,
                                        'Images/SheetImages/' + filename_ + extension)
                if "PL " not in self.role_entries_name[role]:
                    self.infoCanvas_data_by_name[self.role_entries_name[role]] = filename
            self.filename = filename
            self.infoCanvas_data[role] = filename

    def on_Namelabel_hover(self, role):
        # print("enter"+role)
        # 头像悬停事件处理
        if role in self.infoCanvas_data and self.infoCanvas_data[role]:
            self.new_window_infoCanvas = tk.Toplevel(root)
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                self.new_window_infoCanvas.title(f"NPC - {name_}的简图")
            else:
                self.new_window_infoCanvas.title(f"{role} - {self.role_entries_name[role]}的简图")
            self.avatar_click_event = role
            current_role = self.current_role.get()

            # 创建图片对象
            self.infoimage = Image.open(self.infoCanvas_data[role])
            width, height = self.infoimage.size
            canvas_h = int(height / 2.2)
            canvas_w = int(width / 2.2)
            self.infoimage = self.infoimage.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
            # self.infoimage.thumbnail((width, height))
            self.infophoto = ImageTk.PhotoImage(self.infoimage)

            self.infocanvas = tk.Canvas(self.new_window_infoCanvas, width=canvas_w + 5, height=canvas_h + 5)
            self.infocanvas.pack()
            # 在 Canvas 上展示图片
            self.infocanvas.create_image(canvas_w / 2 + 5, canvas_h / 2 + 5, image=self.infophoto, tags="image")

    def on_Namelabel_unfocus(self, role):
        # print("leave" + role)
        # 头像离开悬停事件处理
        self.avatar_click_event = role
        current_role = self.current_role.get()
        self.new_window_infoCanvas.destroy()

    def output_chat_log(self):
        global log_file_last_name
        for role in self.codename_by_name:
            if role != "_status":
                if self.codename_by_name[role] == self.role_entries_name[role]:
                    self.codename_by_name["_status"] = False
                else:
                    self.codename_by_name["_status"] = True
        new_text = simpledialog.askstring("选择输出格式", "请输入输出格式(QQ/活字/回声):", initialvalue="QQ")
        if new_text:
            name_text = simpledialog.askstring("输入文件名称", "请输入LOG保存名称(可留空):", initialvalue=log_file_last_name)
            log_file_last_name = name_text
            # 搜索包含 "===以上可删除===" 的行的起始索引
            start_index = "1.0"
            match_index = self.chat_log.search("===以上可删除===", start_index, tk.END)
            if match_index:
                while True:
                    match_index = self.chat_log.search("===以上可删除===", start_index, tk.END)
                    if not match_index:
                        break
                    # 删除之前的所有行
                    # line_start = self.chat_log.index(match_index)
                    line_end = self.chat_log.index(match_index + " lineend")
                    self.chat_log.delete("1.0", line_end)
                    self.chat_log.delete("1.0", "3.0")
                    # 更新搜索的起始位置
                    start_index = line_end
                # self.chat_log.delete("0.0", "2.0")
            if new_text == "QQ":
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(QQ)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)

            elif new_text == "活字":
                if str(self.codename_by_name["_status"]) == "True":
                    self.codename_by_name["_status"] = simpledialog.askstring("是否开启替换", "是否开启CodeName替换?(True/False):",
                                                                              initialvalue=f"{self.codename_by_name['_status']}")
                chat_log_content_ = ""
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(活字)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                chat_log_content = chat_log_content.replace("\n\n\n", "\n\n")

                # pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n(.*?)\n\n'
                pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\n\n'
                # pattern =  r'[\u4e00-\u9fa5a-zA-Z0-9\s`~!@#$%^&*()\-_+={}\[\]|;:\'",<.>/?·！￥……（）—【】、；：‘“’”《》，。？]*\d{1,2}\/\d{1,2}\/\d{2,4}\s\d{1,2}:\d{1,2}:\d{1,2}'
                matches = re.findall(pattern, chat_log_content)
                # 输出转换后的格式
                for match in matches:
                    name = match[0]
                    timestamp = match[1]
                    content = match[2]
                    # print(name)
                    # print(timestamp)
                    # print(content)
                    chat_log_content_ = chat_log_content_ + f"<{name}>{content}\n"
                chat_log_content = chat_log_content_
                # for m in matches:
                # regex_pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s`~!@#$%^&*()\-_+={}\[\]|;:\'",<.>/?·！￥……（）—【】、；：‘“’”《》，。？]*)(\d{1,2}\/\d{1,2}\/\d{2,4}\s\d{1,2}:\d{1,2}:\d{1,2})'
                # match = re.search(regex_pattern, m)
                # if match:
                # 获取捕获组的内容
                # name = match.group(1)  # 括号内第一个捕获组的内容
                # date_time = match.group(2)  # 括号内第二个捕获组的内容
                # chat_log_content = chat_log_content.replace(m,f"<{name}>")
                chat_log_content = chat_log_content.replace("<活字命令>", "")
                chat_log_content = chat_log_content.replace("【差分】", "【请编辑差分】")
                chat_log_content = chat_log_content.replace("<【骰子】>", "【骰子】")
                # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
                # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
                chat_log_content = chat_log_content.replace(";\n", ";")
                # chat_log_content = chat_log_content.replace("\n【骰子】", ";")
                # 使用正则表达式匹配掷骰结果
                # matches = re.findall(r'(\【.*?\】掷骰(?:\{.*?\})?)\d+D\d+=\d+(?:/\d+)?', text)
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    if line and line[0] == "【" and "【骰子】" in line:
                        content = line.replace("【骰子】", "")
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                # 联合检定处理 (【沃姆】掷骰{潜行+意志})1D100=24/[21, 70]:失败/困难成功
                                if "+" in r and ":" in expression and ", " in expression:
                                    comment = expression.split(":")[1]
                                    comment = comment.split("/")
                                    expression_ = expression.split(":")[0].split("/[")[0]
                                    number = expression.split(":")[0].split("/[")[1].replace("]", "").split(", ")
                                    k = 0
                                    combine_list = []
                                    for n in number:
                                        combine_ = "(" + r + ")" + "[" + comment[k] + "]" + expression_ + "/" + n
                                        combine_list.append(combine_)
                                        k += 1
                                    content = ";".join(combine_list)
                                    lines[i] = "【骰子】" + content
                chat_log_content = "\n".join(lines)
                matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                while matches:
                    # print(matches)
                    chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;', chat_log_content)
                    matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)

                # chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;\2', chat_log_content)
                # chat_log_content = re.sub(r'(\【骰子\】).*\n\1', r'\1', chat_log_content)
                # 对连续出现的掷骰结果进行合并
                # merged_text = "；".join(matches)
                # 将无说话人的行变更为上一个说话人
                matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)
                while matches:
                    # matches_lastline = re.findall(r'^(?![【<])[^\\n]*$(?<=<([^>]*)>)', chat_log_content, re.MULTILINE)
                    # chat_log_content = re.sub(r'^(?![【<])[^\\n]*$', "<"+matches_lastline + ">" + r'\1', chat_log_content)
                    # 将文本按行拆分成列表
                    lines = chat_log_content.split('\n')
                    # 用于存放行号的列表
                    # line_numbers = []
                    # 遍历每一行，并查找开头不是 "【" 或 "<" 的行
                    for i, line in enumerate(lines):
                        if "【天气】" in line and "【日期】" in line:
                            lines[i] = "<时空广播>" + lines[i]
                        if not re.match(r'^[【<]', line):
                            if line == "":
                                lines.pop(i)
                                break
                            else:
                                # line_numbers.append(i + 1)  # 行号从1开始
                                j = 0
                                for k, l in enumerate(lines):
                                    last_line = re.findall(r'<([^>]*)>', lines[i - 1 - j], re.MULTILINE)
                                    if last_line:
                                        lines[i] = f"<{last_line[0]}>{lines[i]}"
                                        break
                                    elif i - 1 - j < 0:
                                        # print("输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        messagebox.showerror("错误！", "输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        lines = []
                                        matches = []
                                        return
                                    j += 1
                    # chat_log_content = chat_log_content.replace("","")
                    chat_log_content = "\n".join(lines)
                    matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)

                # 高亮文字效果
                chat_log_content = chat_log_content.replace("<【多轮掷骰】>", "【骰子】")
                lines = chat_log_content.split('\n')
                global style_highlight_style
                global style_highlight_weak_style
                global style_highlight_weak_style2
                global style_dice_reason_color
                global style_dice_pcname_color
                global style_dice_skillname_style
                for index, line in enumerate(lines):
                    if (line[0] == "<") and (("【" in line) or ("（" in line) or ("(" in line) or ("[" in line)):
                        name = re.findall(r'<([^>]*)>', line, re.MULTILINE)
                        if name:
                            title = re.findall(r'【([^】]*)】', name[0])
                            if title:
                                name[0] = name[0].replace(f"【{title[0]}】", f"{title[0]}_")
                                line = line.replace(f"【{title[0]}】", f"{title[0]}_")
                            if "【【" in line:
                                title = re.findall(r'【【([^】]*)】', line)
                                line = line.replace(f"【{title[0]}】", f"{title[0]}")
                            content = line.replace(f"<{name[0]}>", "").replace("【【【", "【【").replace("】】】",
                                                                                                    "】】").replace(
                                "【【", "<color=#FF0000><b><抖动>").replace("】】", "</抖动></b></color>").replace("（",
                                                                                                           "<color=#FFFFFF70>（").replace(
                                "）", "）</color>").replace("(", "<color=#FFFFFF70>(").replace(")", ")</color>").replace(
                                "【",
                                style_highlight_style[
                                    0]).replace(
                                "】", style_highlight_style[1]).replace("[", style_highlight_weak_style[0]).replace("]",
                                                                                                                   style_highlight_weak_style[
                                                                                                                       1]).replace(
                                "@", f"{style_highlight_weak_style2[0]}@{style_highlight_weak_style2[1]}")
                            lines[index] = f"<{name[0]}>{content}"
                    if (line[0] == "【") and ("【骰子】" in line):
                        # 把两个=简化成一个
                        content = line.replace("【骰子】", "")
                        content = re.sub(r'=([^;=]+)=', '=', content)
                        content = content.replace("因【", style_dice_reason_color).replace("【", style_dice_pcname_color[
                            0]).replace("】", style_dice_pcname_color[1]).replace("{",
                                                                                 style_dice_skillname_style[0]).replace(
                            "}",
                            style_dice_skillname_style[
                                1])  # .replace(")", "</color>").replace("）", "</color>").replace("（", "<color=#FFFFFF70>").replace("(", "<color=#FFFFFF70>")
                        # 将理由中的“D”替换为“🎲”
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                if "D" in r or "d" in r:
                                    reason_ = r
                                    reason_ = reason_.replace("D", "◈").replace("d", "◈")
                                    content = content.replace(r, reason_)
                        lines[index] = f"【骰子】{content}"
                chat_log_content = "\n".join(lines)
                # 替换codename
                if str(self.codename_by_name["_status"]) == "True":
                    for role in self.codename_by_name:
                        if role != "_status":
                            if "【" in self.codename_by_name[role]:
                                self.codename_by_name[role] = self.codename_by_name[role].replace("【", "").replace("】",
                                                                                                                   "_")
                            chat_log_content = chat_log_content.replace(f"<{self.role_entries_name[role]}>",
                                                                        f"<{self.codename_by_name[role]}>")

            elif new_text == "回声":
                global EnterCharacters
                if str(self.codename_by_name["_status"]) == "True":
                    self.codename_by_name["_status"] = simpledialog.askstring("是否开启替换", "是否开启CodeName替换?(True/False):",
                                                                              initialvalue=f"{self.codename_by_name['_status']}")
                EnterCharacters = int(simpledialog.askstring("是否开启自动换行", "自动换行字数(0为不换行):",
                                                             initialvalue="30"))
                chat_log_content_ = ""
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(回声)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                chat_log_content = chat_log_content.replace("\n\n\n", "\n\n")
                pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\n\n'
                matches = re.findall(pattern, chat_log_content)
                # 输出转换后的格式
                for match in matches:
                    name = match[0]
                    content = match[2]
                    chat_log_content_ = chat_log_content_ + f"<{name}>{content}\n"
                chat_log_content = chat_log_content_
                # 获取捕获组的内容
                chat_log_content = chat_log_content.replace("<活字命令>", "")
                chat_log_content = chat_log_content.replace("【差分】", "【请编辑差分：格式：[说话人.差分]】")
                chat_log_content = chat_log_content.replace("<【骰子】>", "【骰子】")
                # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
                # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
                chat_log_content = chat_log_content.replace(";\n", ";")
                # 使用正则表达式匹配掷骰结果
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    if line and line[0] == "【" and "【骰子】" in line:
                        content = line.replace("【骰子】", "")
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                # 联合检定处理 (【沃姆】掷骰{潜行+意志})1D100=24/[21, 70]:失败/困难成功
                                if "+" in r and ":" in expression and ", " in expression:
                                    comment = expression.split(":")[1]
                                    comment = comment.split("/")
                                    expression_ = expression.split(":")[0].split("/[")[0]
                                    number = expression.split(":")[0].split("/[")[1].replace("]", "").split(", ")
                                    k = 0
                                    combine_list = []
                                    for n in number:
                                        combine_ = "(" + r + ")" + "[" + comment[k] + "]" + expression_ + "/" + n
                                        combine_list.append(combine_)
                                        k += 1
                                    content = ";".join(combine_list)
                                    lines[i] = "【骰子】" + content
                chat_log_content = "\n".join(lines)
                matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                while matches:
                    # print(matches)
                    chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;', chat_log_content)
                    matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                # 对连续出现的掷骰结果进行合并
                # 将无说话人的行变更为上一个说话人
                matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)
                while matches:
                    # 将文本按行拆分成列表
                    lines = chat_log_content.split('\n')
                    # 用于存放行号的列表
                    # 遍历每一行，并查找开头不是 "【" 或 "<" 的行
                    for i, line in enumerate(lines):
                        if "【天气】" in line and "【日期】" in line:
                            lines[i] = "<时空广播>" + lines[i]
                        if not re.match(r'^[【<]', line):
                            if line == "":
                                lines.pop(i)
                                break
                            else:
                                j = 0
                                for k, l in enumerate(lines):
                                    last_line = re.findall(r'<([^>]*)>', lines[i - 1 - j], re.MULTILINE)
                                    if last_line:
                                        lines[i] = f"<{last_line[0]}>{lines[i]}"
                                        break
                                    elif i - 1 - j < 0:
                                        # print("输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        messagebox.showerror("错误！", "输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        return
                                    j += 1
                    chat_log_content = "\n".join(lines)
                    matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)

                # 高亮文字效果
                chat_log_content = chat_log_content.replace("<【多轮掷骰】>", "【骰子】")
                lines = chat_log_content.split('\n')
                global style_shock_echo
                global style_weaken_echo
                global style_highlight_style_echo
                global style_highlight_weak_style_echo
                global style_highlight_weak_style2_echo
                global style_dice_reason_color_echo
                global style_dice_pcname_color_echo
                global style_dice_skillname_style_echo
                global style_dice_icon
                for index, line in enumerate(lines):

                    if (line[0] == "<") and (("【" in line) or ("（" in line) or ("(" in line) or ("[" in line)):
                        name = re.findall(r'<([^>]*)>', line, re.MULTILINE)
                        title = re.findall(r'【([^】]*)】', name[0])
                        if title:
                            name[0] = name[0].replace(f"【{title[0]}】", f"{title[0]}_")
                            line = line.replace(f"【{title[0]}】", f"{title[0]}_")
                        if "【【" in line:
                            title = re.findall(r'【【([^】]*)】', line)
                            line = line.replace(f"【{title[0]}】", f"{title[0]}")
                        if name:
                            content = line.replace(f"<{name[0]}>", "").replace("[", style_highlight_weak_style2_echo[
                                0]).replace("]", style_highlight_weak_style2_echo[1]).replace("【【【", "【【").replace(
                                "】】】", "】】").replace(
                                "【【", style_shock_echo[0]).replace("】】", style_shock_echo[1]).replace("（",
                                                                                                      f"{style_weaken_echo[0]}（").replace(
                                "）", f"）{style_weaken_echo[1]}").replace("(", f"{style_weaken_echo[0]}(").replace(")",
                                                                                                                  f"){style_weaken_echo[1]}").replace(
                                "【", style_highlight_style_echo[0]).replace(
                                "】", style_highlight_style_echo[1]).replace("@",
                                                                            f"{style_highlight_weak_style2_echo[0]}@{style_highlight_weak_style2_echo[1]}")
                            lines[index] = f"[{name[0].replace('【', '').replace('】', '_')}]:{content}"
                    if (line[0] == "【") and ("【骰子】" in line):
                        # 把两个=简化成一个
                        content = line.replace("【骰子】", "")
                        if "SAN CHECK" in content:
                            sc_result = re.findall(r'=([^=]*)=', content, re.MULTILINE)
                            content = re.sub(r'=([^;=]+)=', '=', content)
                            if sc_result:
                                content = re.sub(r'=([^;=]+);?', "=" + sc_result[0], content)
                        else:
                            content = re.sub(r'=([^;=]+)=', '=', content)
                        content = content.replace("因【", style_dice_reason_color_echo).replace("【",
                                                                                              style_dice_pcname_color_echo[
                                                                                                  0]).replace("】",
                                                                                                              style_dice_pcname_color_echo[
                                                                                                                  1]).replace(
                            "{",
                            style_dice_skillname_style_echo[0]).replace("}", style_dice_skillname_style_echo[
                            1])  # .replace(")", "</color>").replace("）", "</color>").replace("（", "<color=#FFFFFF70>").replace("(", "<color=#FFFFFF70>")
                        # 分解骰子语句格式：(理由)[结果]公式=投出值/鉴定值;(理由)[结果]公式=投出值;(理由)公式=投出值 → 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                        content_parse = content.replace(style_dice_reason_color_echo, "→因").replace(
                            style_dice_skillname_style_echo[0], style_dice_icon[2] + "{").replace(
                            style_dice_skillname_style_echo[1], "}").replace(
                            style_dice_pcname_color_echo[0], "").replace(style_dice_pcname_color_echo[1], "")
                        if ";" in content_parse:
                            # 多个合并骰子
                            exp_ = []
                            EchoDice_ = []
                            dicelines = content_parse.split(';')
                            for dice in dicelines:
                                if "(" in dice:
                                    reason = re.findall(r'\(([^)]*)\)', dice, re.MULTILINE)[0]
                                else:
                                    reason = " "
                                if "{" in reason:
                                    skillname = re.findall(r'\{([^}]*)}', reason, re.MULTILINE)[0]
                                else:
                                    skillname = " "
                                result = dice.split('=')[1]
                                if "/" in result:
                                    result = result.split('/')[0]
                                else:
                                    pass
                                comment = re.findall(r'\[(.*?)\]', dice, re.MULTILINE)
                                if comment:
                                    expression = re.findall(r']([^=]*)=', dice, re.MULTILINE)
                                else:
                                    expression = re.findall(r'\)([^=]*)=', dice, re.MULTILINE)
                                    comment = [" "]
                                exp_number = str(eval(expression[0].replace("D", "*")))
                                if "/" in dice.split('=')[1]:
                                    objective = dice.split('=')[1].split('/')[1]
                                else:
                                    objective = exp_number
                                # print(reason[0] + "\n" + expression[0] + "\n" + comment[0] + "\n" + result + "\n" + objective + skillname)
                                dicebot_name = self.role_entries_name["DiceBot"]
                                exp_.append(
                                    f"<table:{dicebot_name}.Reason>:{reason}\n<table:{dicebot_name}.Expression>:{expression[0]}\n<table:{dicebot_name}.Comment>:{comment[0]}\n<table:{dicebot_name}.Result>:{result}\n<table:{dicebot_name}.Objective>:{objective}\n<table:{dicebot_name}.Skillname>:{skillname}\n")
                                # 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                                EchoDice_.append(f"({reason},{exp_number},{objective},{result})")
                            # exp = f"[{self.role_entries_name['DiceBot']}]掷骰中...\n".join(exp_)
                            exp = (f"==={self.role_entries_name['DiceBot']}===:掷骰中..." + "{掷骰}\n").join(exp_)
                            # 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                            EchoDice = "<dice>:" + ",".join(EchoDice_)
                        else:
                            # 单个骰子
                            if "(" in content_parse:
                                reason = re.findall(r'\(([^)]*)\)', content_parse, re.MULTILINE)[0]
                            else:
                                reason = " "
                            if "{" in reason:
                                skillname = re.findall(r'\{([^}]*)}', reason, re.MULTILINE)[0]
                            else:
                                skillname = " "
                            comment = re.findall(r'\[(.*?)\]', content_parse, re.MULTILINE)
                            if comment:
                                expression = re.findall(r']([^=]*)=', content_parse, re.MULTILINE)
                            else:
                                expression = re.findall(r'\)([^=]*)=', content_parse, re.MULTILINE)
                                comment = [" "]
                            exp_number = str(eval(expression[0].replace("D", "*")))
                            result = content_parse.split('=')[1]
                            if "/" in result:
                                result = result.split('/')[0]
                            else:
                                pass
                            if "/" in content_parse.split('=')[1]:
                                objective = content_parse.split('=')[1].split('/')[1]
                            else:
                                objective = exp_number
                            # print(reason + "\n" + expression[0] + "\n" + comment[0] + "\n" + result + "\n" +objective + "\n" + skillname)
                            dicebot_name = self.role_entries_name["DiceBot"]
                            exp = f"<table:{dicebot_name}.Reason>:{reason}\n<table:{dicebot_name}.Expression>:{expression[0]}\n<table:{dicebot_name}.Comment>:{comment[0]}\n<table:{dicebot_name}.Result>:{result}\n<table:{dicebot_name}.Objective>:{objective}\n<table:{dicebot_name}.Skillname>:{skillname}\n"
                            EchoDice = f"<dice>:({reason},{exp_number},{objective},{result})"
                        # lines[index] = exp + f"[dice]:{content.replace(';',',')} + {EchoDice}"
                        lines[
                            index] = exp + f"[{self.role_entries_name['DiceBot']}]:掷骰中..." + "{掷骰}\n" + EchoDice.replace(
                            "{", "").replace("}", "").replace("SAN CHECK", "SC").replace("掷骰", "")
                    if lines[index][0] == "<" and ("<dice>:" not in lines[index]):
                        name = re.findall(r'<([^>]*)>', lines[index], re.MULTILINE)
                        content = lines[index].replace(f"<{name[0]}>", "")
                        lines[index] = f"[{name[0]}]:{content}"
                    if "【停止BGM】" in line:
                        lines[index] = "<BGM>:stop"
                    if "【高级特效】结束" in line or "【撤除图片】" in line:
                        lines[index] = "<animation>:NA"
                    if line == "【更换样式】":
                        lines[index] = "<bubble>:NA"
                    if "【音效】" in line:
                        lines[index - 1] = lines[index - 1] + "{" + line + "}"
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace("【等待】", "<wait>:")
                chat_log_content = chat_log_content.replace("【更换样式】", "<bubble>:")
                chat_log_content = chat_log_content.replace("【背景】", "<background>:")
                chat_log_content = chat_log_content.replace("【背景】纯黑", "<background>:black")
                chat_log_content = chat_log_content.replace("【背景】", "<background>:")
                chat_log_content = chat_log_content.replace("【BGM】", "<BGM>:")
                chat_log_content = chat_log_content.replace("【高级特效】开始", "<animation>:")
                chat_log_content = chat_log_content.replace("【特效】", "<animation>:")
                # 多个说出相同台词的说话人可合并 [a]aaa [b]aaa → [a,b]aaa
                # 多个连续展示图片可合并
                lines = chat_log_content.split('\n')
                # 用于存放行号的列表
                # 遍历每一行，查找开头是 "[" 的行、查找开头是【展示图片】的行
                merged_speak = []
                speak_content = ""
                last_speak_content = ""
                merged_speak_del = []
                for i, line in enumerate(lines):
                    if line[0] == "[":
                        name = re.findall(r'\[([^\]]*)\]', line, re.MULTILINE)
                        # 如果说话人在角色列表，在句尾加语音合成标记"{*}"
                        for PLindex, PLname in self.role_entries_name.items():
                            if "【" in PLname:
                                PLname = PLname.replace("【", "").replace("】", "_")
                            if name[0] == PLname:
                                # 超过设置字数，添加自动换行标记"#",且将句尾标点不置于首位
                                if EnterCharacters > 0:
                                    lines_ = line.replace(f"[{name[0]}]:", "")
                                    lines_len = lines_
                                    deletechars = re.findall(r'\[([^\]]*)\]', lines_, re.MULTILINE)
                                    if deletechars:
                                        for de in deletechars:
                                            lines_len = lines_len.replace(de, "")
                                    lines_result = ""
                                    if len(lines_len) > EnterCharacters:
                                        for a in range(0, len(lines_), EnterCharacters):
                                            chunk = lines_[a:a + EnterCharacters]
                                            if chunk.rstrip().endswith((
                                                    " ", ",", ".", "!", "?", "。", "；", "，", ";", "”",
                                                    "’", "、", "！", "？", "）", ")", "】", "]", "：",
                                                    ":")):
                                                lines_result += chunk + "#"
                                            else:
                                                index = -1
                                                if any(punctuation in lines_ for punctuation in (
                                                        " ", ",", ".", "!", "?", "。", "；", "，", ";", "”", "’", "、", "！",
                                                        "？",
                                                        "）", ")", "】", "]", "：",
                                                        ":")):  # 如果 lines[i] 中包含任何一个标点符号，则执行相应的操作
                                                    for punctuation in (
                                                            " ", ",", ".", "!", "?", "。", "；", "，", ";", "”", "’", "、",
                                                            "！",
                                                            "？", "）", ")", "】", "]", "：", ":"):
                                                        temp_index = chunk.rfind(punctuation)
                                                        if temp_index > index:
                                                            index = temp_index
                                                    if index == -1:  # 如果没有空格，则直接插入
                                                        lines_result += chunk + "#"
                                                    else:
                                                        lines_result += chunk[:index] + chunk[index] + "#" + chunk[
                                                                                                             index + 1:]  # 在最后一个符号之后插入分隔符
                                        lines[i] = f"[{name[0]}]:" + lines_result[:-1]
                                lines[i] = lines[i] + "{*}"

                        last_speak_content = speak_content
                        speak_content = line.replace(f"[{name[0]}]", "")
                        if speak_content != last_speak_content:
                            if len(merged_speak) >= 1:
                                merged_speak.append(re.findall(r'\[([^\]]*)\]:', lines[i], re.MULTILINE)[0])
                                merged_speak.insert(0, merged_speak[len(merged_speak) - 1])
                                merged_speak.pop(len(merged_speak) - 1)
                                merged_speak[len(merged_speak) - 1] = merged_speak[0]
                                startpoint = merged_speak_del[0] - 1
                                for j in merged_speak_del:
                                    lines[j] = "===删除行==="
                                lines[startpoint] = f"[{','.join(merged_speak)}]{last_speak_content}"
                            merged_speak_del.clear()
                            merged_speak.clear()
                        else:
                            merged_speak.append(name[0])
                            merged_speak_del.append(i)
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace(f"==={self.role_entries_name['DiceBot']}===",
                                                            f"[{self.role_entries_name['DiceBot']}]")
                lines = chat_log_content.split('\n')
                merged_showImg = []
                merged_showImg_del = []
                for i, line in enumerate(lines):
                    if "【展示图片】" not in line:
                        if len(merged_showImg) > 1:
                            startpoint = merged_showImg_del.pop(0)
                            for j in merged_showImg_del:
                                lines[j] = "===删除行==="
                            lines[startpoint] = f"【展示图片】({','.join(merged_showImg)})"
                        merged_showImg_del.clear()
                        merged_showImg.clear()
                    else:
                        # 匹配连续多个"【展示图片】"开头的文字内容
                        merged_showImg.append(line.replace("【展示图片】", ""))
                        merged_showImg_del.append(i)
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace("【展示图片】", "<animation>:")

                # 搜索包含 "===删除行===" 的行的起始索引
                start_index = 0
                match_index = chat_log_content.find("===删除行===", start_index)
                if match_index:
                    while True:
                        match_index = chat_log_content.find("===删除行===", start_index)
                        if match_index == -1:
                            break
                        line_start = chat_log_content.rfind("\n", 0, match_index) + 1
                        line_end = chat_log_content.find("\n", match_index)
                        chat_log_content = chat_log_content[:line_start] + chat_log_content[line_end + 1:]
                        # 更新搜索的起始位置
                        start_index = line_start

                # 处理状态变化：【xxx】的状态[已减少1点HP]：11/12:HP → <table:角色.HP>:50/50
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    exp = ""
                    if "的状态[" in line:
                        name = re.findall(r'【([^】]*)】', line, re.MULTILINE)[0]
                        item = re.search(r':([^:]+)$', line)
                        if item:
                            item = item.group(1)
                        value = re.findall(r'：([^:]*):', line, re.MULTILINE)[0]
                        exp = f"<table:{name}.{item}>:{value}"
                    if exp:
                        lines[i] = exp + "\n" + lines[i]
                chat_log_content = "\n".join(lines)
                # 处理时空状态变化：【时间】02:54【地点】多伦多大学【天气】阴【日期】2024/03/01 Friday → <table:时空广播.Time>、.Place .Date .Weather
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):  # 白天☀ 夜晚☆ 上午㏂ 下午㏘ 春♧夏♡秋♤冬♢
                    exp = ""
                    if "【时间】" in line and "【地点】" in line:
                        time_info1 = line.replace("[时空广播]:", "").replace(style_highlight_style_echo[0], "【").replace(
                            style_highlight_style_echo[1], "】")
                        time_info2 = lines[i + 1].replace("[时空广播]:", "").replace(style_highlight_style_echo[0],
                                                                                 "【").replace(
                            style_highlight_style_echo[1], "】")
                        time_info1 = time_info1.split("【时间】")[1]
                        time_info2 = time_info2.split("【天气】")[1]
                        date_ = time_info2.split("【日期】")[1]
                        time_ = time_info1.split("【地点】")[0]
                        place_ = time_info1.split("【地点】")[1]
                        weather_ = time_info2.split("【日期】")[0]
                        exp = f"<table:时空广播.Time>:{time_}\n<table:时空广播.Place>:{place_}\n<table:时空广播.Date>:{date_}\n<table:时空广播.Weather>:{weather_}"
                    if exp:
                        lines[i] = exp + "\n" + lines[i]
                chat_log_content = "\n".join(lines)
                # 替换codename
                if str(self.codename_by_name["_status"]) == "True":
                    for role in self.codename_by_name:
                        if role != "_status":
                            if "【" in self.codename_by_name[role]:
                                self.codename_by_name[role] = self.codename_by_name[role].replace("【", "").replace("】",
                                                                                                                   "_")
                            chat_log_content = chat_log_content.replace(f"[{self.role_entries_name[role]}]:",
                                                                        f"[{self.codename_by_name[role]}]:")

            else:
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(QQ)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
            filename = "【" + name_text + "】" + filename
            try:
                # 尝试写入文件
                with open(filename, "w", encoding='utf-8') as file:
                    file.write(chat_log_content)
            except:
                # 出错则弹出警告
                messagebox.showerror("错误！", "无法输出LOG文件！")
                return

    def output_html_log(self):
        timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
        filename = f"chat_log_{timestamp}.html"
        chat_log_content = self.chat_log.get("1.0", tk.END)
        with open(filename, "w", encoding='utf-8') as file:
            file.write(f'<html><head></head><body>{chat_log_content}</body></html>')

    def choose_Icon(self, role):
        avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择状态Icon文件",
                                                 filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                 initialdir="Images/IconImages")
        if avatar_path:
            _, extension = os.path.splitext(avatar_path)
            filename, dot = os.path.splitext(os.path.basename(avatar_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
            if os.path.exists('Images/IconImages/' + filename + extension):
                pass
            else:
                shutil.copyfile(avatar_path,
                                'Images/IconImages/' + filename + extension)

            # 更新头像路径
            self.role_Icon_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_icon(role, frame)
        else:
            self.role_Icon_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_icon(role, frame)

    def choose_avatar(self, role):
        if role in self.role_dir_path:
            initDir = self.role_dir_path[role]
        else:
            initDir = "Images/AvatarImages"
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            avatar_path = filedialog.askopenfilename(title="为【" + name_ + "】选择头像文件",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir=initDir)
        else:
            avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择头像文件",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir=initDir)
        if avatar_path:
            _, extension = os.path.splitext(avatar_path)
            filename, dot = os.path.splitext(os.path.basename(avatar_path))
            self.role_dir_path[role] = os.path.dirname(avatar_path)
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
            if "NPC_name" in role:
                self.role_avatar_paths[role] = avatar_path
                frame = self.role_entries[role].master
                self.load_and_display_avatar(role, frame)
                return
            if os.path.exists(
                    'Images/AvatarImages/' + role + '-' + self.role_entries_name[role] + '-' + filename + extension):
                pass
            else:
                if os.path.exists('Images/AvatarImages/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/AvatarImages/' + role + '-' + self.role_entries_name[
                                        role] + '-' + filename + extension)
                    shutil.copyfile(avatar_path,
                                    'Images/AvatarImages/' + filename + extension)
            # 发布到LOG
            # 搜索包含 ">>>" 的行的起始索引
            start_index = "1.0"
            while True:
                match_index = self.chat_log.search(">>>", start_index, tk.END)
                if not match_index:
                    break
                # 删除包含 ">>>" 的行
                line_start = self.chat_log.index(match_index)
                line_end = self.chat_log.index(match_index + " lineend")
                self.chat_log.delete(line_start, line_end)
                # 更新搜索的起始位置
                start_index = line_end

            self.chat_log.insert(tk.END,
                                 f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【差分】<{self.role_entries_name[role]}({filename})>\n\n')
            self.chat_log.yview(tk.END)
            # 更新头像路径
            self.role_avatar_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_avatar(role, frame)
        else:
            self.role_avatar_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_avatar(role, frame)
        if self.role_entries_name[role] in role_Chart_at_name:
            role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = self.role_avatar_paths[role]

    def load_and_display_avatar(self, role, frame):
        self.Avatar = ""
        if role in self.role_avatar_paths:
            # 加载头像
            image_path = self.role_avatar_paths[role]
            if image_path:
                if "NPC_name" in role:
                    pass
                else:
                    if self.role_entries_name[role] in role_Chart_at_name:
                        role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = image_path
                image = Image.open(image_path)
                image_temp = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size

                # 根据宽高比设置头像大小
                if math.fabs(width - height) <= 10:
                    image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小
                elif math.fabs(width - height) <= 400:
                    image = image.resize((50, 80), Image.LANCZOS)
                else:
                    image = image.resize((50, 100), Image.LANCZOS)

                tk_image = ImageTk.PhotoImage(image)
                label = tk.Label(frame, image=tk_image)
                label.image = tk_image
                label.grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                # 头像点击事件绑定
                label.bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                frame = self.role_entries[role].master
                label.bind("<Button-3>",
                           lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":

                    # gif = imageio.mimread(image_path)
                    self.Iconcanvas[role] = tk.Canvas(frame, width=20, height=20)
                    self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                    # self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)
                    if math.fabs(width - height) <= 10:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    elif math.fabs(width - height) <= 400:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 80), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    else:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 100), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    # 获取 GIF 图片的所有帧

                    # self.frames_avatar[role] = image_temp
                    # self.frames_avatar[role] = []
                    # for temp_frame in ImageSequence.Iterator(image_temp):
                    # 转换为 RGBA 模式并添加到列表中
                    # frame_rgba = temp_frame.convert("RGBA")
                    # frame_rgba = ImageTk.PhotoImage(frame_rgba)
                    # self.frames_avatar[role].append(frame_rgba)

                    # 显示 GIF 图片的第一帧
                    self.current_frame_avatar[role] = self.Iconcanvas[role].create_image(0, 0, anchor=tk.NW,
                                                                                         image=self.frames_avatar[role][
                                                                                             0])
                    # 播放 GIF 动画
                    self.animate(0, self.Iconcanvas[role], self.current_frame_avatar[role], self.frames_avatar[role])

                    self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                    self.Iconcanvas[role].bind("<Button-3>",
                                               lambda event, role=role, frame=frame: self.hide_icon_on_avatar(
                                                   role, frame))

                    self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                else:
                    self.Iconcanvas[role] = tk.Canvas(frame, width=20, height=20)
                    self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")
                    self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)

                    self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                    self.Iconcanvas[role].bind("<Button-3>",
                                               lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role,
                                                                                                              frame))

                    self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

            else:
                if self.Avatar:
                    self.Iconcanvas[role].delete(self.Avatar)
                self.Iconcanvas[role] = tk.Canvas(frame, width=0, height=0)
                self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                self.Iconcanvas[role].bind("<Button-3>",
                                           lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                label = tk.Label(frame)
                label.grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                label.bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                label.bind("<Button-3>", lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

    def hide_icon_on_avatar(self, role, frame):
        if role in self.Icon_on_avatar:
            self.Iconcanvas[role].delete(self.Icon_on_avatar.pop(role))
            if self.current_frame_icon_on_canvas[role]:
                self.Iconcanvas[role].delete(self.current_frame_icon_on_canvas[role])
            # self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
        else:
            # self.Icon_on_avatar[role] = ""
            self.load_and_display_icon_on_avatar(role, frame)
            _path = self.role_Icon_paths[role]
            filename, dot = os.path.splitext(os.path.basename(_path))
            self.role_entries[role].insert(tk.END, f"[{filename}]")

    def load_and_display_icon_on_avatar(self, role, frame):
        if role not in self.Icon_on_avatar:
            self.Icon_on_avatar[role] = ""
        else:
            print("delete load_and_display_icon_on_avatar")
            self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
        if role in self.role_Icon_paths:
            # 加载头像
            image_path = self.role_Icon_paths[role]
            if image_path:
                image = Image.open(image_path)
                image_temp = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size
                # 根据宽高比设置头像大小
                if math.fabs(width - height) <= 10:
                    image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小
                elif math.fabs(width - height) <= 400:
                    image = image.resize((50, 80), Image.LANCZOS)
                else:
                    image = image.resize((50, 100), Image.LANCZOS)

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":

                    # self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)
                    if math.fabs(width - height) <= 10:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    elif math.fabs(width - height) <= 400:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 80), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    else:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 100), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    # 显示 GIF 图片的第一帧
                    self.current_frame_icon_on_canvas[role] = self.Iconcanvas[role].create_image(0, 0, anchor=tk.NW,
                                                                                                 image=
                                                                                                 self.frames_icon_on_canvas[
                                                                                                     role][
                                                                                                     0])
                    # 播放 GIF 动画
                    self.animate(0, self.Iconcanvas[role], self.current_frame_icon_on_canvas[role],
                                 self.frames_icon_on_canvas[role])
                else:
                    if self.current_frame_icon_on_canvas[role]:
                        self.Iconcanvas[role].delete(self.current_frame_icon_on_canvas[role])
                    tk_image = ImageTk.PhotoImage(image)
                    # self.Iconcanvas.create_rectangle(0, 0, 30, 30, fill="red")
                    if math.fabs(width - height) <= 10:
                        self.Icon_on_avatar[role] = self.Iconcanvas[role].create_image(20, 20, image=tk_image)
                    else:
                        self.Icon_on_avatar[role] = self.Iconcanvas[role].create_image(30, 40, image=tk_image)
                    self.image_references_on_Avatar[role].append(tk_image)

                    # elif math.fabs(width - height) <= 100:
                    # image = image.resize((20, 30), Image.LANCZOS)
                    # else:
                    # image = image.resize((10, 30), Image.LANCZOS)

                    # label3 = tk.Label(frame, image=tk_image, background = "white")
                    # label3.image = tk_image

                    # hwnd = self.Iconcanvas.winfo_id()
                    # colorkey = win32api.RGB(255, 255, 255)  # full black in COLORREF structure
                    # wnd_exstyle = win32gui.GetWindowLong(hwnd, win32con.GWL_EXSTYLE)
                    # new_exstyle = wnd_exstyle | win32con.WS_EX_LAYERED
                    # win32gui.SetWindowLong(hwnd, win32con.GWL_EXSTYLE, new_exstyle)
                    # win32gui.SetLayeredWindowAttributes(hwnd, colorkey, 255, win32con.LWA_COLORKEY)

            else:
                if self.Icon_on_avatar[role]:
                    self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
                    # self.Iconcanvas[role].delete(self.current_frame_avatar[role])
        else:
            pass

    def autoSave(self):
        timestamp = datetime.now().strftime("%H:%M")
        print(timestamp + ": 已自动保存当前Log")
        self.quickSave()
        root.after(600000, self.autoSave)

    def autoSave_firstTime(self):
        root.after(600000, self.autoSave)
        # timer = threading.Timer(5, autoSave)
        # timer.start()
        print("已启动自动保存，间隔为10分钟")

    def animate(self, frame_index, canvas, current_frame, frames):
        # print(str(frame_index)+"/" + str(len(frames)))
        # 更新当前帧
        canvas.itemconfig(current_frame, image=frames[frame_index])
        # canvas.create_image(20, 20, anchor=tk.NW, image=frames[frame_index])
        # 循环播放下一帧
        frame_index = (frame_index + 1) % len(frames)
        self.after_id = canvas.after(50, self.animate, frame_index, canvas, current_frame, frames)

    def load_and_display_icon(self, role, frame):
        # self.Icon = ""
        if role in self.role_Icon_paths:
            # 加载头像
            image_path = self.role_Icon_paths[role]
            if image_path:
                image = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size
                if height != width:
                    image2 = image.resize((50, 30), Image.LANCZOS)
                else:
                    image2 = image.resize((30, 30), Image.LANCZOS)

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":
                    # print("帧数:", image.n_frames)
                    self.canvas_icon_animate[role] = tk.Canvas(frame, width=20, height=20)
                    self.canvas_icon_animate[role].grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    # 获取 GIF 图片的所有帧
                    if height != width:
                        self.frames_icon[role] = [ImageTk.PhotoImage(frame.resize((50, 30), Image.LANCZOS)) for frame in
                                                  ImageSequence.Iterator(image)]
                    else:
                        self.frames_icon[role] = [ImageTk.PhotoImage(frame.resize((30, 30), Image.LANCZOS)) for frame in
                                                  ImageSequence.Iterator(image)]

                    # 显示 GIF 图片的第一帧
                    self.current_frame_icon[role] = self.canvas_icon_animate[role].create_image(0, 0, anchor=tk.NW,
                                                                                                image=
                                                                                                self.frames_icon[role][
                                                                                                    0])
                    # 播放 GIF 动画
                    self.animate(0, self.canvas_icon_animate[role], self.current_frame_icon[role],
                                 self.frames_icon[role])

                    self.canvas_icon_animate[role].bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    self.canvas_icon_animate[role].bind("<Enter>",
                                                        lambda event, role=role: self.on_Namelabel_hover(role))
                    self.canvas_icon_animate[role].bind("<Leave>",
                                                        lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    self.canvas_icon_animate[role].bind("<Button-3>",
                                                        lambda event, role=role, frame=frame: self.hide_icon_on_avatar(
                                                            role, frame))
                elif role in self.canvas_icon_animate:
                    self.canvas_icon_animate[role].destroy()
                    # 根据宽高比设置头像大小
                    # if width >= 100:
                    # image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小

                    # elif math.fabs(width - height) <= 100:
                    # image = image.resize((20, 30), Image.LANCZOS)
                    # else:
                    # image = image.resize((10, 30), Image.LANCZOS)
                    # tk_image = ImageTk.PhotoImage(image)
                    tk_image2 = ImageTk.PhotoImage(image2)
                    label2 = tk.Label(frame, image=tk_image2)
                    label2.image = tk_image2

                    # self.Icon = self.Iconcanvas.create_image(200, 200, image=tk_image)

                    # 头像点击事件绑定
                    label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    label2.bind("<Button-3>",
                                lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                else:
                    tk_image2 = ImageTk.PhotoImage(image2)
                    label2 = tk.Label(frame, image=tk_image2)
                    label2.image = tk_image2

                    # self.Icon = self.Iconcanvas.create_image(200, 200, image=tk_image)

                    # 头像点击事件绑定
                    label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    label2.bind("<Button-3>",
                                lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))

            else:
                if role in self.canvas_icon_animate:
                    self.canvas_icon_animate[role].destroy()
                label2 = tk.Label(frame)
                # if self.Icon:
                # self.Iconcanvas.delete(self.Icon)
                label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                frame = self.role_entries[role].master
                label2.bind("<Button-3>",
                            lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))
        else:
            label2 = tk.Label(frame)
            label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
            label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
            label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
            label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
            frame = self.role_entries[role].master
            label2.bind("<Button-3>",
                        lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
            # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))

    def get_and_roll(self, role):
        global reason_string_list
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end
        if self.role_entries_roll[self.current_role.get()].get("1.0", tk.END).strip() == "":
            text = self.role_entries_roll[role].get("1.0", tk.END).strip()
            self.role_entries_roll[self.current_role.get()].delete("1.0", tk.END)
            self.role_entries_roll[self.current_role.get()].insert(tk.END, text)
            # 回车不换行

        text = self.role_entries_roll[self.current_role.get()].get("1.0", tk.END).strip()
        self.role_entries_roll[self.current_role.get()].delete("1.0", tk.END)
        self.role_entries_roll[self.current_role.get()].insert(tk.END, text)
        current_role = self.current_role.get()
        if role == "DiceBot":
            if current_role != "DiceBot":
                if self.role_entries_roll[current_role].get("1.0", tk.END).strip() != "":
                    # self.role_entries_roll[role].delete("1.0",tk.END)
                    # self.role_entries_roll[role].insert(self.role_entries_roll[current_role].get("1.0", tk.END).strip(),"1.0")
                    self.roll_dice_silent(current_role,
                                          self.role_entries_roll[current_role].get("1.0", tk.END).strip().lower(),
                                          self.role_entries[current_role].get("1.0", tk.END).strip())
                else:
                    self.roll_dice_silent(current_role, self.role_entries_roll[role].get("1.0", tk.END).strip().lower(),
                                          self.role_entries[current_role].get("1.0", tk.END).strip())
            else:
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "":
                    self.roll_dice("全员", self.role_entries_roll[role].get("1.0", tk.END).strip().lower(),
                                   self.role_entries[current_role].get("1.0", tk.END).strip())
                else:
                    self.roll_dice("全员", "1d100", self.role_entries[current_role].get("1.0", tk.END).strip())
        else:
            # 获取相应角色的输入框文本
            enemy_matches = None
            reason = self.role_entries[role].get("1.0", tk.END).strip()
            reason = reason.replace(self.trpg_module.Critical_Success, "")
            reason = reason.replace(self.trpg_module.Extreme_Success, "")
            reason = reason.replace(self.trpg_module.Success, "")
            reason = reason.replace(self.trpg_module.Hard_Success, "")
            reason = reason.replace(self.trpg_module.Failure, "")
            reason = reason.replace(self.trpg_module.Fumble, "")
            if "@" in reason:
                print("对抗骰")
                pattern = r"@[\w\s]+"
                enemy_matches = re.findall(pattern, reason)
                enemy_matches = [s.replace("@", "").strip() for s in enemy_matches]
                print(enemy_matches)
                reason = reason.replace("@", "对抗").strip()
                reason = reason.replace(" 对抗", "，对抗")
            if reason == "":
                # 从列表中随机选择一个字符串
                reason = random.choice(reason_string_list)
            role_Chart_detail = role_Chart.get(role, {}).copy()
            expression = self.role_entries_roll[role].get("1.0", tk.END).strip().lower()

            if expression == "":
                expression = "1d100"
            if enemy_matches is not None:
                for enemy in enemy_matches:
                    role_ = ""
                    for key, nickname in self.role_entries_name.items():
                        if enemy == nickname:
                            role_ = key
                    expression_ = self.role_entries_roll[role_].get("1.0", tk.END).strip()
                    if expression_ == "" or expression_ == "1d100":
                        self.enemy_matches[enemy] = expression
                    else:
                        # self.enemy_matches[enemy] = expression + self.role_entries_roll[enemy].get("1.0", tk.END).strip()
                        self.enemy_matches[enemy] = self.role_entries_roll[enemy].get("1.0", tk.END).strip()

            for skill in role_Chart_detail:
                if ("r" + skill in reason) or ("ra" + skill in reason) and ("[" not in reason):
                    reason = reason.replace("." + skill, skill)
                    reason = reason.replace("r" + skill, skill)
                    reason = reason.replace("ra" + skill, skill)
                    expression = skill
                    timestamp = datetime.now().strftime("%Y/%m/%d %H:%M:%S")
                    log = f"{self.role_entries_name[role]} {timestamp}\n{reason}\n\n"  # 不加引号
                    self.chat_log.insert(tk.END, log)
                    # 滚动到最底部
                    self.chat_log.yview(tk.END)
                    reason = "尝试" + skill

            if enemy_matches is not None:
                self.roll_dice(role, expression, reason)
                for enemy in self.enemy_matches:
                    role_ = ""
                    for key, nickname in self.role_entries_name.items():
                        if enemy == nickname:
                            role_ = key
                    expression_ = self.enemy_matches[enemy]
                    reason_ = f"与{self.role_entries_name[role]}对抗"
                    self.roll_dice(role_, expression_, reason_)
            else:
                self.roll_dice(role, expression, reason)

    def roll_dice(self, role, expression, reason):
        global mav_prob
        final_words = ""
        is_multiDice = False
        if role != "全员":
            # 清空输入框文本
            # 多轮掷骰应该分开计算
            # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
            # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
            self.role_entries[role].delete("1.0", tk.END)
        multi_num = 1
        pattern_multi = re.compile(r'\d+\*[\u4e00-\u9fa5a-zA-Z]+')
        if pattern_multi.match(expression):
            multi_num = int(expression.split("*")[0])
            expression = expression.split("*")[1]
            print("多轮掷骰:" + str(multi_num))
            is_multiDice = True
        else:
            is_multiDice = False
        parts_ = []
        pattern = re.compile(r'[\u4e00-\u9fa5]')
        final_words = ""
        final_words_roles = {}
        final_words_roles_comment = {}
        for roles in self.roles:
            final_words_roles[roles] = ""
            final_words_roles_comment[roles] = ""
        while multi_num > 0:
            if role == "全员":
                for roles in self.roles:
                    if roles != "DiceBot":
                        result_ = self.trpg_module.roll(expression, roles, allin=True)
                        if result_:
                            self.jrrp_record(roles, result_ + "###" + expression, "all")
                        # 妙语
                        if role != "DiceBot" and "NPC_name" not in role:
                            rand_num = random.random()  # 生成0到1之间的随机数
                            if rand_num >= 1 - mav_prob:
                                if expression in bot_personality["妙语"]:
                                    _mav_list = []
                                    if self.role_entries_name[role] in bot_personality["妙语"]:
                                        _mav_list = bot_personality["妙语"][expression] + \
                                                    bot_personality["妙语"]["通用"]
                                    else:
                                        _mav_list = bot_personality["妙语"][expression]
                                    mav_words_ = random.choice(_mav_list)
                                    self.chat_log.insert(tk.END,
                                                         f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                                    self.chat_log.yview(tk.END)
                        if any(op in expression.upper() for op in ["HP", "MP", "MOV", "SAN"]):
                            expression = ""
                            reason = ""
                            return
                        parts_ = result_.split('：')
                        SANC = ""
                        expressionUPP = expression.upper()
                        if re.compile(r'^[+\-*/]').match(expressionUPP):
                            pattern = re.compile(r'([+\-*/]+)(.*)')
                            # 使用正则表达式进行匹配
                            match = pattern.match(expressionUPP)
                            # 提取匹配的结果
                            if match:
                                expressionUPP = match.group(2)
                        if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                            expressionUPP = "1D100"
                            if ("sc" or "SC" or ".sc" or "。sc") in expression:
                                SANC = "{SAN CHECK" + expression.split("sc")[1].upper() + "}"
                            else:
                                SANC = "{" + expression.upper() + "}"
                        result = ""
                        if len(parts_) > 1:
                            if "大成功" in parts_[1]:
                                result = "[大成功]"
                            elif "极难成功" in parts_[1]:
                                result = "[极难成功]"
                            elif "困难成功" in parts_[1]:
                                result = "[困难成功]"
                            elif "大失败" in parts_[1]:
                                result = "[大失败]"
                            elif "成功" in parts_[1]:
                                result = "[成功]"
                            elif "失败" in parts_[1]:
                                result = "[失败]"
                            else:
                                result = ""
                        if multi_num == 1:
                            self.role_entries[roles].delete("1.0", tk.END)
                            self.role_entries[roles].insert("1.0", final_words_roles_comment[roles])
                            final_words_roles[roles] = final_words_roles[roles] + f"{result}{expressionUPP}={parts_[0]}"
                            if reason == "":
                                # message = f'<{self.role_entries_name["DiceBot"]}>(【{self.role_entries_name[role]}】掷骰{SANC}{adv_comment}){result}{expressionUPP}={parts_[0]}\n'
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[roles]}】掷骰{SANC}{adv_comment}){final_words_roles[roles]}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[roles]}】因【{reason}】掷骰{SANC}{adv_comment}){final_words_roles[roles]}\n\n'
                            if is_multiDice:
                                message = message.replace("【骰子】", "【多轮掷骰】")
                            self.chat_log.insert(tk.END, message)
                            self.chat_log.yview(tk.END)
                        else:
                            final_words_roles[roles] = final_words_roles[
                                                           roles] + f"{result}{expressionUPP}={parts_[0]};\n"
                            final_words_roles_comment[roles] = final_words_roles_comment[roles] + f"{parts_[1]}"
                        self.role_entries["DiceBot"].delete("1.0", tk.END)
                        if len(parts_) > 1:
                            self.role_entries[roles].insert(tk.END, parts_[1])
                            weapon_list_ = {}
                            if parts_ and "成功" in parts_[1]:
                                role_Chart_detail_ = role_Chart.get(roles, {}).copy()
                                DB_ = role_Chart_detail_["DB"]
                                DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
                                if ("D" not in DB_) and ("-" not in DB_):
                                    DB_ = "+" + DB_
                                for skill, value in role_Chart_detail_.items():
                                    if "#" in skill:
                                        weapon_list_[skill.replace("#", "")] = value
                                for weapon, value in weapon_list_.items():
                                    if weapon in expression:
                                        self.role_entries_roll[roles].delete("1.0", tk.END)
                                        self.role_entries_roll[roles].insert("1.0", f"{value.replace('+DB', DB_)}")
                                        self.role_entries[roles].insert("1.0", f"[{weapon}伤害]\n")
                                        for role_armor in self.roles:
                                            if role_armor != roles and "ARMOR:" in str(
                                                    self.role_entries_roll[role_armor]):
                                                role_Chart_detail_armor = role_Chart.get(roles, {}).copy()
                                                if "ARMOR" in role_Chart_detail_armor:
                                                    value_armor = role_Chart_detail_armor["ARMOR"]
                                                else:
                                                    value_armor = 0
                                                self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                                self.role_entries_roll[role_armor].insert("1.0",
                                                                                          f"ARMOR:{value_armor}")
                                if "急救" in expression:
                                    self.role_entries[roles].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                                    self.role_entries_roll[role].insert("1.0", f"hp+1")
                                if "医学" in expression:
                                    self.role_entries[roles].insert("1.0", f"[医学]恢复1D3 HP\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"hp+1d3")
                                if "精神分析" in expression:
                                    self.role_entries[roles].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"san+1d3")
                            if parts_ and "大失败" in parts_[1]:
                                if "精神分析" in expression:
                                    self.role_entries[roles].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"san-1d6")
                            if parts_ and "失败" in parts_[1]:
                                for weapon, value in weapon_list_.items():
                                    # print(weapon_list_)
                                    if weapon in expression:
                                        role_Chart_detail_armor = role_Chart.get(roles, {}).copy()
                                        if "ARMOR" in role_Chart_detail_armor:
                                            value_armor = role_Chart_detail_armor["ARMOR"]
                                        else:
                                            value_armor = 0
                                        self.role_entries_roll[roles].delete("1.0", tk.END)
                                        self.role_entries_roll[roles].insert("1.0", f"ARMOR:{value_armor}")

            else:
                if role == "DiceBot":
                    pass
                else:
                    result_ = self.trpg_module.roll(expression, role)
                    if result_:
                        self.jrrp_record(role, result_ + "###" + expression, "solo")
                    # 妙语
                    if role != "DiceBot" and "NOC_name" not in role:
                        rand_num = random.random()  # 生成0到1之间的随机数
                        if rand_num >= 1 - mav_prob:
                            if expression in bot_personality["妙语"]:
                                _mav_list = []
                                if self.role_entries_name[role] in bot_personality["妙语"]:
                                    _mav_list = bot_personality["妙语"][expression] + \
                                                bot_personality["妙语"]["通用"]
                                else:
                                    _mav_list = bot_personality["妙语"][expression]
                                mav_words_ = random.choice(_mav_list)
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                                self.chat_log.yview(tk.END)
                    if any(op in expression.upper() for op in ["HP", "MP", "MOV", "SAN"]):
                        expression = ""
                        reason = ""
                        # message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】因【{reason}】掷骰{SANC}{adv_comment}){result}{expressionUPP}={parts_[0]}\n\n'
                        # self.chat_log.insert(tk.END, message)
                        # self.chat_log.yview(tk.END)
                        return
                    if result_:
                        parts_ = result_.split('：')
                        print(parts_)
                    SANC = ""
                    expressionUPP = expression.upper()
                    if re.compile(r'^[+\-*/]').match(expressionUPP):
                        pattern = re.compile(r'([+\-*/]+)(.*)')
                        # 使用正则表达式进行匹配
                        match = pattern.match(expressionUPP)
                        # 提取匹配的结果
                        if match:
                            expressionUPP = match.group(2)
                    if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                        expressionUPP = "1D100"
                        if ("sc" or "SC" or ".sc" or "。sc") in expression:
                            SANC = "{SAN CHECK" + expression.split("sc")[1].upper() + "}"
                        else:
                            SANC = "{" + expression.upper() + "}"
                    result = ""
                    if len(parts_) > 1:
                        if "大成功" in parts_[1]:
                            result = "[大成功]"
                        elif "极难成功" in parts_[1]:
                            result = "[极难成功]"
                        elif "困难成功" in parts_[1]:
                            result = "[困难成功]"
                        elif "大失败" in parts_[1]:
                            result = "[大失败]"
                        elif "成功" in parts_[1]:
                            result = "[成功]"
                        elif "失败" in parts_[1]:
                            result = "[失败]"
                        else:
                            result = ""
                    if multi_num == 1:
                        if len(parts_) > 0:
                            final_words = final_words + f"{result}{expressionUPP}={parts_[0]}"
                        if "NPC_name" in role:
                            if role.split("NPC_name")[1]:
                                name_ = role.split("NPC_name")[1]
                            else:
                                name_ = "NPC"
                            if reason == "":
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{name_}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{name_}】因【{reason}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                        else:
                            if reason == "":
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】因【{reason}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                        if is_multiDice:
                            message = message.replace("【骰子】", "【多轮掷骰】")
                        self.chat_log.insert(tk.END, message)
                        self.chat_log.yview(tk.END)
                    else:
                        final_words = final_words + f"{result}{expressionUPP}={parts_[0]};\n"
                        # final_words_roles_comment = final_words_roles_comment + f"{parts_[1]}\n"

                    weapon_list = {}
                    if len(parts_) > 1:
                        if parts_ and "成功" in parts_[1]:
                            if "NPC_name" in role:
                                role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                            else:
                                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                            for skill, value in role_Chart_detail.items():
                                if "#" in skill:
                                    weapon_list[skill.replace("#", "")] = value
                            DB_ = role_Chart_detail["DB"]
                            DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
                            if ("D" not in DB_) and ("-" not in DB_):
                                DB_ = "+" + DB_
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    self.role_entries_roll[role].delete("1.0", tk.END)
                                    self.role_entries_roll[role].insert("1.0", f"{value.replace('+DB', DB_)}")
                                    self.role_entries[role].insert(tk.END, f"[{weapon}伤害]")
                                    for role_armor in self.roles:
                                        if role_armor != role:
                                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                                            if "ARMOR" in role_Chart_detail_armor:
                                                value_armor = role_Chart_detail_armor["ARMOR"]
                                            else:
                                                value_armor = 0
                                            self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                            self.role_entries_roll[role_armor].insert("1.0", f"ARMOR:{value_armor}")
                                    break
                                    # print("sadadd:" + value)
                            if "急救" in expression:
                                self.role_entries[role].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                            if "医学" in expression:
                                self.role_entries[role].insert("1.0", f"[医学恢复]1D3 HP\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d3")
                            if "精神分析" in expression:
                                self.role_entries[role].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d3")
                        if parts_ and "大失败" in parts_[1]:
                            if "精神分析" in expression:
                                self.role_entries[role].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d6")
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    for role_armor in self.roles:
                                        if role_armor != role:
                                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                                            if "ARMOR" in role_Chart_detail_armor:
                                                value_armor = role_Chart_detail_armor["ARMOR"]
                                            else:
                                                value_armor = 0
                                            self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                            self.role_entries_roll[role_armor].insert("1.0", f"ARMOR:{value_armor}")
                        elif parts_ and "失败" in parts_[1]:
                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    if "ARMOR" in role_Chart_detail_armor:
                                        value_armor = role_Chart_detail_armor["ARMOR"]
                                    else:
                                        value_armor = 0
                                    self.role_entries_roll[role].delete("1.0", tk.END)
                                    self.role_entries_roll[role].insert("1.0", f"ARMOR:{value_armor}")

            if len(parts_) > 1 and role != "全员":
                self.role_entries[role].insert(tk.END, parts_[1])

                weapon_list__ = {}
                if len(parts_) > 1:
                    if parts_ and "成功" in parts_[1]:
                        role_Chart_detail__ = role_Chart.get(role, {}).copy()
                        for skill, value in role_Chart_detail__.items():
                            if "#" in skill:
                                weapon_list__[skill.replace("#", "")] = value
                        for weapon, value in weapon_list__.items():
                            if weapon in expression:
                                self.role_entries[role].insert("1.0", f"[{weapon}伤害]\n")
                                break
                        if "急救" in expression:
                            # self.role_entries[role].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                            self.role_entries_roll[role].insert("1.0", f"hp+1")
                        if "医学" in expression:
                            # self.role_entries[role].insert("1.0", f"[医学恢复]1D3 HP\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"hp+1d3")
                        if "精神分析" in expression:
                            # self.role_entries[role].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"san+1d3")
                    if parts_ and "大失败" in parts_[1]:
                        if "精神分析" in expression:
                            # self.role_entries[role].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"san-1d6")
            multi_num -= 1

    def roll_dice_silent(self, role, expression, reason):
        global reason_silent_string_list
        multi_num = 1
        pattern_multi = re.compile(r'[\d+]\*[\u4e00-\u9fa5a-zA-Z]+')
        if pattern_multi.match(expression):
            multi_num = int(expression.split("*")[0])
            expression = expression.split("*")[1]
            print("多轮掷骰" + str(multi_num))
        pattern = re.compile(r'[\u4e00-\u9fa5]')
        SANC = ""
        self.role_entries[role].delete("1.0", tk.END)
        while multi_num > 0:
            if reason == "":
                # 从列表中随机选择一个字符串
                reason = random.choice(reason_silent_string_list)
            if re.compile(r'^[+\-*/]').match(expression):
                pattern = re.compile(r'([+\-*/]+)(.*)')
                # 使用正则表达式进行匹配
                match = pattern.match(expression)
                # 提取匹配的结果
                if match:
                    expression = match.group(2)
            if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                if ("sc" or "SC" or ".sc" or "。sc") in expression:
                    SANC = "[SAN CHECK" + expression.split("sc")[1].upper() + "]"
                else:
                    SANC = "[" + expression.upper() + "]"
            if self.role_entries_roll["DiceBot"].get("1.0", tk.END).strip().lower() == "" or self.role_entries_roll[
                "DiceBot"].get("1.0", tk.END).strip().lower() == "1d100":
                SANC = ""
            if reason == "":
                message = f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【暗骰】{self.role_entries_name[role]}进行了一次{SANC}暗骰。\n\n'
            else:
                message = f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【暗骰】{self.role_entries_name[role]}因{reason}进行了一次{SANC}暗骰。\n\n'
            self.chat_log.insert(tk.END, message)
            self.chat_log.insert(tk.END,
                                 f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【音效】掷骰\n\n')
            self.chat_log.yview(tk.END)
            result = self.trpg_module.roll(expression, role)
            # jrrp录入
            if result:
                self.jrrp_record(role, result + "###" + expression, "silent")
            self.role_entries[role].insert(tk.END, result)
            multi_num -= 1

    def new_roles_NPC(self):
        global career_list
        global trait_list
        global motive_list
        self.file_path = ""
        name_list = ["无预设", "自定义..."]
        global role_Chart_at_name
        for name, chart in role_Chart_at_name.items():
            name_list.append(name)
        self.new_roles_NPC_window = tk.Toplevel(root, takefocus=True)
        self.new_roles_NPC_window.title(f"生成新的NPC")
        # Create widgets
        self.roles_NPC_frame = tk.Frame(self.new_roles_NPC_window)
        self.roles_NPC_frame.pack()

        self.type_label = tk.Label(self.roles_NPC_frame, text="预设:")
        self.type_label.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        self.type_var = tk.StringVar()
        self.type_var.set("请选择预设")  # Default value
        self.type_menu = tk.OptionMenu(self.roles_NPC_frame, self.type_var, *name_list,
                                       command=self.random_entry_for_new_roles_NPC_by_mock)
        self.type_menu.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        self.type_random_var = tk.StringVar()
        self.type_random_var.set("请选择随机预设")  # Default value
        self.type_random_menu = tk.OptionMenu(self.roles_NPC_frame, self.type_random_var, "无随机预设", "人类", "战场经历", "警务经历",
                                              "罪犯经历", "医务经历", "教育经历", "艺术经历", "神话经历", "邪教徒", "小型野兽", "中型野兽", "大型野兽",
                                              "小型怪物", "中型怪物", "大型怪物", "古神",
                                              command=self.random_entry_for_new_roles_NPC_by_mock)
        self.type_random_menu.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")

        self.NPC_image_button = tk.Button(self.roles_NPC_frame, text="选择立绘",
                                          command=self.select_image_for_new_roles_NPC)
        self.NPC_image_button.grid(row=0, column=3, padx=5, pady=5, sticky="nsew")

        self.HP_label = tk.Label(self.roles_NPC_frame, text="HP值", fg="red")
        self.HP_label.grid(row=0, column=4, padx=5, pady=5, sticky="nsew")

        self.MP_label = tk.Label(self.roles_NPC_frame, text="MP值", fg="blue")
        self.MP_label.grid(row=0, column=5, padx=5, pady=5, sticky="nsew")

        self.name_label = tk.Label(self.roles_NPC_frame, text="姓名(必填)")
        self.name_label.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        self.name_entry = tk.Entry(self.roles_NPC_frame)
        self.name_entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        self.all_label2 = tk.Label(self.roles_NPC_frame, text="总值")
        self.all_label2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")

        self.all_label = tk.Label(self.roles_NPC_frame, text="总值")
        self.all_label.grid(row=1, column=3, padx=5, pady=5, sticky="nsew")

        self.allwithluck_label2 = tk.Label(self.roles_NPC_frame, text="总值(包括幸运)")
        self.allwithluck_label2.grid(row=1, column=4, padx=5, pady=5, sticky="nsew")

        self.allwithluck_label = tk.Label(self.roles_NPC_frame, text="总值(包括幸运)")
        self.allwithluck_label.grid(row=1, column=5, padx=5, pady=5, sticky="nsew")

        self.EDU_label = tk.Label(self.roles_NPC_frame, text="教育(EDU)")
        self.EDU_label.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

        self.EDU_text = tk.Entry(self.roles_NPC_frame)
        self.EDU_text.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        self.APP_label = tk.Label(self.roles_NPC_frame, text="外貌(APP)")
        self.APP_label.grid(row=2, column=2, padx=5, pady=5, sticky="nsew")

        self.APP_text = tk.Entry(self.roles_NPC_frame)
        self.APP_text.grid(row=2, column=3, padx=5, pady=5, sticky="nsew")

        self.DEX_label = tk.Label(self.roles_NPC_frame, text="敏捷(DEX)")
        self.DEX_label.grid(row=2, column=4, padx=5, pady=5, sticky="nsew")

        self.DEX_text = tk.Entry(self.roles_NPC_frame)
        self.DEX_text.grid(row=2, column=5, padx=5, pady=5, sticky="nsew")

        self.STR_label = tk.Label(self.roles_NPC_frame, text="力量(STR)")
        self.STR_label.grid(row=3, column=0, padx=5, pady=5, sticky="nsew")

        self.STR_text = tk.Entry(self.roles_NPC_frame)
        self.STR_text.grid(row=3, column=1, padx=5, pady=5, sticky="nsew")

        self.INT_label = tk.Label(self.roles_NPC_frame, text="智力/灵感(INT)")
        self.INT_label.grid(row=3, column=2, padx=5, pady=5, sticky="nsew")

        self.INT_text = tk.Entry(self.roles_NPC_frame)
        self.INT_text.grid(row=3, column=3, padx=5, pady=5, sticky="nsew")

        self.POW_label = tk.Label(self.roles_NPC_frame, text="意志(POW)")
        self.POW_label.grid(row=3, column=4, padx=5, pady=5, sticky="nsew")

        self.POW_text = tk.Entry(self.roles_NPC_frame)
        self.POW_text.grid(row=3, column=5, padx=5, pady=5, sticky="nsew")

        self.CON_label = tk.Label(self.roles_NPC_frame, text="体质(CON)")
        self.CON_label.grid(row=4, column=0, padx=5, pady=5, sticky="nsew")

        self.CON_text = tk.Entry(self.roles_NPC_frame)
        self.CON_text.grid(row=4, column=1, padx=5, pady=5, sticky="nsew")

        self.SIZ_label = tk.Label(self.roles_NPC_frame, text="体型(SIZ)")
        self.SIZ_label.grid(row=4, column=2, padx=5, pady=5, sticky="nsew")

        self.SIZ_text = tk.Entry(self.roles_NPC_frame)
        self.SIZ_text.grid(row=4, column=3, padx=5, pady=5, sticky="nsew")

        self.LUCK_label = tk.Label(self.roles_NPC_frame, text="幸运(LUCK)")
        self.LUCK_label.grid(row=4, column=4, padx=5, pady=5, sticky="nsew")

        self.LUCK_text = tk.Entry(self.roles_NPC_frame)
        self.LUCK_text.grid(row=4, column=5, padx=5, pady=5, sticky="nsew")

        self.description_label = tk.Label(self.roles_NPC_frame, text="技能")
        self.description_label.grid(row=5, column=0, padx=5, pady=5, sticky="nsew")

        self.description_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.description_text.grid(row=5, column=1, columnspan=1, sticky="nsew")
        self.description_text.insert(tk.END, "技能一10 技能二30 技能三70")

        self.trait_label = tk.Label(self.roles_NPC_frame, text="扮演要点")
        self.trait_label.grid(row=6, column=0, padx=5, pady=5, sticky="nsew")
        self.trait_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.trait_text.grid(row=6, column=1, columnspan=5, sticky="nsew")
        self.trait_text.insert(tk.END, "开始随机以获取个人描述参考")

        self.trait2_label = tk.Label(self.roles_NPC_frame, text="扮演要点补充")
        self.trait2_label.grid(row=7, column=0, padx=5, pady=5, sticky="nsew")
        self.trait2_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.trait2_text.grid(row=7, column=1, columnspan=5, sticky="nsew")
        self.trait2_text.insert(tk.END, "开始随机以获取个人描述参考补充")

        self.motive_label = tk.Label(self.roles_NPC_frame, text="动机")
        self.motive_label.grid(row=5, column=2, padx=5, pady=5, sticky="nsew")
        self.motive_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.motive_text.grid(row=5, column=3, columnspan=3, sticky="nsew")
        self.motive_text.insert(tk.END, "开始随机以获取个人动机")

        self.random_button = tk.Button(self.roles_NPC_frame, text="...随机生成",
                                       command=self.random_entry_for_new_roles_NPC)
        self.random_button.grid(row=9, column=0, columnspan=2, sticky="nsew")

        self.edit_button = tk.Button(self.roles_NPC_frame, text="修正旧NPC?", command=self.edit_entry_for_new_roles_NPC)
        self.edit_button.grid(row=9, column=2, columnspan=2, sticky="nsew")

        self.save_button = tk.Button(self.roles_NPC_frame, text="保存", command=self.save_json_for_new_roles_NPC)
        self.save_button.grid(row=9, column=4, columnspan=2, sticky="nsew")

        self.new_roles_NPC_window.protocol("WM_DELETE_WINDOW", self.on_closing_new_window_new_roles_NPC)

    def on_closing_new_window_new_roles_NPC(self):
        self.new_combat_window = tk.Toplevel(root)
        name = self.name_entry.get().strip()
        self.new_roles_NPC_window.destroy()
        self.Add_NPC(pass_=name)

    def select_image_for_new_roles_NPC(self):
        image_preview = tk.Label(self.roles_NPC_frame, image="", relief=tk.FLAT)
        self.file_path = filedialog.askopenfilename(title="Select Image",
                                                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                    initialdir="Images/AvatarImages")
        if self.file_path:
            image = Image.open(self.file_path)  # 替换为你的图片路径
            # 获取图像的宽和高
            width, height = image.size
            image = image.resize((int(width / 5), int(height / 5)), Image.LANCZOS)
            photo = ImageTk.PhotoImage(image)
            self.image_references_PC.append(photo)
            image_preview = tk.Label(self.roles_NPC_frame, image=photo, relief=tk.FLAT)
            image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")

    def random_entry_for_new_roles_NPC(self):
        trait_desc = []
        motive_desc = {}
        global drink_list
        global hobby_list
        global music_list
        global xp_list
        global trait_mec_list
        global mbti_list
        global app_list
        global everyday_list
        type_mock = self.type_var.get()
        type_random = self.type_random_var.get()
        if self.description_text.get("1.0", tk.END).strip() == "" or self.description_text.get("1.0",
                                                                                               tk.END).strip() == "未查找到此条目！" or self.description_text.get(
            "1.0", tk.END).strip() == "技能一10 技能二30 技能三70":
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, f"信用{random.randint(1, 100)}")
        elif "信用" in self.description_text.get("1.0", tk.END):
            credit = self.description_text.get("1.0", tk.END).split("信用")[1].split(" ")[0]
            text_ = self.description_text.get("1.0", tk.END)
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, text_.replace("信用" + credit, f"信用{random.randint(1, 100)}"))
        replacemant = self.name_entry.get().split("=")[0] + "=" + random.choice(career_list)
        for index, itm in trait_list.items():
            if index == "描述":
                trait_desc.append(index + "是" + random.choice(itm))
                trait_desc.append(random.choice(itm))
                trait_desc.append(random.choice(itm))
            else:
                trait_desc.append(index + "是" + random.choice(itm))
        self.trait_text.delete("1.0", tk.END)
        self.trait2_text.delete("1.0", tk.END)
        self.trait_text.insert("1.0", "一位穿着" + random.choice(app_list) + "的" + random.choice(["欧洲", "亚裔", "非洲", "中国", "日本", "英国", "韩国", "美国", "德国", "法国", "俄罗斯", "印度", "意大利", "埃及", "丹麦", "澳大利亚", "未知国籍", "未知人种", "白人", "黄皮肤", "黑人", "混血人种", "东方", "西方"]) + random.choice(["男性", "女性", "非二元性别者", "跨性别者"]) + "，性取向是" + random.choice(
            ["双性", "同性", "异性", "无性", "跨种族", "恋物"]) + "，喜欢" + random.choice(
            xp_list) + "。最爱喝" + random.choice(drink_list) + "，听" + random.choice(music_list) + "音乐。喜欢并关注着" + random.choice(hobby_list) + "，总是" + random.choice(everyday_list) + "。\n" + random.choice(mbti_list) + "。" +random.choice(trait_mec_list))
        self.trait2_text.insert("1.0", "，".join(trait_desc))

        for index, itm in motive_list.items():
            motive_desc[index] = random.choice(itm)
        motive_text = f"一个{motive_desc['_职业']} {motive_desc['_年龄']} 他的社会地位是{motive_desc['_社会地位']} 他让人很难忘记的特质是“{motive_desc['_令人难忘的怪癖']}” 他参与其中，现在是{motive_desc['_与情况的关系']}\n他若是【受害被利用之人】，他的理由是{motive_desc['_驱使他们的问题']}\n他若是【强力对手】，他的优势是{motive_desc['_他们在这一情况中的优势']}"
        if motive_desc['_年龄'] == "考虑到其岗位，异常年轻。":
            age_num = random.randint(7, 19)
        elif motive_desc['_年龄'] == "年轻的，也许是在其岗位上崭露头角的人。":
            age_num = random.randint(20, 35)
        elif motive_desc['_年龄'] == "在他们的岗位上已经年长或成熟。":
            age_num = random.randint(36, 59)
        elif motive_desc['_年龄'] == "衰朽的，也许已经过了以前的辉煌期，或者还在坚守。":
            age_num = random.randint(60, 90)
        else:
            age_num = random.randint(7, 90)
        if "年龄" in self.description_text.get("1.0", tk.END):
            age = self.description_text.get("1.0", tk.END).split("年龄")[1].split(" ")[0]
            age_text_ = self.description_text.get("1.0", tk.END)
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, age_text_.replace("年龄" + age, f"年龄{age_num}"))
        else:
            self.description_text.insert(tk.END, f" 年龄{age_num}")
        self.motive_text.delete("1.0", tk.END)
        self.motive_text.insert("1.0", motive_text)
        self.motive_text.yview(tk.END)

        self.name_entry.delete(0, tk.END)
        self.name_entry.insert(tk.END, replacemant)
        if type_mock == "请选择预设" or type_random == "请选择随机预设":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.APP_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.DEX_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.STR_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.INT_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.CON_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.POW_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.SIZ_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.LUCK_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))

        self.EDU = self.EDU_text.get()
        self.APP = self.APP_text.get()
        self.DEX = self.DEX_text.get()
        self.STR = self.STR_text.get()
        self.INT = self.INT_text.get()
        self.CON = self.CON_text.get()
        self.POW = self.POW_text.get()
        self.SIZ = self.SIZ_text.get()
        self.LUCK = self.LUCK_text.get()

        if type_mock != "无预设" and type_mock != "请选择预设" and type_mock != "自定义...":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str(int(self.EDU) + random.randint(-10, 10)))
            self.APP_text.insert(tk.END, str(int(self.APP) + random.randint(-20, 20)))
            self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(-20, 20)))
            self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(-20, 20)))
            self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(-10, 10)))
            self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(-20, 20)))
            self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(-20, 20)))
            self.SIZ_text.insert(tk.END, str(int(self.SIZ) + random.randint(-10, 10)))
            self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(-20, 20)))
        elif type_mock == "自定义...":
            pass

        if type_random != "无随机预设" or type_random != "请选择随机预设":
            # 人类：不变
            if type_random == "人类":
                pass
            # 战场经历：敏捷+1,10，力量+1,10，体质+1,10，意志+1,10，外貌-1,5，幸运+1，5
            elif type_random == "战场经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 10)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 10)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 5)))
                self.APP_text.insert(tk.END, str(int(self.APP) - random.randint(1, 5)))

            # 警务经历：敏捷+1,10，力量+1,9，体质+1,9，意志+1,4，智力+1,8
            elif type_random == "警务经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 9)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 9)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 4)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 8)))

            # 罪犯经历：敏捷+1,10，力量+1,10，体质+1,8，意志+1,8，智力+1,4，外貌-1,5，幸运+1,5
            elif type_random == "罪犯经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 8)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 10)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 8)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 4)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 5)))
                self.APP_text.insert(tk.END, str(int(self.APP) - random.randint(1, 5)))

            # 医务经历：敏捷+1,10，力量+1,5，意志+1,10，智力+1,15
            elif type_random == "医务经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 5)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))

            # 神话经历：智力+1,10，意志+1,30
            elif type_random == "神话经历":
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 30)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 10)))

            # 艺术经历：敏捷+1,15，外貌+1,10，幸运+1,10，意志-1,10，智力+1,15
            elif type_random == "艺术经历":
                self.DEX_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.APP_text.insert(tk.END, str(int(self.APP) + random.randint(1, 10)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 15)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(1, 10)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 10)))

            # 教育经历：智力+1,15，教育+1,15，意志+1,10
            elif type_random == "教育经历":
                self.EDU_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, str(int(self.EDU) + random.randint(1, 15)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))

            # 邪教徒：意志+(0, 50)，力量+(-10, 20)
            elif type_random == "邪教徒":
                self.STR_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(-10, 20)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(0, 50)))

            # 小型野兽：敏捷*(1,2)*1.5，力量/2，体质/2，体型/10，意志-(10, 15)
            elif type_random == "小型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 3, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(10, 15)))
                self.STR_text.insert(tk.END, str(round(int(self.STR) / 2, 0)).split(".")[0])
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) * random.randint(1, 2) * 1.5, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(round(int(self.SIZ) / 10, 0)).split(".")[0])
                self.CON_text.insert(tk.END, str(round(int(self.CON) / 2, 0)).split(".")[0])

            # 中型野兽：敏捷+(10, 30)，力量+(10, 30)，体质*2，意志-(-10, 10)
            elif type_random == "中型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 2, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(-10, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(10, 30)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(10, 30)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))

            # 大型野兽：敏捷/2，力量*(2,3)，体质*2，体型*(2,3)，意志-(-20, 5)
            elif type_random == "大型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 1.5, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(-20, 5)))
                self.STR_text.insert(tk.END, str(int(self.STR) * random.randint(2, 3)))
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) / 2, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(2, 3)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))

            # 小型怪物：敏捷*3，体型/5，意志+(20, 50)
            elif type_random == "小型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(20, 50)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * 3))
                self.SIZ_text.insert(tk.END, str(round(int(self.SIZ) / 5, 0)).split(".")[0])
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 中型怪物：敏捷*(1,2)，力量*2，体质*2，意志*2
            elif type_random == "中型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) * 2))
                self.STR_text.insert(tk.END, str(int(self.STR) * 2))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * random.randint(1, 2)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 大型怪物：敏捷/2，力量*(3,4)，体质*3，体型*(3,4)，意志*(1,3)
            elif type_random == "大型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) * random.randint(1, 3)))
                self.STR_text.insert(tk.END, str(int(self.STR) * random.randint(3, 4)))
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) / 2, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(3, 4)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 3))
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 古神：敏捷*2，力量*4，体质*(3,5)，体型*(3,5)，智力*(2,4)，意志*(3,5)
            elif type_random == "古神":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) * random.randint(3, 5)))
                self.STR_text.insert(tk.END, str(int(self.STR) * 4))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * 2))
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(3, 5)))
                self.CON_text.insert(tk.END, str(int(self.CON) * random.randint(3, 5)))
                self.INT_text.insert(tk.END, str(int(self.INT) * random.randint(2, 4)))
            else:
                pass
        else:
            pass

        self.all_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get())))
        self.allwithluck_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
        self.HP_label.config(text=str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                             fg="red")
        self.MP_label.config(text=str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")

    def random_entry_for_new_roles_NPC_by_mock(self, event):
        if self.description_text.get("1.0", tk.END) == "" or self.description_text.get("1.0",
                                                                                       tk.END) == "未查找到此条目！" or self.description_text.get(
            "1.0", tk.END) == "技能一10 技能二30 技能三70":
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, f"信用{random.randint(1, 100)}")
        elif "信用" in self.description_text.get("1.0", tk.END):
            credit = self.description_text.get("1.0", tk.END).split("信用")[1].split(" ")[0]
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, self.description_text.get("1.0", tk.END).replace(credit,
                                                                                                  f"信用{random.randint(1, 100)}"))
        replacemant = self.name_entry.get().split("=")[0] + "=" + random.choice(career_list)
        self.name_entry.delete(0, tk.END)
        self.name_entry.insert(tk.END, replacemant)
        type_mock = self.type_var.get()
        if type_mock == "无预设" or type_mock == "请选择预设":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.APP_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.DEX_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.STR_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.INT_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.CON_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.POW_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.SIZ_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.LUCK_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
        elif type_mock == "自定义...":
            pass
        else:
            mock_dic = role_Chart_at_name[type_mock].copy()
            if self.name_entry.get() == "":
                self.name_entry.insert(tk.END, type_mock)

            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, mock_dic.get("教育"))
            self.APP_text.insert(tk.END, mock_dic.get("外貌"))
            self.DEX_text.insert(tk.END, mock_dic.get("敏捷"))
            self.STR_text.insert(tk.END, mock_dic.get("力量"))
            self.INT_text.insert(tk.END, mock_dic.get("智力"))
            self.CON_text.insert(tk.END, mock_dic.get("体质"))
            self.POW_text.insert(tk.END, mock_dic.get("意志"))
            self.SIZ_text.insert(tk.END, mock_dic.get("体型"))
            self.LUCK_text.insert(tk.END, mock_dic.get("幸运"))

        self.random_entry_for_new_roles_NPC()
        self.all_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get())))
        self.allwithluck_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
        self.HP_label.config(text=str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                             fg="red")
        self.MP_label.config(text=str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")

    def edit_entry_for_new_roles_NPC(self):
        for pcname, pcdict in role_Chart_at_name.items():
            if self.name_entry.get() == pcname:
                mock_dic = role_Chart_at_name[pcname].copy()
                self.name_entry.delete(0, tk.END)
                self.name_entry.insert(tk.END, pcname)
                self.EDU_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, mock_dic.get("教育"))
                self.APP_text.insert(tk.END, mock_dic.get("外貌"))
                self.DEX_text.insert(tk.END, mock_dic.get("敏捷"))
                self.STR_text.insert(tk.END, mock_dic.get("力量"))
                self.INT_text.insert(tk.END, mock_dic.get("智力"))
                self.CON_text.insert(tk.END, mock_dic.get("体质"))
                self.POW_text.insert(tk.END, mock_dic.get("意志"))
                self.SIZ_text.insert(tk.END, mock_dic.get("体型"))
                self.LUCK_text.insert(tk.END, mock_dic.get("幸运"))
                self.description_text.delete("1.0", tk.END)
                for skill, value in mock_dic.items():
                    self.description_text.insert(tk.END, f"{skill}{value} ")
                if mock_dic.get("_AvatarPath"):
                    image = Image.open(mock_dic.get("_AvatarPath"))  # 替换为你的图片路径
                    width, height = image.size
                    image = image.resize((int(width / 5), int(height / 5)), Image.LANCZOS)
                    photo = ImageTk.PhotoImage(image)
                    self.image_references_PC.append(photo)
                    image_preview = tk.Label(self.roles_NPC_frame, image=photo, relief=tk.FLAT)
                    image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")
                else:
                    image_preview = tk.Label(self.roles_NPC_frame, image="", relief=tk.FLAT)
                    image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")

                self.all_label.config(text=str(
                    int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                        self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                        self.POW_text.get()) + int(self.SIZ_text.get())))
                self.allwithluck_label.config(text=str(
                    int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                        self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                        self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
                self.HP_label.config(text=str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                                     fg="red")
                self.MP_label.config(text=str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")
                break
            else:
                self.description_text.delete("1.0", tk.END)
                self.description_text.insert(tk.END, "未查找到此条目！")

    def save_json_for_new_roles_NPC(self):
        if self.name_entry.get() != "":
            if self.type_var.get() != "无预设" and self.type_var.get() != "请选择预设" and self.type_var.get() != "自定义...":
                self.role_skill_menu[self.name_entry.get()] = self.role_skill_menu[self.type_var.get()]
            else:
                self.role_skill_menu[self.name_entry.get()] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                               '法术名[效果公式](消费)：描述': "spell",
                                                               '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            dict_skill = self.parse_input_skill(self.description_text.get("1.0", tk.END))
            file_path = "GameSaves/pl_Chart_at_name.json"
            self.name = self.name_entry.get()
            self.EDU = self.EDU_text.get()
            self.APP = self.APP_text.get()
            self.DEX = self.DEX_text.get()
            self.STR = self.STR_text.get()
            self.INT = self.INT_text.get()
            self.CON = self.CON_text.get()
            self.POW = self.POW_text.get()
            self.SIZ = self.SIZ_text.get()
            self.LUCK = self.LUCK_text.get()
            dict2 = {"EDU": int(self.EDU),
                     "APP": int(self.APP),
                     "DEX": int(self.DEX),
                     "STR": int(self.STR),
                     "INT": int(self.INT),
                     "CON": int(self.CON),
                     "POW": int(self.POW),
                     "SIZ": int(self.SIZ),
                     "LUCK": int(self.LUCK),
                     "教育": int(self.EDU),
                     "母语": int(self.EDU),
                     "外貌": int(self.APP),
                     "敏捷": int(self.DEX),
                     "闪避": int(str(int(self.DEX) / 2).split(".")[0]),
                     "力量": int(self.STR),
                     "智力": int(self.INT),
                     "体质": int(self.CON),
                     "灵感": int(self.INT),
                     "意志": int(self.POW),
                     "体型": int(self.SIZ),
                     "幸运": int(self.LUCK),
                     "HP": int(str((int(self.CON) + int(self.SIZ)) / 10).split(".")[0]),
                     "MP": int(str(int(self.POW) / 5).split(".")[0]),
                     "SAN": int(self.POW),
                     "理智": int(self.POW),
                     "_AvatarPath": self.file_path
                     }
            dict1 = role_Chart_detail_demo.copy()
            role_Chart_at_name[self.name_entry.get()] = {**dict1, **dict_skill}
            self.update_skills(role_Chart_at_name[self.name_entry.get()], dict2)
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(role_Chart_at_name, file, indent=4, ensure_ascii=False)

    def Combat_NPC(self):
        self.new_combat_window = tk.Toplevel(root, takefocus=True)
        #self.image_references = []
        self.Add_NPC()

    def Add_NPC(self, pass_=""):
        looptime = 0
        loopalltime = 0
        value__ = "NPC"
        namelist = []
        if pass_ != "" and self.dialog2 != "" and self.dialog2.result[
            "slot"] != "":  # and self.dialog2.result["slot"] != "KP":
            slot__ = self.dialog2.result["slot"]
            name__ = self.dialog2.result["新的预设..."]
            self.dialog2.result.clear()
            self.dialog2.result[pass_] = name__
            self.dialog2.result["slot"] = slot__
        else:
            self.dialog2 = LoadNPCDialog(self.root, f"选择要加载的NPC")
        result = self.dialog2.result
        # print(result)
        if result:
            for name, value in result.items():
                if name == "新的预设...":
                    self.new_roles_NPC()
                    self.new_combat_window.destroy()
                    return
            slot = result["slot"]
            if slot != "新窗口...":
                self.new_combat_window.destroy()
                name_type = ""
                for _name_, value in result.items():
                    if _name_ == "随机...":
                        name = simpledialog.askstring("输入随机怪物的共有名称", "输入随机怪物名称(请参考NPC列表):", initialvalue=f"邪教徒")
                        name_type = name
                        namelist = []
                        role_Chart_at_name_ = load_Chart_at_name().copy()
                        for role, chart in role_Chart_at_name_.items():
                            if name in role:
                                namelist.append(role)
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                    elif _name_ == "slot":
                        pass
                    else:
                        name = _name_
                        if value == "":
                            value = name
                        if name_type != "":
                            self.role_entries[slot].insert("1.0", f"正在使用{name_type}[{name}]的属性扮演【{value}】\n===\n")
                        else:
                            self.role_entries[slot].insert("1.0", f"正在使用[{name}]的属性扮演【{value}】\n===\n")
                        if name in self.infoCanvas_data_by_name:
                            self.infoCanvas_data[slot] = self.infoCanvas_data_by_name[name]
                        else:
                            print("该模板没有简卡图片！")
                        # 按名牌加载设置
                        # print(slot)
                        role_Chart[slot] = role_Chart_at_name[name].copy()
                        SAN = role_Chart_at_name[name].get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        HP = role_Chart_at_name[name].get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        MP = role_Chart_at_name[name].get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        MOV = role_Chart_at_name[name].get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        POW = role_Chart_at_name[name].get("POW")
                        DB = role_Chart_at_name[name].get("DB")
                        if "#SAN" in role_Chart_at_name[name]:
                            SAN_ = role_Chart_at_name[name].get("#SAN")
                        else:
                            SAN_ = 100
                        self.role_values_entry[slot].insert("1.0",
                                                            f'{SAN}/{SAN_}:S\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                        if f"===状态===" not in self.role_values_entry[slot].get("1.0", tk.END).strip():
                            self.role_values_entry[slot].insert(tk.END, f"\n===状态===\n无(永久)\n")
                        if name in self.role_items:
                            for key, value in self.role_items[name].items():
                                if value != "":
                                    for value_ in value:
                                        if value_ != "":
                                            self.role_values_entry[slot].insert(tk.END,
                                                                                f"\n==={key}===\n" + "\n".join(value))
                        self.chat_log.insert(tk.END,
                                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{value}】的状态：\n{self.role_values_entry[slot].get("1.0", "6.0").strip()}\n\n')
                        self.chat_log.yview(tk.END)
                    # print(result)
            else:
                if looptime == 0:
                    looptime = simpledialog.askinteger("输入生成数量", "输入生成数量(最小为1):", initialvalue=1, minvalue=1)
                    loopalltime = looptime
                name_type = ""
                for _name_, value in result.items():
                    if _name_ == "随机...":
                        name = simpledialog.askstring("输入随机怪物的共有名称", "输入随机怪物名称(请参考NPC列表):", initialvalue=f"邪教徒")
                        name_type = name
                        namelist = []
                        role_Chart_at_name_ = load_Chart_at_name().copy()
                        for role, chart in role_Chart_at_name_.items():
                            if name in role:
                                namelist.append(role)
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                    else:
                        name = _name_
                    while looptime > 0:
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                        if looptime != loopalltime:
                            self.new_combat_window = tk.Toplevel(root, takefocus=True)
                        if _name_ == "slot":
                            pass
                        else:
                            if value == "":
                                value__ = ""
                            if looptime > 1 and value__ != "" and value != "":
                                value__ = simpledialog.askstring("输入名字", "输入名字(可留空):",
                                                                 initialvalue=name_type + "#" + str(
                                                                     len(self.new_combat_windows) + 1))
                            else:
                                value__ = value
                            if value__ == "":
                                value__ = name + "#" + str(len(self.new_combat_windows) + 1)
                            if value__ == name:
                                NPC_name = name + "NPC_name"
                            else:
                                NPC_name = name + "NPC_name" + value__
                            frame = tk.LabelFrame(self.new_combat_window, text="NPC", relief=tk.GROOVE)
                            # self.new_combat_window.bind("<Return>", lambda event: self.send_message(self.current_role.get()))
                            self.new_combat_window.bind("<Alt-Return>", lambda event: self.insert_newline())
                            self.new_combat_window.bind("<Control-Return>", lambda: self.newline_on_ctrl_enter)
                            frame.grid(row=0, column=0, padx=10, pady=10, sticky="nsew")
                            if NPC_name.split("NPC_name")[1] != "":
                                pass
                            else:
                                NPC_name += name + "#1"
                            if NPC_name in self.role_entries_frame:
                                _NPC_list = []
                                # for index, frame in self.role_entries_frame.copy().items():
                                # if NPC_name.split("#")[0] in index:
                                # _NPC_list.append("frame")
                                if NPC_name.split("NPC_name")[1] != "":
                                    NPC_name = NPC_name.split("#")[0] + "#" + str(len(self.new_combat_windows) + 1)
                                    NPC_name = NPC_name.split("#")[0] + "#" + str(len(self.new_combat_windows) + 1)
                                else:
                                    NPC_name = NPC_name.split("#")[0] + name + "#" + str(
                                        len(self.new_combat_windows) + 1)  # str(random.randint(1000, 9999))
                            self.new_combat_window.title("【NPC】" + NPC_name.split("NPC_name")[1])
                            self.role_entries_frame[NPC_name] = frame
                            self.role_entries_name_NPC[NPC_name] = NPC_name.split("NPC_name")[1]
                            # self.roles.append(NPC_name)
                            # 每个角色的消息框
                            entry = tk.Text(frame, wrap=tk.WORD, width=30, height=3, undo=True)
                            entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")
                            # entry.bind("<Button-3>", lambda event, r=NPC_name: self.add_menu(event, r))
                            if name_type != "":
                                if value__.split("#")[0] == name:
                                    entry.insert("1.0", f"野生的[{name_type}]【{value__}】出现了！\n")
                                else:
                                    entry.insert("1.0", f"野生的[{name_type}]{name}【{value__}】出现了！\n")
                            else:
                                entry.insert("1.0", f"野生的{name}【{value__}】出现了！\n")
                            self.role_entries[NPC_name] = entry
                            role_Chart_detail = role_Chart_at_name.get(NPC_name.split("NPC_name")[0],
                                                                       {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                            # 加载并显示头像
                            if "_AvatarPath" in role_Chart_detail:
                                self.role_avatar_paths[NPC_name] = role_Chart_detail["_AvatarPath"]
                            else:
                                self.role_avatar_paths[NPC_name] = ""
                            self.load_and_display_avatar(NPC_name, self.role_entries[NPC_name].master)
                            # self.load_and_display_icon(NPC_name.replace("NPC_name", ""), frame)
                            # 创建数值tag，显示数值
                            SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            POW = role_Chart_detail.get("POW")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            DB = role_Chart_detail.get("DB")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            if "#SAN" in role_Chart_detail:
                                _SAN = role_Chart_detail.get("#SAN")
                            else:
                                _SAN = 100
                            entry2 = tk.Text(frame, wrap=tk.WORD, width=10, height=6, undo=True)
                            entry2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
                            value_tag = f"{NPC_name}_values_tag"
                            entry2.tag_config(value_tag, justify=tk.LEFT)
                            entry2.insert(tk.END,
                                          f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB',
                                          value_tag)
                            if f"===状态===" not in entry2.get("1.0", tk.END).strip():
                                entry2.insert(tk.END, f"\n===状态===\n无(永久)\n", value_tag)
                            if NPC_name.split("NPC_name")[0] in self.role_items:
                                for key, keyvalue in self.role_items[NPC_name.split("NPC_name")[0]].items():
                                    if keyvalue != "":
                                        for value_ in keyvalue:
                                            if value_ != "":
                                                if f"==={key}===" not in entry2.get("1.0", tk.END).strip():
                                                    entry2.insert(tk.END, f"\n==={key}===\n" + "\n".join(keyvalue),
                                                                  value_tag)
                            entry2.bind("<Button-3>", lambda event, r="statuslog" + NPC_name: self.add_menu(event, r))
                            self.role_values_entry[NPC_name] = entry2
                            # 为每个文本框绑定焦点变化事件
                            entry2.bind("<FocusIn>", lambda event, r=NPC_name: self.update_health_bar(r))
                            entry2.bind("<FocusOut>", lambda event, r=NPC_name: self.update_health_bar(r))
                            # send_button = tk.Button(frame, text="发送", command=lambda role=NPC_name: self.send_message(role))
                            # send_button.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

                            label = tk.Label(frame, text=value__, relief=tk.FLAT,
                                             font=("Times New Roman", 16,
                                                   "bold"))  # flat, groove, raised, ridge, solid, or sunken
                            label.grid(row=0, column=1, pady=0, sticky="nsew")
                            label.bind("<Button-1>",
                                       lambda event, role=NPC_name, label=label: self.edit_role_name(event, role,
                                                                                                     label))
                            label.bind("<Button-3>", lambda event, role=NPC_name: self.on_avatar_click(role))
                            label.bind("<Enter>", lambda event, role=NPC_name: self.on_Namelabel_hover(role))
                            label.bind("<Leave>", lambda event, role=NPC_name: self.on_Namelabel_unfocus(role))

                            label = tk.Label(frame, text="@", relief=tk.FLAT)
                            label.grid(row=0, column=0, pady=0, sticky="nsew")
                            # label点击事件绑定
                            label.bind("<Button-1>", lambda event, role=NPC_name: self.on_at_click(role))
                            label.bind("<Button-3>", lambda event, role=NPC_name: self.on_at_right_click(role))

                            # 添加掷骰按钮和面数输入框
                            entry_roll = tk.Text(frame, wrap=tk.WORD, width=3, height=1, undo=True)
                            entry_roll.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")
                            entry_roll.bind("<Button-3>",
                                            lambda event, r=NPC_name: self.add_menu_skills(event, NPC_name))
                            self.role_entries_roll[NPC_name] = entry_roll
                            # roll_button = tk.Button(frame, text="掷骰", command=lambda r=NPC_name: self.get_and_roll(r))
                            # roll_button.grid(row=2, column=2, padx=5, pady=5)
                            # self.role_roll_button[NPC_name] = roll_button
                            # 在 Text 组件中插入初始文本
                            initial_text = "1d100"
                            self.role_entries_roll[NPC_name].insert(tk.END, initial_text)
                            entry.bind("<FocusIn>",
                                       lambda event, role=NPC_name: self.bind_enter_to_send_message_NPC(event, role))
                            entry_roll.bind("<FocusIn>",
                                            lambda event2, role=NPC_name: self.bind_enter_to_send_roll_NPC(event2,
                                                                                                           role))
                            # 状态条（血量）
                            statusbar_health = tk.Label(frame, text=self.draw_health_bar(HP, HP, bar_length=18),
                                                        relief=tk.FLAT)
                            statusbar_health.grid(row=2, column=1, padx=0, pady=0, sticky="nsew")
                            statusbar_health.bind("<Enter>", lambda event, r=NPC_name: self.update_health_bar(r))
                            statusbar_health.bind("<Button-1>", lambda event, r=NPC_name: self.hide_health_bar(r))
                            self.role_statusbar_health[NPC_name] = statusbar_health
                            # 状态条（状态图标）
                            # 加载图像
                            # image = Image.open("Images/IconImages/20.png")  # 替换为你的图片路径
                            # image = image.resize((50, 50), Image.LANCZOS)
                            # photo = ImageTk.PhotoImage(image)
                            # self.image_references.append(photo)
                            statusbar_icon = tk.Label(frame, image="", relief=tk.FLAT)
                            statusbar_icon.grid(row=2, column=2, padx=0, pady=0, sticky="nsew")
                            statusbar_icon.bind("<Button-1>", lambda event: self.update_status_icon(event))
                            statusbar_icon.bind("<Enter>", lambda event, r=NPC_name: self.draw_status_icon_canvas(event, r))
                            statusbar_icon.bind("<Leave>", lambda event, r=NPC_name: self.destroy_status_icon_canvas(r))
                            self.role_statusbar_icon[NPC_name] = statusbar_icon
                            # 状态条（mp量）
                            statusbar_mp = tk.Label(frame, text="MP " + self.draw_health_bar(MP, MP, bar_length=5,
                                                                                             show_text=False),
                                                    relief=tk.FLAT, font=("Times New Roman", 7))
                            statusbar_mp.grid(row=2, column=0, padx=0, pady=0, sticky="nsew")
                            statusbar_mp.bind("<Enter>", lambda event, r=NPC_name: self.update_health_bar(r))
                            statusbar_mp.bind("<Button-1>", lambda event, r=NPC_name: self.hide_health_bar(r))
                            self.role_sstatusbar_mp[NPC_name] = statusbar_mp
                            if loopalltime - 1 != 0:
                                self.highlighted_role.set(NPC_name)
                                self.new_combat_window.protocol("WM_DELETE_WINDOW",
                                                                lambda: self.on_closing_new_NPC_window(
                                                                    self.highlighted_role.get()))
                            else:
                                self.new_combat_window.protocol("WM_DELETE_WINDOW",
                                                                lambda: self.on_closing_new_NPC_window(NPC_name))
                            self.new_combat_windows[NPC_name] = self.new_combat_window
                        looptime -= 1
        else:
            self.new_combat_window.destroy()

    def update_status_icon(self, event):
        self.current_path = ""
        self.new_status_edit_window = tk.Toplevel(root, takefocus=True)
        self.new_status_edit_window.title(f"增加状态")
        self.icon_data = self.status_icon
        # Create widgets
        self.status_frame = tk.Frame(self.new_status_edit_window)
        self.status_frame.pack()

        self.status_label = tk.Label(self.status_frame, text="状态名称:")
        self.status_label.grid(row=0, column=0)

        self.status_entry = tk.Entry(self.status_frame)
        self.status_entry.grid(row=0, column=1)

        self.image_button = tk.Button(self.status_frame, text="选择Icon", command=self.select_image_for_status_icon)
        self.image_button.grid(row=0, column=2)

        self.description_label = tk.Label(self.status_frame, text="状态描述:")
        self.description_label.grid(row=1, column=0)

        self.description_text = tk.Text(self.status_frame, height=4, width=30, undo=True)
        self.description_text.grid(row=1, column=1, columnspan=2)

        self.add_button = tk.Button(self.status_frame, text="新状态...", command=self.add_entry_for_status_icon)
        self.add_button.grid(row=2, column=0)

        self.edit_button = tk.Button(self.status_frame, text="修正旧状态?", command=self.edit_entry_for_status_icon)
        self.edit_button.grid(row=2, column=1)

        self.save_button = tk.Button(self.status_frame, text="保存", command=self.save_json_for_status_icon)
        self.save_button.grid(row=2, column=2)

    def select_image_for_status_icon(self):
        file_path = filedialog.askopenfilename(title="Select Image",
                                               filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                               initialdir="Images/IconImages")
        if file_path:
            image = Image.open(file_path)  # 替换为你的图片路径
            image = image.resize((80, 80), Image.LANCZOS)
            photo = ImageTk.PhotoImage(image)
            self.image_references_PC.append(photo)
            icon_preview = tk.Label(self.status_frame, image=photo, relief=tk.FLAT)
            icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
        self.icon_data[self.status_entry.get()] = {"_path": file_path,
                                                   "des": self.description_text.get("1.0", tk.END)}
        self.current_path = file_path


    def add_entry_for_status_icon(self):
        if self.status_entry.get() != "":
            self.status_entry.delete(0, tk.END)
            self.description_text.delete("1.0", tk.END)
            icon_preview = tk.Label(self.status_frame, image="", relief=tk.FLAT)
            icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
            if self.status_entry.get() not in self.icon_data:
                self.icon_data[self.status_entry.get()] = {"_path": self.current_path,
                                                       "des": self.description_text.get("1.0", tk.END)}
            self.save_json_for_status_icon()

    def edit_entry_for_status_icon(self):
        if self.status_entry.get() in self.icon_data:
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, self.icon_data[self.status_entry.get()]["des"])
            if self.icon_data[self.status_entry.get()]["_path"]:
                image = Image.open(self.icon_data[self.status_entry.get()]["_path"])  # 替换为你的图片路径
                image = image.resize((80, 80), Image.LANCZOS)
                photo = ImageTk.PhotoImage(image)
                self.image_references_PC.append(photo)
                icon_preview = tk.Label(self.status_frame, image=photo, relief=tk.FLAT)
                icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
                self.current_path = self.icon_data[self.status_entry.get()]["_path"]
        else:
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, "未查找到此条目！")
            icon_preview = tk.Label(self.status_frame, image="", relief=tk.FLAT)
            icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")

    def save_json_for_status_icon(self):
        if self.status_entry.get() != "":
            self.icon_data[self.status_entry.get()] = {"_path": self.current_path,
                                                           "des": self.description_text.get("1.0", tk.END)}
            file_path = "AppSettings/status_icon_settings.json"
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(self.icon_data, file, indent=4, ensure_ascii=False)

    def update_roles_skills(self, event, role):
        self.new_skills_edit_window = tk.Toplevel(root, takefocus=True)
        if "NPC_name" in role:
            self.new_skills_edit_window.title(f"【NPC】{role.split('NPC_name')[1]}的技能修改")
        else:
            self.new_skills_edit_window.title(f"{self.role_entries_name[role]}的技能修改")
        if "NPC_name" in role:
            self.role_skills_data = self.role_skill_menu[role.split('NPC_name')[0]]
        else:
            self.role_skills_data = self.role_skill_menu[self.role_entries_name[role]]
        # Create widgets
        self.status_frame = tk.Frame(self.new_skills_edit_window)
        self.status_frame.pack()

        self.type_label = tk.Label(self.status_frame, text="Type:")
        self.type_label.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        self.type_var = tk.StringVar()
        self.type_var.set("请选择类型")  # Default value
        self.type_menu = tk.OptionMenu(self.status_frame, self.type_var, "Skill", "Maneuver", "Spell",
                                       command=self.update_fields_for_roles_skills)
        self.type_menu.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        self.name_label = tk.Label(self.status_frame, text="请选择类型")
        self.name_label.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        self.name_entry = tk.Entry(self.status_frame)
        self.name_entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        self.check_label = tk.Label(self.status_frame, text="请选择类型")
        self.check_label.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

        self.check_text = tk.Entry(self.status_frame)
        self.check_text.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        self.require_label = tk.Label(self.status_frame, text="请选择类型")
        self.require_label.grid(row=3, column=0, padx=5, pady=5, sticky="nsew")

        self.require_text = tk.Entry(self.status_frame)
        self.require_text.grid(row=3, column=1, padx=5, pady=5, sticky="nsew")

        self.exp_label = tk.Label(self.status_frame, text="请选择类型")
        self.exp_label.grid(row=4, column=0, padx=5, pady=5, sticky="nsew")

        self.exp_text = tk.Entry(self.status_frame)
        self.exp_text.grid(row=4, column=1, padx=5, pady=5, sticky="nsew")

        self.description_label = tk.Label(self.status_frame, text="请选择类型")
        self.description_label.grid(row=5, column=0, padx=5, pady=5, sticky="nsew")

        self.description_text = tk.Text(self.status_frame, height=4, width=30, undo=True)
        self.description_text.grid(row=5, column=1, columnspan=2)

        self.add_button = tk.Button(self.status_frame, text="新技能...",
                                    command=lambda role=role: self.add_entry_for_roles_skills(role))
        self.add_button.grid(row=6, column=0)

        self.edit_button = tk.Button(self.status_frame, text="修正旧技能?", command=self.edit_entry_for_roles_skills)
        self.edit_button.grid(row=6, column=1)

        self.save_button = tk.Button(self.status_frame, text="保存",
                                     command=lambda role=role: self.save_json_for_roles_skills(role))
        self.save_button.grid(row=6, column=2)

    def add_entry_for_roles_skills(self, role):
        self.name_entry.delete(0, tk.END)
        self.check_text.delete(0, tk.END)
        self.require_text.delete(0, tk.END)
        self.exp_text.delete(0, tk.END)
        self.description_text.delete("1.0", tk.END)
        self.save_json_for_roles_skills(role)

    def edit_entry_for_roles_skills(self):
        for skillname, type in self.role_skills_data.items():
            if self.name_entry.get() in skillname.split("[")[0].split(":")[
                0] and self.type_var.get().upper() == type.upper():
                self.name_entry.delete(0, tk.END)
                self.check_text.delete(0, tk.END)
                self.require_text.delete(0, tk.END)
                self.exp_text.delete(0, tk.END)
                self.description_text.delete("1.0", tk.END)
                if self.type_var.get() == "Skill":
                    self.name_entry.insert(tk.END, skillname.split("[")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.exp_text.insert(tk.END, skillname.split(")")[1].split("：")[0])
                    self.description_text.insert(tk.END, skillname.split("：")[1])
                    break
                elif self.type_var.get() == "Spell":
                    self.name_entry.insert(tk.END, skillname.split("[")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.description_text.insert(tk.END, skillname.split("：")[1])
                    break
                else:
                    self.name_entry.insert(tk.END, skillname.split(":")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.exp_text.insert(tk.END, skillname.split(")")[1])
                    self.description_text.insert(tk.END, skillname.split(":")[1].split("[")[0])
                    break
            else:
                self.description_text.delete("1.0", tk.END)
                self.description_text.insert(tk.END, "未查找到此条目！")

    def save_json_for_roles_skills(self, role):
        if self.name_entry.get() != "":
            file_path = "GameSaves/skill_menu_by_name.json"
            for skillname, type in self.role_skills_data.items():
                if self.name_entry.get() in skillname.split("[")[0].split(":")[
                    0] and self.type_var.get().upper() == type.upper():
                    self.role_skills_data.pop(skillname)
                    break
            if self.type_var.get() == "Skill":
                self.role_skills_data[
                    f"{self.name_entry.get()}[{self.check_text.get()}]({self.require_text.get()}){self.exp_text.get()}：{self.description_text.get('1.0', tk.END)}"] = "skill"
            elif self.type_var.get() == "Spell":
                self.role_skills_data[
                    f"{self.name_entry.get()}[{self.check_text.get()}]({self.require_text.get()})：{self.description_text.get('1.0', tk.END)}"] = "spell"
            else:
                self.role_skills_data[
                    f"{self.name_entry.get()}:{self.description_text.get('1.0', tk.END)}[{self.check_text.get()}]({self.require_text.get()}){self.exp_text.get()}"] = "maneuver"

            if "NPC_name" in role:
                self.role_skill_menu[role.split('NPC_name')[1]] = self.role_skills_data
            else:
                self.role_skill_menu[self.role_entries_name[role]] = self.role_skills_data
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(self.role_skill_menu, file, indent=4, ensure_ascii=False)

    def update_fields_for_roles_skills(self, event):
        # Clear previous data
        self.name_entry.delete(0, tk.END)
        self.description_text.delete("1.0", tk.END)
        self.require_text.delete(0, tk.END)
        # Update labels based on selection
        if self.type_var.get() == "Skill":
            self.name_label.config(text="技能名称:")
            self.check_label.config(text="所鉴定技能:")
            self.require_label.config(text="有什么要求？")
            self.exp_label.config(text="效果公式?")
            self.exp_text.config(state="normal")
            self.description_label.config(text="技能描述:")
        elif self.type_var.get() == "Spell":
            self.name_label.config(text="法术名称:")
            self.check_label.config(text="(伤害)效果公式:")
            self.require_label.config(text="消费?")
            self.require_text.insert(tk.END, "例:1MP 1SAN+可变SAN → M1 S1+?")
            self.exp_label.config(text="无需填写:")
            self.exp_text.config(state="disabled")
            self.description_label.config(text="法术描述:")
            self.description_text.insert(tk.END, "生效时长、持续时间、描写、说明等")
        elif self.type_var.get() == "Maneuver":
            self.name_label.config(text="战技/特技名称:")
            self.check_label.config(text="所鉴定技能?")
            self.require_label.config(text="有什么要求?")
            self.exp_label.config(text="效果公式?")
            self.exp_text.config(state="normal")
            self.description_label.config(text="效果描述:")

    def update_health_bar(self, role):
        # self.draw_status_icon_canvas(role)
        # self.destroy_status_icon_canvas(role)
        global is_hiding_health_bar
        status_list_name = []
        status_list = {}
        if "NPC_name" in role:
            HP = self.role_values_entry[role].get("2.0", "3.0")
            _HP = int(HP.split("/")[0])
            HP_ = int(HP.split("/")[1].split(":")[0])
            MP = self.role_values_entry[role].get("3.0", "4.0")
            _MP = int(MP.split("/")[0])
            MP_ = int(MP.split("/")[1].split(":")[0])
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            for status in status_list_:
                if "(" in status:
                    status_list_name.append(status.split("(")[0])
                elif "（" in status:
                    status_list_name.append(status.split("（")[0])
                else:
                    status_list_name.append(status)
            for status2 in status_list_name:
                if status2 in self.status_icon:
                    image = Image.open(self.status_icon[status2]["_path"])  # 替换为你的图片路径
                    image = image.resize((50, 50), Image.LANCZOS)
                    photo = ImageTk.PhotoImage(image)
                    self.image_references.append(photo)
                    self.role_statusbar_icon[role].config(image=photo)
                    break
                else:
                    self.role_statusbar_icon[role].config(image="")
            if is_hiding_health_bar:
                self.role_sstatusbar_mp[role].config(
                    text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5, show_text=False),
                    font=("Times New Roman", 1))
            else:
                self.role_sstatusbar_mp[role].config(
                    text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5, show_text=False), font=None)
        else:
            SAN = self.role_values_entry[role].get("1.0", "2.0")
            _SAN = int(SAN.split("/")[0])
            SAN_ = int(SAN.split("/")[1].split(":")[0])
            HP = self.role_values_entry[role].get("2.0", "3.0")
            _HP = int(HP.split("/")[0])
            HP_ = int(HP.split("/")[1].split(":")[0])
            MP = self.role_values_entry[role].get("3.0", "4.0")
            _MP = int(MP.split("/")[0])
            MP_ = int(MP.split("/")[1].split(":")[0])
            if is_hiding_health_bar:
                self.role_sstatusbar_mp[role].config(text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5,
                                                                                       show_text=False) + "\nSAN " + self.draw_health_bar(
                    _SAN, SAN_, bar_length=5, show_text=False), font=("Times New Roman", 1))
            else:
                self.role_sstatusbar_mp[role].config(text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5,
                                                                                       show_text=False) + "\nSAN " + self.draw_health_bar(
                    _SAN, SAN_, bar_length=5, show_text=False), font=("Times New Roman", 7))
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            for status in status_list_:
                if "(" in status:
                    status_list_name.append(status.split("(")[0])
                elif "（" in status:
                    status_list_name.append(status.split("（")[0])
                else:
                    status_list_name.append(status)
                status_list[status] = {}
            for status2 in status_list_name:
                if status2 in self.status_icon:
                    if self.status_icon[status2]["_path"]:
                        image = Image.open(self.status_icon[status2]["_path"])  # 替换为你的图片路径
                        image = image.resize((30, 30), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_PC.append(photo)
                        self.role_statusbar_icon[role].config(image=photo)
                        # print(self.status_icon[status2]["des"])
                        break
                else:
                    self.role_statusbar_icon[role].config(image="")
                    # print(status2)
        if is_hiding_health_bar:
            # self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=("Times New Roman", 1))
            self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=None)
        else:
            self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=None)

    def destroy_status_icon_canvas(self, role):
        # print("leave" + role)
        # 离开悬停事件处理
        # self.avatar_click_event = role
        # current_role = self.current_role.get()
        self.new_window_statusCanvas.destroy()

    def draw_status_icon_canvas(self, event, role):
        self.update_health_bar(role)
        # print("enter"+role)
        # 悬停事件处理
        self.new_window_statusCanvas = tk.Toplevel(root)
        x, y = event.x_root, event.y_root
        #window_width = self.new_window_statusCanvas.winfo_width()
        #window_height = self.new_window_statusCanvas.winfo_height()
        self.new_window_statusCanvas.geometry(f"+{x + 5}+{y + 5}")
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            self.new_window_statusCanvas.title(f"NPC - {name_}的状态")
        else:
            self.new_window_statusCanvas.title(f"{role} - {self.role_entries_name[role]}的状态")
        # self.avatar_click_event = role
        current_role = self.current_role.get()
        status_list = {}
        if "NPC_name" in role:
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            length = len(status_list_)
            for status2 in status_list_:
                if "(" in status2:
                    status_list_name = status2.split("(")[0]
                elif "（" in status2:
                    status_list_name = status2.split("（")[0]
                else:
                    status_list_name = status2
                if status_list_name in self.status_icon:
                    image = Image.open(self.status_icon[status_list_name]["_path"])  # 替换为你的图片路径
                    image = image.resize((50, 50), Image.LANCZOS)
                    photo = ImageTk.PhotoImage(image)
                    self.image_references.append(photo)
                    width, height = image.size
                    canvas_icon = tk.Label(self.new_window_statusCanvas, image=photo, relief=tk.FLAT)
                    canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status2, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas,
                                          text="  " + self.status_icon[status_list_name]["des"], relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                else:
                    canvas_icon = tk.Label(self.new_window_statusCanvas, image="", relief=tk.FLAT)
                    canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status_list_name, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas, text="  " + status2, relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                length -= 1
        else:
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            length = len(status_list_)
            for status2 in status_list_:
                if "(" in status2:
                    status_list_name = status2.split("(")[0]
                elif "（" in status2:
                    status_list_name = status2.split("（")[0]
                else:
                    status_list_name = status2
                if status_list_name in self.status_icon:
                    if self.status_icon[status_list_name]["_path"]:
                        image = Image.open(self.status_icon[status_list_name]["_path"])  # 替换为你的图片路径
                        image = image.resize((50, 50), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_PC.append(photo)
                        width, height = image.size
                        canvas_icon = tk.Label(self.new_window_statusCanvas, image=photo, relief=tk.FLAT)
                        canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status2, relief=tk.FLAT,
                                               font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas,
                                              text="  " + self.status_icon[status_list_name]["des"], relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                else:
                    canvas_icon = tk.Label(self.new_window_statusCanvas, image="", relief=tk.FLAT)
                    canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status_list_name, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas, text="  " + status2, relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                length -= 1

    def draw_health_bar(self, current_health, max_health, bar_length=10, show_text=True):
        if current_health == "(CON+SIZ)/10":
            current_health = 0
            max_health = 1
        if current_health == "POW/5":
            current_health = 0
            max_health = 1
        if current_health == "POW":
            current_health = 0
            max_health = 1
        if max_health > 0:
            filled_length = int(bar_length * current_health / int(max_health))
        else:
            filled_length = 0
        bar = '█' * filled_length + '▪' * (bar_length - filled_length)
        if show_text:
            return f"{bar} {current_health}/{int(max_health)}"
        else:
            return f"{bar}"

    def on_closing_new_NPC_window(self, key):
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end

        # self.new_combat_window.destroy()
        if key not in self.new_combat_windows:
            return
        self.new_combat_windows.pop(key).destroy()
        self.role_entries.pop(key)
        if key.split("NPC_name")[1] == "":
            name = "NPC"
        else:
            name = key.split("NPC_name")[1]
        self.chat_log.insert(tk.END,
                             f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【角色退场】{name}\n\n')
        self.chat_log.yview(tk.END)
        # if len(self.new_combat_windows) > 0:
        # self.new_combat_window = self.new_combat_windows[len(self.new_combat_windows)-1]
        # self.role_entries_frame.pop(key).destroy()
        # self.roles.pop()

    def set_start_point(self, event):
        self.start_x = event.x
        self.start_y = event.y

    def draw(self, event):
        global isOpeningFiles
        if isOpeningFiles:
            pass
        else:
            if self.start_x is not None and self.start_y is not None:
                x, y = event.x, event.y
                self.canvas.tag_lower(self.canvas.create_line(self.start_x, self.start_y, x, y, width=2))
                self.start_x = x
                self.start_y = y

    def set_erase_point(self, event):
        self.start_x = event.x
        self.start_y = event.y

    def erase(self, event):
        if self.start_x is not None and self.start_y is not None:
            x, y = event.x, event.y
            self.canvas.tag_lower(self.canvas.create_line(self.start_x, self.start_y, x, y, width=5, fill="white"))
            self.start_x = x
            self.start_y = y

    def stop_drawing(self, event):
        # 鼠标松开时的事件处理函数
        self.start_x = None
        self.start_y = None

    def delete_information(self, role):
        # 获取选中的条目
        if role == "KP":
            selected_item = self.tree_main.selection()
            if selected_item is None:
                selected_item = self.tree_main.selection()
                # 如果有选中的条目
                if selected_item:
                    for l in selected_item:
                        # 更改选中条目的背景色为红色
                        # self.tree2_list[role].item(selected_item, tags=('red_background'))
                        self.tree_main.delete(l)
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree_list[role].item(selected_item, tags=('red_background'))
                    self.tree_main.delete(l)
        else:
            selected_item = self.tree_list[role].selection()
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree_list[role].item(selected_item, tags=('red_background'))
                    self.tree_list[role].delete(l)
            selected_item = self.tree2_list[role].selection()
            # 如果有选中的条目
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree2_list[role].item(selected_item, tags=('red_background'))
                    self.tree2_list[role].delete(l)

    def on_double_click(self, event, role=None):
        # 获取双击的条目
        item = self.tree_list[role].selection()
        if item:
            # 获取条目的值
            values = self.tree_list[role].item(item, "values")
            # 创建一个弹出对话框，让用户输入新的记忆指数
            new_memory_index = simpledialog.askinteger("修改记忆指数", f"{values[1]}\n当前记忆指数：{values[2]}\n请输入新的记忆指数：",
                                                       minvalue=-5,
                                                       maxvalue=100)
            if new_memory_index is not None:
                # 更新Treeview中的值
                self.tree_list[role].item(item, values=(values[0], values[1], new_memory_index))
        sorted_ids = sorted(self.tree_list[role].get_children(), key=lambda x: self.tree_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree_list[role].insert("", "end", values=values)
            self.tree_list[role].delete(item_id)
            self.tree_list[role].update()

    def on_double_click2(self, event, role=None):
        # 获取双击的条目
        item = self.tree2_list[role].selection()
        if item:
            # 获取条目的值
            values = self.tree2_list[role].item(item, "values")
            # 创建一个弹出对话框，让用户输入新的记忆指数
            new_memory_index = simpledialog.askinteger("修改记忆指数", f"{values[1]}\n\n当前记忆指数：{values[2]}\n请输入新的记忆指数：",
                                                       minvalue=-5,
                                                       maxvalue=100)
            if new_memory_index is not None:
                # 更新Treeview中的值
                self.tree2_list[role].item(item, values=(values[0], values[1], new_memory_index, values[3]))
        sorted_ids = sorted(self.tree2_list[role].get_children(), key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree2_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree2_list[role].insert("", "end", values=values)
            self.tree2_list[role].delete(item_id)
            self.tree2_list[role].update()

    def edit_callback(self, new_value, item, col_id, role):
        self.tree2_list[role].set(item, col_id, new_value)
        return True

    def add_information(self, role=None):
        self.information_sources = ["来源A", "来源B", "来源C"]  # 你的信息来源列表

        self.dialog = MemoryInfoDialog(self.new_window, f"为【{self.role_entries_name[role]}】添加信息",
                                       self.information_sources,
                                       role)
        result = self.dialog.result
        if result["评分"] == "遗忘":
            self.add_inference2self2(result["信息来源"], "[该信息已遗忘 - Ignorance is a bliss.]  " + result["信息内容"],
                                     result["记忆指数"], "×", role)
        else:
            self.add_inference2self(result["信息来源"], result["信息内容"], result["记忆指数"], role)

    def add_information_public(self, role=None):
        self.dialog = MemoryInfoDialog_public(self.new_window, f"为【公共信息池】添加信息", role)
        result = self.dialog.result
        self.add_inference2public(result["信息来源"], result["信息内容"], result["评论"], result["共享人"])

    def forget_information(self, role):
        # 实现遗忘信息的逻辑
        # 获取所有条目的ID
        all_items = self.tree_list[role].get_children()
        # 检查是否有条目
        if all_items:
            # 获取最后一个条目的ID
            last_item = all_items[-1]
            # 使用delete方法删除最后一个条目
            self.add_inference2self2(self.tree_list[role].item(last_item, "values")[0],
                                     self.tree_list[role].item(last_item, "values")[1],
                                     self.tree_list[role].item(last_item, "values")[2], "×", role)
            self.tree_list[role].delete(last_item)

    def upload_information(self, role=None):
        # 获取选中的条目
        if role == "KP":
            pass
        else:
            selected_item = self.tree_list[role].selection()
            # 如果有选中的条目
            if selected_item:
                for l in selected_item:
                    self.tree_main.insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.role_entries_name[role], self.thoughts[role].get("1.0", tk.END)))
                    print(self.tree_list[role].item(l, "values"))
                    self.tree2_list[role].insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.tree_list[role].item(l, "values")[2], "√"))
                    self.tree_list[role].delete(l)
                    # self.add_inference2public(l["信息来源"], "关于X的信息", "想法", role)
                    # self.add_inference2self2("玩家1", "关于X的信息", -4, "√", role)
                sorted_ids = sorted(self.tree2_list[role].get_children(),
                                    key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                                    reverse=True)
                # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
                for item_id in sorted_ids:
                    values = self.tree2_list[role].item(item_id, "values")
                    # 在这里进行你需要的操作，可以根据需要修改 values 的内容
                    self.tree2_list[role].insert("", "end", values=values)
                    self.tree2_list[role].delete(item_id)
                    self.tree2_list[role].update()
            else:
                list = self.tree_list[role].get_children()
                for l in list:
                    self.tree_main.insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.role_entries_name[role], self.thoughts[role].get("1.0", tk.END)))
                    print(self.tree_list[role].item(l, "values"))
                    self.tree2_list[role].insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.tree_list[role].item(l, "values")[2], "√"))
                    self.tree_list[role].delete(l)
                    # self.add_inference2public(l["信息来源"], "关于X的信息", "想法", role)
                    # self.add_inference2self2("玩家1", "关于X的信息", -4, "√", role)
                sorted_ids = sorted(self.tree2_list[role].get_children(),
                                    key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                                    reverse=True)
                # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
                for item_id in sorted_ids:
                    values = self.tree2_list[role].item(item_id, "values")
                    # 在这里进行你需要的操作，可以根据需要修改 values 的内容
                    self.tree2_list[role].insert("", "end", values=values)
                    self.tree2_list[role].delete(item_id)
                    self.tree2_list[role].update()

    def clear_information(self, role=None):
        if role == "KP":
            self.tree_main.delete(*self.tree_main.get_children())
        else:
            self.tree_list[role].delete(*self.tree_list[role].get_children())
            self.tree2_list[role].delete(*self.tree2_list[role].get_children())

    def calculator(self):
        self.dialog = DiceRollDialog(self.new_window, f"信息扩散器 & 调查进度计算器")
        result = self.dialog.result

    def expand_information(self, role=None):
        _number = 0
        for role in self.roles:
            _number += 1
            _string = "PL " + str(_number + 2)
            if role == "PL 1" or role == "PL 4" or role == "PL 7":  # 最大支持到7个PL，后续可以用算式取代
                pass
            else:
                if self.info_toggle[role] == "off":
                    if role == "KP":
                        self.tree_main.grid_forget()
                        self.info_toggle[role] = "on"
                        # self.frames["KP"].grid_forget()
                    else:
                        self.tree_list[role].grid_forget()  # 缩进
                        self.tree2_list[role].grid_forget()
                        self.info_toggle[role] = "on"
                else:
                    if role == "KP":
                        # self.frames["KP"].grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                        self.tree_main.grid(row=1, column=3, sticky="nsew")
                        self.KP_entry.grid(row=0, column=3, padx=0, pady=0, sticky="nsew")
                        self.info_toggle[role] = "off"
                    else:
                        self.tree_list[role].grid(row=0, column=4, sticky="nsew")
                        self.tree2_list[role].grid(row=2, column=4, sticky="nsew")
                        self.info_toggle[role] = "off"

    def add_inference2self(self, name, info, memory_index, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            return
        self.tree_list[role].insert("", "end", values=(name, info, memory_index))
        # 获取 Treeview 中所有条目的ID，并按记忆指数从大到小排序
        sorted_ids = sorted(self.tree_list[role].get_children(), key=lambda x: self.tree_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree_list[role].insert("", "end", values=values)
            self.tree_list[role].delete(item_id)
            self.tree_list[role].update()

    def add_inference2self2(self, name, info, memory_index, status, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            return
        self.tree2_list[role].insert("", "end", values=(name, info, memory_index, status))
        sorted_ids = sorted(self.tree2_list[role].get_children(), key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree2_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree2_list[role].insert("", "end", values=values)
            self.tree2_list[role].delete(item_id)
            self.tree2_list[role].update()

    def add_inference2public(self, name, info, statement, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            self.tree_main.insert("", "end", values=(name, info, "未知", statement))
        else:
            self.tree_main.insert("", "end", values=(name, info, self.role_entries_name[role], statement))

    def load_treeview_data(self, treeview, filename, role=None):
        try:
            with open(filename, 'r', encoding='utf-8') as file:
                data_ = json.load(file)
                if data_:
                    if role == "KP":
                        data = data_[role]
                        for item_data in data:
                            treeview.insert('', 'end', values=item_data)
                    else:
                        if role in data_:
                            data = data_[role]
                            for item_data in data:
                                treeview.insert('', 'end', values=item_data)
        except FileNotFoundError:
            print(f"文件 '{filename}' 不存在")

    def on_closing_new_window(self):
        with open('GameSaves/Deduction_infos_base.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree2_list[role].get_children():
                        values = self.tree2_list[role].item(item, 'values')
                        value_list.append(values)
                else:
                    for item in self.tree_main.get_children():
                        values = self.tree_main.item(item, 'values')
                        value_list.append(values)
                data[role] = value_list
            json.dump(data, file, ensure_ascii=False)
        with open('GameSaves/Deduction_infos_new.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree_list[role].get_children():
                        values = self.tree_list[role].item(item, 'values')
                        value_list.append(values)
                    data[role] = value_list
            json.dump(data, file, ensure_ascii=False)
        # self.new_window.destroy()

    def on_closing_new_window_close(self):
        global Is_Opened
        Is_Opened = False
        self.new_window_button = tk.Button(root, text="调查模块", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")
        with open('GameSaves/Deduction_infos_base.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree2_list[role].get_children():
                        values = self.tree2_list[role].item(item, 'values')
                        value_list.append(values)
                else:
                    for item in self.tree_main.get_children():
                        values = self.tree_main.item(item, 'values')
                        value_list.append(values)
                data[role] = value_list
            json.dump(data, file, ensure_ascii=False)
        with open('GameSaves/Deduction_infos_new.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree_list[role].get_children():
                        values = self.tree_list[role].item(item, 'values')
                        value_list.append(values)
                    data[role] = value_list
            json.dump(data, file, ensure_ascii=False)
        self.new_window.destroy()

    # 新窗口
    def open_new_window(self):
        global Is_Opened
        if Is_Opened:
            #messagebox.showwarning("调查模块已开启！", "请勿重复打开以免产生BUG！")
            self.new_window.focus_set()
            return
        self.new_window = tk.Toplevel(root)
        self.new_window.title("调查模块")

        # self.new_window.grid_rowconfigure(0, weight=1)
        # self.new_window.grid_columnconfigure(0, weight=1)
        self.info_add_button = {}
        self.thoughts = {}
        self.tree_list = {}
        self.tree2_list = {}
        self.info_upload_button = {}
        self.info_delete_button = {}
        self.info_expand_button = {}
        self.info_toggle = {}
        self.frames = {}

        num_cols = 3
        for idx, role in enumerate(self.roles):
            self.info_toggle[role] = "off"
            row = idx % num_cols
            col = idx // num_cols
            # 自动调整列宽
            for i in range(num_cols + 2):
                self.new_window.columnconfigure(i, weight=1)
            if role == "KP":
                frame = tk.LabelFrame(self.new_window, text="共享库", relief=tk.GROOVE)
                frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                self.frames["KP"] = frame
                clearKP_button = tk.Button(frame, text="清\n空\n信\n息", bg="red", fg="black",
                                           command=lambda role=role: self.clear_information(role))
                clearKP_button.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")
                saveKP_button = tk.Button(frame, text="保\n存\n所\n有", bg="black", fg="white",
                                          command=self.on_closing_new_window)
                saveKP_button.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                deleteKP_button = tk.Button(frame, text="删\n除\n信\n息",
                                            command=lambda role=role: self.delete_information(role))
                deleteKP_button.grid(row=1, column=1, pady=5, sticky="nsew")
                # loadKP_button = tk.Button(frame, text="读\n取", command=self.load_treeview_data)
                # loadKP_button.grid(row=1, column=2, pady=5, sticky="nsew")
                map_button = tk.Button(frame, text="绘\n制\n地\n图", bg="green", fg="white",
                                       command=self.open_new_window_map)
                map_button.grid(row=0, column=1, pady=5, sticky="nsew")
                cal_button = tk.Button(frame, text="扩\n散\n计\n算", bg="blue", fg="white", command=self.calculator)
                cal_button.grid(row=1, column=2, pady=5, sticky="nsew")
                # frame.grid_rowconfigure(0, weight=1)
                # frame.grid_columnconfigure(0, weight=1)
                add_button = tk.Button(frame, text="添\n加\n信\n息",
                                       command=lambda role=role: self.add_information_public(role))
                add_button.grid(row=0, column=2, pady=5, sticky="nsew")
                self.info_add_button[role] = add_button
            else:
                if role == "DiceBot":
                    frame = tk.LabelFrame(self.new_window, text="NPC", relief=tk.GROOVE)
                    frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                    # frame.grid_rowconfigure(0, weight=1)
                    # frame.grid_columnconfigure(0, weight=1)
                else:
                    frame = tk.LabelFrame(self.new_window, text=f"{role} - {self.role_entries_name[role]}",
                                          relief=tk.GROOVE)
                    frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                self.frames[role] = frame
                # frame.grid_rowconfigure(0, weight=1)
                # frame.grid_columnconfigure(0, weight=1)

                forget_button = tk.Button(frame, text="遗\n忘\n信\n息",
                                          command=lambda role=role: self.forget_information(role))
                forget_button.grid(row=2, column=2, pady=5, sticky="nsew")
                upload_button = tk.Button(frame, text="分\n享\n信\n息",
                                          command=lambda role=role: self.upload_information(role))
                upload_button.grid(row=0, column=1, pady=5, sticky="nsew")
                add_button = tk.Button(frame, text="添\n加\n信\n息", command=lambda role=role: self.add_information(role))
                add_button.grid(row=0, column=2, pady=5, sticky="nsew")
                self.info_add_button[role] = add_button
                delete_button = tk.Button(frame, text="删\n除\n信\n息",
                                          command=lambda role=role: self.delete_information(role))
                delete_button.grid(row=2, column=1, pady=5, sticky="nsew")
                clear_button = tk.Button(frame, text="清\n空\n信\n息", bg="red", fg="black",
                                         command=lambda role=role: self.clear_information(role))
                clear_button.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

                expand_button = tk.Button(frame, text="展\n开\n收\n起",
                                          command=lambda role=role: self.expand_information(role))
                expand_button.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                self.info_expand_button[role] = expand_button
            # 使用style修改Treeview的样式
            style = ttk.Style()
            style.configure("Treeview", font=(None, 10), rowheight=12, height=5, sticky="nsew",
                            maxheight=5)  # 设置表头的字体大小

            if role == "KP":
                self.KP_entry = tk.Text(frame, wrap=tk.WORD, width=10, height=12, undo=True)
                self.KP_entry.insert(tk.END, "← 关闭此窗口触发自动保存，也可以手动点击此按钮保存！\n此处可以自由编辑文本，对程序不存在任何影响")
                self.KP_entry.grid(row=0, column=3, padx=0, pady=0, sticky="nsew")
                # 创建Treeview
                self.tree_main = ttk.Treeview(frame, columns=("信息来源", "信息内容", "共享人", "共享想法"), show="headings",
                                              style="Treeview")
                self.tree_main.heading("信息来源", text="信息来源")
                self.tree_main.heading("信息内容", text="信息内容")
                self.tree_main.heading("共享人", text="共享人")
                self.tree_main.heading("共享想法", text="共享想法")
                self.tree_main.column("信息来源", width=100)
                self.tree_main.column("信息内容", width=200)
                self.tree_main.column("共享人", width=50)
                self.tree_main.column("共享想法", width=100)
                self.tree_main.grid(row=1, column=3, sticky="nsew")
                # 设置行和列的权重，使得Treeview可以随窗口的大小变化而调整
                self.tree_main.grid_rowconfigure(0, weight=1)
                self.load_treeview_data(self.tree_main, "GameSaves/Deduction_infos_base.json", role)
            else:
                entry2 = tk.Text(frame, wrap=tk.WORD, width=1, height=1, undo=True)
                entry2.grid(row=1, column=4, padx=0, pady=0, sticky="nsew")
                self.thoughts[role] = entry2
                # 创建Treeview
                self.tree = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数"), show="headings",
                                         style="Treeview")
                self.tree_list[role] = self.tree
                # 创建Treeview
                self.tree2 = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数", "记忆状态"), show="headings",
                                          style="Treeview")
                self.tree2_list[role] = self.tree2
                # 添加标签以供后续使用
                self.tree2.tag_configure('red_background', background='red')
                self.tree2.bind("<Double-1>", lambda event, role=role: self.on_double_click2(event, role))
                self.tree.bind("<Double-1>", lambda event, role=role: self.on_double_click(event, role))

                # 创建Scrollbar
                # scrollbar = ttk.Scrollbar(self.new_window, orient="vertical", command=self.tree.yview)
                # 配置Treeview的yview和Scrollbar的command
                # self.tree.configure(yscrollcommand=scrollbar.set)
                # scrollbar.grid(row=0, column=1, sticky="ns")
                # self.tree.bind("<Double-1>", self.on_double_click())

                # 设置表头
                self.tree.heading("信息来源", text="来源")
                self.tree.heading("信息内容", text="内容")
                self.tree.heading("记忆指数", text="指数")
                self.tree2.heading("信息来源", text="来源")
                self.tree2.heading("信息内容", text="内容")
                self.tree2.heading("记忆指数", text="指数")
                self.tree2.heading("记忆状态", text="状态")

                # 设置列宽
                self.tree.column("信息来源", width=130)
                self.tree.column("信息内容", width=310)
                self.tree.column("记忆指数", width=10)
                self.tree2.column("信息来源", width=130)
                self.tree2.column("信息内容", width=300)
                self.tree2.column("记忆指数", width=10)
                self.tree2.column("记忆状态", width=10)

                # 将Treeview放置在窗口中，使用grid布局
                self.tree.grid(row=0, column=4, sticky="nsew")
                # 将Treeview放置在窗口中，使用grid布局
                self.tree2.grid(row=2, column=4, sticky="nsew")

                # 设置行和列的权重，使得Treeview可以随窗口的大小变化而调整
                self.tree.grid_rowconfigure(0, weight=1)
                self.tree.grid_columnconfigure(0, weight=1)
                self.tree2.grid_rowconfigure(0, weight=1)
                self.tree2.grid_columnconfigure(0, weight=1)

                self.load_treeview_data(self.tree2_list[role], "GameSaves/Deduction_infos_base.json", role)
                self.load_treeview_data(self.tree_list[role], "GameSaves/Deduction_infos_new.json", role)

                # 添加示例数据
                # self.add_inference2public("玩家1", "关于X的信息", "关于X的信息")
                if role == "DiceBot":
                    # self.add_inference2self("xxx", "xxx的可能性", 0, role)
                    pass
                # self.add_inference("玩家2", "关于Y的信息", 5, "√")
            # 配置可调整大小的框架
            # 绑定关闭事件
        self.new_window.protocol("WM_DELETE_WINDOW", self.on_closing_new_window_close)
        Is_Opened = True
        self.new_window_button = tk.Button(root, text="已开启！", background="red", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

    # update
    def update_map(self):
        global frame_Map
        global role_Chart_at_name
        self.time_label2.config(text=self.time_log.get("1.0", tk.END).strip())
        for _avatar in self.role_entries:
            if _avatar not in self.draggable_items:
                radius = 0.08
                x = 100
                y = 50
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    with open(self.role_avatar_paths[_avatar], "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_new_map.append(photo)

                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[
                                         _avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"

                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]

                        current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         label=label_text,
                                                                         label2=label_text2, type="image_animate",
                                                                         frame=frame_Map)

                        self.draggable_items[_avatar] = current_frame_map[frame_Map]
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        frame_Map += 1
                    else:
                        draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, label=label_text,
                                                            label2=label_text2, type='image')
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        self.draggable_items[_avatar] = draggable_image
                else:
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[
                                         _avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    if _avatar in self.role_values_entry:
                        label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                    else:
                        label_text2 = f"H{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['HP'])} S{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['SAN'])} M{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['MOV'])}"

                    draggable_image = DraggableItem(self.canvas, x, y, 50, 50, fill='', outline='black',
                                                    label=label_text, label2=label_text2,
                                                    type="text")
                    y += 100
                    self.draggable_items[_avatar] = draggable_image
            if _avatar == "DiceBot":
                pass
            else:
                if "NPC_name" in _avatar:
                    if _avatar.split("NPC_name")[1]:
                        name_ = _avatar.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                else:
                    label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                if "===状态===" in self.role_values_entry[_avatar].get("1.0", tk.END):
                    status_list = self.role_values_entry[_avatar].get("1.0", tk.END).split("===状态===")[1].split("===")[0].split("\n")
                    for s in status_list:
                        if s.strip() != "":
                            label_text += " †" +s
                radius = 0.08
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    with open(self.role_avatar_paths[_avatar], "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_new_map.append(photo)
                        # Create draggable image
                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        photo = frames_map[frame_Map][0]
                else:
                    photo = ""
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    self.draggable_items[_avatar].config(label=label_text, label2=label_text2, image=photo)
                else:
                    self.draggable_items[_avatar].config(label=label_text, label2=label_text2, image=photo)
        self.canvas.after(500, self.update_map)

    # 地图新窗口
    def open_new_window_map(self):
        global frame_Map
        new_window = tk.Toplevel(self.new_window)
        new_window.title("简易地图")

        self.image_references = []  # Add this list attribute to store references to images

        text = self.time_log.get("1.0", tk.END).strip()
        label = tk.Label(new_window,
                         text="地图即时使用，信息不互通，关闭即销毁: [右键]绘图/副本 | [右键角色/无图则❤]载入战斗图像 | [右键DiceBot]载入指示物 | [右键战斗图像]销毁 | [单击标签/❤]编辑 | [中键拖拽标签]缩放(仅限矩形和圆)")
        label.pack()

        self.time_label2 = tk.Label(new_window,
                          text=text)
        self.time_label2.pack()
        # 创建 Canvas 组件
        self.canvas = tk.Canvas(new_window, width=400, height=400, bg="white")
        self.canvas.pack(fill=tk.BOTH, expand=True)

        if os.path.exists('GameSaves/canvas_state.json'):
            # saver = CanvasSaver(self.canvas)
            # saver.load_canvas_state('GameSaves/canvas_state.json')
            # print("发现了保存State，读取旧地图...")
            pass
        else:
            print("无保存State，创建新地图...")

            # 记录鼠标位置
            self.start_x = None
            self.start_y = None

            # 绑定鼠标事件
            self.canvas.bind("<B3-Motion>", self.draw)
            self.canvas.bind("<Button-3>", self.set_start_point)

            # self.canvas.bind("<B1-Motion>", self.erase)
            # self.canvas.bind("<Button-1>", self.set_erase_point)

            self.draggable_items = {}
            radius = 0.08
            x = 100
            y = 50
            divide_col = int(len(self.role_entries) / 8)
            for _avatar in self.role_entries:
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    with open(self.role_avatar_paths[_avatar], "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image

                    # Add label below the image
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"

                    # Bind label's movement with image
                    # label_below_image_canvas = self.canvas.create_window(x-50, y+60, window=label_below_image, anchor=tk.NW)
                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        if _avatar == "DiceBot":
                            current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         type="DiceBotImage_animate",
                                                                         frame=frame_Map)
                        else:
                            current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         label=label_text,
                                                                         label2=label_text2, type="image_animate",
                                                                         frame=frame_Map)

                        self.draggable_items[_avatar] = current_frame_map[frame_Map]
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        frame_Map += 1
                    else:
                        if _avatar == "DiceBot":
                            draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, type='DiceBotImage')
                        else:
                            draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, label=label_text,
                                                            label2=label_text2, type='image')
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        self.draggable_items[_avatar] = draggable_image
                else:
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                    # Bind label's movement with image
                    # label_below_image_canvas = self.canvas.create_window(x-50, y+60, window=label_below_image, anchor=tk.NW)
                    draggable_image = DraggableItem(self.canvas, x, y, 50, 50, fill='', outline='black',
                                                    label=label_text, label2=label_text2,
                                                    type="text")
                    y += 100
                    self.draggable_items[_avatar] = draggable_image
            # Create draggable rectangle
            draggable_rectangle = DraggableItem(self.canvas, 150, 50, 100, 80, fill='', outline='black', label='标签',
                                                type='rectangle')
            draggable_rectangle = DraggableItem(self.canvas, 150, 100, 100, 100, fill='', outline='black', label='标签',
                                                type='circle')
            draggable_rectangle = DraggableItem(self.canvas, 150, 150, 100, 80, fill='', outline='black', label='标签',
                                                type='oval')
            draggable_rectangle = DraggableItem(self.canvas, 150, 200, 100, 80, fill='', outline='black', label='标签',
                                                type='polygon3')
            draggable_rectangle = DraggableItem(self.canvas, 150, 250, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon6')
            draggable_rectangle = DraggableItem(self.canvas, 150, 300, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon8')
            draggable_rectangle = DraggableItem(self.canvas, 150, 350, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon5')
            draggable_rectangle = DraggableItem(self.canvas, 150, 400, 50, 50, fill='', outline='black', label='标签',
                                                type='polygonStar')
            # draggable_rectangle = DraggableItem(self.canvas, 150, 150, 100, 80, fill='white', outline='black', label='text',
            # type='line')
            draggable_rectangle = DraggableItem(self.canvas, 150, 450, 50, 50, fill='', outline='black', label='标签',
                                                type='text')
        # 绑定关闭事件
        # new_window.protocol("WM_DELETE_WINDOW", self.on_close_map)
        self.canvas.after(500, self.update_map)

    def on_close_map(self):
        if messagebox.askokcancel("储存进度？", "要保存地图State吗？"):
            saver = CanvasSaver(self.canvas)
            # Save canvas state to a JSON file
            saver.save_canvas_state('GameSaves/canvas_state.json')
        else:
            if os.path.exists('GameSaves/canvas_state.json'):
                os.remove('GameSaves/canvas_state.json')

    def save_settings(self):
        global bot_personality_by_name
        # 保存初始化状态icon注册
        with open('AppSettings/status_icon_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.status_icon, file, ensure_ascii=False)
        # 保存初始化物品栏
        with open('GameSaves/item_settings_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_items, file, ensure_ascii=False)
        # 将角色luck统计保存到JSON文件
        with open('GameSaves/skill_menu_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_skill_menu, file, ensure_ascii=False)
        # 将角色luck统计保存到JSON文件
        with open('Bots/luck_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.luck_by_name, file, ensure_ascii=False)
        # 将角色codename保存到JSON文件
        with open('AppSettings/codename_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.codename_by_name, file, ensure_ascii=False)
        # 将头像路径保存到JSON文件
        with open('AppSettings/avatar_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_avatar_paths, file, ensure_ascii=False)
        # 将状态Icon路径保存到JSON文件
        with open('GameSaves/icon_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_Icon_paths, file, ensure_ascii=False)
        # 将姓名牌路径保存到JSON文件
        with open('AppSettings/name_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_entries_name, file, ensure_ascii=False)
        # 将角色简卡路径保存到JSON文件
        with open('AppSettings/infoCanvas_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.infoCanvas_data, file, ensure_ascii=False)
        # 将差分目录路径保存到JSON文件
        with open('AppSettings/avatar_dir_path.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_dir_path, file, ensure_ascii=False)
        with open('AppSettings/infoCanvas_data_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.infoCanvas_data_by_name, file, ensure_ascii=False)
        # 将角色可变数值保存到JSON文件
        with open('GameSaves/health_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.health_data, file, ensure_ascii=False)
        with open('GameSaves/health_data_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.health_data_by_name, file, ensure_ascii=False)
        # 尝试保存自定义角色数值信息
        for role in self.roles:
            self.role_values_tags_text[role] = self.role_values_entry[role].get("1.0", tk.END).strip()
        with open('GameSaves/pl_info.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_values_tags_text, file, ensure_ascii=False)
        # 尝试保存地点时间天气信息
        with open('GameSaves/env_info.json', 'w', encoding='utf-8') as file:
            info = self.time_log.get("1.0", tk.END).strip()
            info = info.split("【时间】")[1]
            env["Date"] = info.split("【日期】")[1]
            env["Time"] = info.split("【地点】")[0]
            info = info.split("【地点】")[1]
            env["Place"] = info.split("【天气】")[0]
            info = info.split("【天气】")[1]
            env["Weather"] = info.split("【日期】")[0]
            json.dump(env, file, ensure_ascii=False)
        # 保存自定义角色数值信息
        with open('GameSaves/pl_Chart.json', 'w', encoding='utf-8') as file:
            json.dump(role_Chart, file, ensure_ascii=False)
        with open('Bots/bot_personality_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(bot_personality_by_name, file, ensure_ascii=False)
        # 保存自定义角色数值信息
        with open('GameSaves/PL_Chart_Save.txt', 'w', encoding='utf-8') as txt_file:
            for role, skills in role_Chart.items():
                txt_file.write(f"【{role}】-{self.role_entries_name[role]}\n.st")
                for skill, value in skills.items():
                    if skill == "_AvatarPath":  # or ("#" in skill) or (skill == "DB")
                        pass
                    else:
                        txt_file.write(f"{skill}{value} ")
                txt_file.write("\n\n\n")
        # 按姓名牌保存自定义角色数值信息
        self.save_role_skill_at_name()
        print("设置已保存！")

    def save_role_skill_at_name(self):
        global role_Chart_at_name
        with open('GameSaves/pl_Chart_at_name.json', 'w', encoding='utf-8') as file:
            dic = role_Chart_at_name.copy()
            for role, skills in role_Chart.items():
                dicSkill = {}
                for skill, value in skills.items():
                    dicSkill[skill] = value
                dicSkill["_AvatarPath"] = ""
                if role in self.role_avatar_paths:
                    # 保存头像路径
                    dicSkill["_AvatarPath"] = self.role_avatar_paths[role]
                if "PL " not in self.role_entries_name[role]:
                    dic[self.role_entries_name[role]] = dicSkill.copy()
            json.dump(dic, file, ensure_ascii=False)

    def save_role_count(self):
        # 保存角色数量到配置文件
        config = configparser.ConfigParser()
        config['Settings'] = {'RoleCount': str(self.role_count)}
        with open('AppSettings/config.ini', 'w') as configfile:
            config.write(configfile)

    def quickSave(self):
        # 退出时quicksave
        timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
        # datestamp = datetime.now().strftime("%Y-%m-%d")
        filename = f"QuickSaves/{log_file_last_name}.QuickSave_{timestamp}.txt"
        chat_log_content = self.chat_log.get("1.0", tk.END)
        with open(filename, "w", encoding='utf-8') as file:
            file.write(chat_log_content)
        self.save_settings()

    def on_closing(self):
        # 在关闭窗口前保存设置
        self.save_settings()
        # 退出时保存当前角色数量
        self.save_role_count()
        self.quickSave()
        self.root.destroy()


class TRPGModule:
    def __init__(self, chat_app_instance, root):
        self.random_seed = None
        self.ChatApp = chat_app_instance
        self.root = root
        adv_comment = ""

    def skill_upgrade(self, info_, skill_name, role):
        if "NPC_name" in role:
            return ""
        upgrade = ""
        if "None" not in skill_name and "教育" not in skill_name and "魅力" not in skill_name and "力量" not in skill_name and "敏捷" not in skill_name and "外貌" not in skill_name and "智力" not in skill_name and "体质" not in skill_name and "灵感" not in skill_name and "意志" not in skill_name and "体型" not in skill_name and "信用" not in skill_name and "幸运" not in skill_name and "MOV" not in skill_name and "HP" not in skill_name and "MP" not in skill_name and "SAN" not in skill_name and "克苏鲁" not in skill_name and (
                f".st{skill_name}" not in self.ChatApp.role_values_entry[role].get("1.0",
                                                                                   tk.END).strip()) and skill_name != "" and "DB" not in skill_name:  # 成长检定
            # 执行d100掷骰
            rolls = [random.randint(1, 100) for _ in range(1)]
            result = sum(rolls)
            if result >= info_ or result >= 96:
                # 执行d10掷骰
                rolls = [random.randint(1, 10) for _ in range(1)]
                result2 = sum(rolls)
                upgrade = "[成长检定]【" + skill_name + "】技能获得了成长(1D100=" + str(result) + "/" + str(info_) + "):D10=" + str(
                    result2)
                result3 = role_Chart[role][skill_name] + result2
                self.ChatApp.role_values_entry[role].insert(tk.END, f'\n.st{skill_name}{str(result3)}')
            else:
                upgrade = "[成长检定]【" + skill_name + "】技能的成长检定(1D100=" + str(result) + "/" + str(info_) + ")败北了..."
        return upgrade

    def skill_comment(self, role=None, skill=None):
        if skill and role:
            if "NPC_name" not in role:
                _Critical_Success_list = []
                _Extreme_Success_list = []
                _Hard_Success_list = []
                _Success_list = []
                _Failure_list = []
                _Fumble_list = []
                if skill in bot_personality["Critical_Success"] and role in bot_personality["Critical_Success"]:
                    _Critical_Success_list = bot_personality["Critical_Success"][skill] + \
                                             bot_personality["Critical_Success"][role]
                else:
                    bot_personality["Critical_Success"][skill] = bot_personality["Critical_Success"]["通用"]
                    bot_personality["Critical_Success"][role] = bot_personality["Critical_Success"]["通用"]
                    _Critical_Success_list = bot_personality["Critical_Success"][skill] + \
                                             bot_personality["Critical_Success"][role]
                if skill in bot_personality["Extreme_Success"] and role in bot_personality["Extreme_Success"]:
                    _Extreme_Success_list = bot_personality["Extreme_Success"][skill] + \
                                            bot_personality["Extreme_Success"][role]
                else:
                    bot_personality["Extreme_Success"][skill] = bot_personality["Extreme_Success"]["通用"]
                    bot_personality["Extreme_Success"][role] = bot_personality["Extreme_Success"]["通用"]
                    _Extreme_Success_list = bot_personality["Extreme_Success"][skill] + \
                                            bot_personality["Extreme_Success"][role]
                if skill in bot_personality["Hard_Success"] and role in bot_personality["Hard_Success"]:
                    _Hard_Success_list = bot_personality["Hard_Success"][skill] + bot_personality["Hard_Success"][role]
                else:
                    bot_personality["Hard_Success"][skill] = bot_personality["Hard_Success"]["通用"]
                    bot_personality["Hard_Success"][role] = bot_personality["Hard_Success"]["通用"]
                    _Hard_Success_list = bot_personality["Hard_Success"][skill] + bot_personality["Hard_Success"][
                        role]
                if skill in bot_personality["Success"] and role in bot_personality["Success"]:
                    _Success_list = bot_personality["Success"][skill] + bot_personality["Success"][role]
                else:
                    bot_personality["Success"][skill] = bot_personality["Success"]["通用"]
                    bot_personality["Success"][role] = bot_personality["Success"]["通用"]
                    _Success_list = bot_personality["Success"][skill] + bot_personality["Success"][role]
                if skill in bot_personality["Failure"] and role in bot_personality["Failure"]:
                    _Failure_list = bot_personality["Failure"][skill] + bot_personality["Failure"][role]
                else:
                    bot_personality["Failure"][skill] = bot_personality["Failure"]["通用"]
                    bot_personality["Failure"][role] = bot_personality["Failure"]["通用"]
                    _Failure_list = bot_personality["Failure"][skill] + bot_personality["Failure"][role]
                if skill in bot_personality["Fumble"] and role in bot_personality["Fumble"]:
                    _Fumble_list = bot_personality["Fumble"][skill] + bot_personality["Fumble"][role]
                else:
                    bot_personality["Fumble"][skill] = bot_personality["Fumble"]["通用"]
                    bot_personality["Fumble"][role] = bot_personality["Fumble"]["通用"]
                    _Fumble_list = bot_personality["Fumble"][skill] + bot_personality["Fumble"][role]
                self.Critical_Success = random.choice(_Critical_Success_list)
                self.Extreme_Success = random.choice(_Extreme_Success_list)
                self.Hard_Success = random.choice(_Hard_Success_list)
                self.Success = random.choice(_Success_list)
                self.Failure = random.choice(_Failure_list)
                self.Fumble = random.choice(_Fumble_list)
        else:
            if skill:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"][skill])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"][skill])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"][skill])
                self.Success = random.choice(bot_personality["Success"][skill])
                self.Failure = random.choice(bot_personality["Failure"][skill])
                self.Fumble = random.choice(bot_personality["Fumble"][skill])
            elif role and "NPC_name" not in role:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"][role])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"][role])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"][role])
                self.Success = random.choice(bot_personality["Success"][role])
                self.Failure = random.choice(bot_personality["Failure"][role])
                self.Fumble = random.choice(bot_personality["Fumble"][role])
            else:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                self.Success = random.choice(bot_personality["Success"]["通用"])
                self.Failure = random.choice(bot_personality["Failure"]["通用"])
                self.Fumble = random.choice(bot_personality["Fumble"]["通用"])
        self.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
        self.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]

    def skill_check(self, info_, result):
        if result <= 5 and info_ >= Critical_Success_SKill:
            compare = "<"
            comment = self.Critical_Success
        elif result == 1:
            compare = "<"
            comment = self.Critical_Success
        elif result <= info_ // 5:
            compare = "<"
            comment = self.Extreme_Success
        elif result <= info_ // 2:
            compare = "<"
            comment = self.Hard_Success
        elif result <= info_:
            compare = "<"
            comment = self.Success
        elif result >= 96 and info_ < Fumble_SKill:
            compare = ">"
            comment = self.Fumble
        elif result == 100:
            compare = ">"
            comment = self.Fumble
        else:
            compare = ">"
            comment = self.Failure
        return comment

    def cal_advantage(self, result, advantage):
        global adv_comment
        adv_comment_1 = ""
        adv_comment_2 = ""
        if advantage is not None:
            list = []
            # 获取个位
            ones_place = result % 10
            # 获取十位
            tens_place = (result // 10) % 10
            list.append(tens_place)
            if "+" in advantage:
                for a in advantage["+"]:
                    if a == 10:
                        a = 0
                    list.append(a)
                # self.ChatApp.chat_log.insert(tk.END, f"\n优势骰：{list} = {max(list)}")
                adv_comment_1 = f"具备优势:{list}={min(list)}"
                result = ones_place + min(list) * 10
            list = [tens_place]
            if "-" in advantage:
                for a in advantage["-"]:
                    if a == 10:
                        a = 0
                    list.append(a)
                # self.ChatApp.chat_log.insert(tk.END, f"\n劣势骰：{list} = {min(list)}")
                adv_comment_2 = f"造成劣势:{list}={max(list)}"
                result = ones_place + max(list) * 10
            adv_comment = adv_comment_1 + adv_comment_2
        # if result > 100:
        # result = 100
        return result, adv_comment

    def roll(self, expression, role=None, allin=False):
        global date
        global time
        global place
        global weather
        HP_MP_check = ""
        fuhao = ""
        combine_infos = {}
        if self.random_seed is not None:
            random.seed(self.random_seed)
        info = None
        sc_success = ""
        sc_fail = ""
        skill_name = ""
        advantage = {}
        multi_num = 1
        self.skill_comment(role, expression)
        try:
            pattern = re.compile(r'[\u4e00-\u9fa5]')
            pattern_user = re.compile(r'([\u4e00-\u9fa5a-zA-Z]+)(\d+)')
            pattern_advantage = re.compile(r'^[+\-*/]')
            pattern_combine = re.compile(r'[\u4e00-\u9fa5a-zA-Z]+[\u4e00-\u9fa5a-zA-Z]')
            part_eng = pattern_user.findall(expression)
            part_combine = pattern_combine.findall(expression)
            # print(part_eng)
            if "HP" in expression.upper() or "MP" in expression.upper() or "SAN" in expression.upper() or "MOV" in expression.upper():
                print("HP/MP/SAN/MOV变化")
                if "HP" in expression.upper():
                    HP_MP_check = "HP"
                elif "MP" in expression.upper():
                    HP_MP_check = "MP"
                elif "SAN" in expression.upper():
                    HP_MP_check = "SAN"
                elif "MOV" in expression.upper():
                    HP_MP_check = "MOV"
                else:
                    HP_MP_check = ""
                expression = expression.upper().replace("HP", "").replace("MP", "").replace("SAN", "").replace("MOV",
                                                                                                               "")
            if pattern_combine.match(expression) and len(part_combine) > 1:
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                print("联合掷骰")  # 意志+斗殴+潜行
                # print(part_combine)
                for a in part_combine:
                    combine_infos[a] = role_Chart_detail[a]
                # print(role_Chart_detail)
                print(combine_infos)
                expression = "COMBINE CHECK"
            if pattern_advantage.match(expression) and HP_MP_check == "":
                print("优劣势掷骰")  # ++xxx
                expression_slice = expression
                matches = []
                while pattern_advantage.match(expression_slice):
                    matches.append(expression[0])
                    expression_slice = expression_slice[1:]
                # print(matches)
                for operator in matches:
                    num_operators = matches.count(operator)
                    roll_result = random.randint(1, 10)
                    # 如果运算符在字典中，将结果添加到相应的列表
                    if operator in advantage:
                        advantage[operator].append(roll_result)
                    else:
                        advantage[operator] = [roll_result]
                    expression = expression[1:]
                    print(expression)
                    print(advantage)
                # print(advantage)

            if ("sc" or "SC" or ".sc" or "。sc") in expression:
                print("SAN CHECK")  # sc1/1d5
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                info = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                if info == 0:
                    info = role_Chart_detail.get("POW")
                parts_ = expression.split('sc')
                if parts_[1] == "":
                    expression = "1d100"
                else:
                    parts_ = parts_[1].split('/')
                    # print(parts_)
                    sc_success = parts_[0].replace(" ", "")
                    sc_fail = parts_[1].replace(" ", "")
                    expression = "SAN CHECK"

            elif any(word in expression for word in ["san", "San", "SAN"]) and not any(
                    op in expression for op in ["+", "-", "*", "/"]):
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                info = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                if info == 0:
                    info = role_Chart_detail.get("POW")
                expression = "1d100"

            # elif expression == "COMBINE CHECK": # 对每个技能都掷骰的方案
            #     for a in combine_infos:
            #         expression = a
            #         info = int(combine_infos[a])
            #         if "困难" in expression or "极难" in expression:
            #             print("困难极难")
            #             print(expression)
            #             parts_ = expression.split('难')
            #             skill_name = parts_[1]
            #             if parts_[0] == "极":
            #                 info = int(combine_infos[a] / 5)
            #             if parts_[0] == "困":
            #                 info = int(combine_infos[a] / 2)
            #         # 执行掷骰
            #         rolls = [random.randint(1, 100) for _ in range(1)]
            #         result = sum(rolls)
            #         result, adv_comment = self.cal_advantage(result, advantage)
            #         if result <= 5 and info >= Critical_Success_SKill:
            #             compare = "<"
            #             comment = self.Critical_Success
            #             upgrade = self.skill_upgrade(0, skill_name, role)
            #         elif result == 1:
            #             compare = "<"
            #             comment = self.Critical_Success
            #             upgrade = self.skill_upgrade(0, skill_name, role)
            #         elif result <= info // 5:
            #             compare = "<"
            #             comment = self.Extreme_Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result <= info // 2:
            #             compare = "<"
            #             comment = self.Hard_Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result <= info:
            #             compare = "<"
            #             comment = self.Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result >= 96 and info < Fumble_SKill:
            #             compare = ">"
            #             comment = self.Fumble
            #             upgrade = ""
            #         elif result == 100:
            #             compare = ">"
            #             comment = self.Fumble
            #             upgrade = ""
            #         else:
            #             compare = ">"
            #             comment = self.Failure
            #             upgrade = ""
            #             # 执行算式
            #         print(f"{result}/{info}：{comment}\n\n{upgrade}")

            elif expression == "COMBINE CHECK":
                rolls = [random.randint(1, 100) for _ in range(1)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                infos = []
                upgrades = []
                comments = []

                time_info = self.ChatApp.time_log.get("1.0", tk.END).strip()
                time_info = time_info.split("【时间】")[1]
                date = time_info.split("【日期】")[1]
                time = time_info.split("【地点】")[0]
                time_info = time_info.split("【地点】")[1]
                place = time_info.split("【天气】")[0]
                time_info = time_info.split("【天气】")[1]
                weather = time_info.split("【日期】")[0]

                # 自动计算时间
                for a in combine_infos:
                    for timer, timerlist in time_skill.items():
                        for skillname in timerlist:
                            if a == skillname:
                                if allin:
                                    if (timer == "time_1s") or (timer == "time_3s") or (timer == "time_1min"):
                                        self.move_time_forward(timer)
                                    elif timer == "time_5min":
                                        self.move_time_forward("time_1min")
                                    elif timer == "time_10min":
                                        self.move_time_forward("time_5min")
                                    elif timer == "time_30min":
                                        self.move_time_forward("time_10min")
                                    elif timer == "time_1h":
                                        self.move_time_forward("time_30min")
                                    elif timer == "time_3h":
                                        self.move_time_forward("time_1h")
                                    elif timer == "time_12h":
                                        self.move_time_forward("time_3h")
                                    elif timer == "time_1d":
                                        self.move_time_forward("time_12h")
                                    elif timer == "time_1w":
                                        self.move_time_forward("time_1d")
                                    else:
                                        self.move_time_forward("time_5min")
                                else:
                                    self.move_time_forward(timer)
                    expression = a
                    info = combine_infos[a]
                    skill_name = a
                    if "困难" in expression or "极难" in expression:
                        print("困难极难")
                        print(expression)
                        parts_ = expression.split('难')
                        skill_name = parts_[1]
                        if parts_[0] == "极":
                            info = int(combine_infos[a] / 5)
                        if parts_[0] == "困":
                            info = int(combine_infos[a] / 2)
                    infos.append(info)
                    # 执行掷骰
                    if result <= 5 and info >= Critical_Success_SKill:
                        compare = "<"
                        comment = "大成功！！"
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result == 1:
                        compare = "<"
                        comment = "大成功！！"
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result <= info // 5:
                        compare = "<"
                        comment = "极难成功！"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result <= info // 2:
                        compare = "<"
                        comment = "困难成功"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result <= info:
                        compare = "<"
                        comment = "成功"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result >= 96 and info < Fumble_SKill:
                        compare = ">"
                        comment = "大失败！"
                        upgrade = ""
                    elif result == 100:
                        compare = ">"
                        comment = "大失败！"
                        upgrade = ""
                    else:
                        compare = ">"
                        comment = "失败"
                        upgrade = ""
                        # 执行算式
                    upgrades.append(upgrade)
                    comments.append(comment)
                    # print(f"{result}/{info}：{comment}\n\n{upgrade}")
                str_ = '\n'.join(upgrades).strip()
                return f"{result}/{infos}:{'/'.join(comments)}：{str_}"

            elif HP_MP_check == "" and (bool(pattern.search(expression)) or part_eng[0][0] != "d"):
                expression_num = 0
                print("技能检定")
                # print(part_eng[0][0])
                # print(part_eng[0][1])
                print(expression)
                if "+" in expression or "-" in expression:
                    print("补正骰")
                    if "+" in expression:
                        expression_num = expression.split("+")[1]
                        expression = expression.split("+")[0]
                    if "-" in expression:
                        expression_num = expression.split("-")[1] * (-1)
                        expression = expression.split("-")[0]
                if part_eng and part_eng[0] and part_eng[0][1] is not None:
                    print("技能检定+数值")
                    expression = part_eng[0][0]
                    info = int(part_eng[0][1])
                    skill_name = "None"

                time_info = self.ChatApp.time_log.get("1.0", tk.END).strip()
                time_info = time_info.split("【时间】")[1]
                date = time_info.split("【日期】")[1]
                time = time_info.split("【地点】")[0]
                time_info = time_info.split("【地点】")[1]
                place = time_info.split("【天气】")[0]
                time_info = time_info.split("【天气】")[1]
                weather = time_info.split("【日期】")[0]

                # 自动计算时间

                for timer, timerlist in time_skill.items():
                    for skillname in timerlist:
                        if expression == skillname:
                            if allin:
                                if (timer == "time_1s") or (timer == "time_3s") or (timer == "time_1min"):
                                    self.move_time_forward(timer)
                                elif timer == "time_5min":
                                    self.move_time_forward("time_1min")
                                elif timer == "time_10min":
                                    self.move_time_forward("time_5min")
                                elif timer == "time_30min":
                                    self.move_time_forward("time_10min")
                                elif timer == "time_1h":
                                    self.move_time_forward("time_30min")
                                elif timer == "time_3h":
                                    self.move_time_forward("time_1h")
                                elif timer == "time_12h":
                                    self.move_time_forward("time_3h")
                                elif timer == "time_1d":
                                    self.move_time_forward("time_12h")
                                elif timer == "time_1w":
                                    self.move_time_forward("time_1d")
                                else:
                                    self.move_time_forward("time_5min")
                            else:
                                self.move_time_forward(timer)
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                if "困难" in expression or "极难" in expression:
                    print("困难极难")
                    print(expression)
                    parts_ = expression.split('难')
                    skill_name = parts_[1]
                    if parts_[0] == "极":
                        info = int(role_Chart_detail.get(parts_[1]) / 5)
                    if parts_[0] == "困":
                        info = int(role_Chart_detail.get(parts_[1]) / 2)
                else:
                    # print(expression)
                    if info == None:
                        if skill_name == "None":
                            skill_name = "None"
                        else:
                            skill_name = expression
                        info = role_Chart_detail.get(expression)  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        print("info == None")
                    # print(info)
                if str(info).isalpha():
                    info = role_Chart_detail.get(info)
                    # print(info)
                expression = "1d100"
                info += int(expression_num)
            if expression == "SAN CHECK":
                # 解析表达式
                expression = "1d100"
                parts = expression.split('d')
                num_rolls = int(parts[0])
                num_faces = int(parts[1])
                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info >= result:
                    if "d" in sc_success:
                        expression = sc_success
                        parts = expression.split('d')
                        num_rolls = int(parts[0])
                        num_faces = int(parts[1])
                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result2 = sum(rolls)
                        if result2 == 0:
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功！司空见惯！"
                        else:
                            role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                            POW = role_Chart[role].get("POW")
                            SAN = role_Chart[role].get("SAN")
                            if "#SAN" in role_Chart[role]:
                                SAN_ = role_Chart[role].get("#SAN")
                            else:
                                SAN_ = 100
                            self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                            self.ChatApp.role_values_entry[role].insert("1.0",
                                                                        f'{SAN}/{SAN_}:SAN\n')
                            self.ChatApp.chat_log.insert(tk.END,
                                                         f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功，扣除{result2}点SAN。"
                    else:
                        result2 = int(sc_success)
                        if result2 == 0:
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={result2}：San Check成功！司空见惯！"
                        else:
                            role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                            POW = role_Chart[role].get("POW")
                            SAN = role_Chart[role].get("SAN")
                            if "#SAN" in role_Chart[role]:
                                SAN_ = role_Chart[role].get("#SAN")
                            else:
                                SAN_ = 100
                            self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                            self.ChatApp.role_values_entry[role].insert("1.0",
                                                                        f'{SAN}/{SAN_}:SAN\n')
                            self.ChatApp.chat_log.insert(tk.END,
                                                         f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={result2}：San Check成功，扣除{result2}点SAN。"
                else:
                    if "d" in sc_fail:
                        expression = sc_fail
                        parts = expression.split('d')
                        num_rolls = int(parts[0])
                        num_faces = int(parts[1])
                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result2 = sum(rolls)
                        role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                        POW = role_Chart[role].get("POW")
                        SAN = role_Chart[role].get("SAN")
                        if "#SAN" in role_Chart[role]:
                            SAN_ = role_Chart[role].get("#SAN")
                        else:
                            SAN_ = 100
                        self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                        self.ChatApp.role_values_entry[role].insert("1.0",
                                                                    f'{SAN}/{SAN_}:SAN\n')
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                        self.ChatApp.update_health_bar(role)
                        return f"{result}/{info}={sc_fail.upper()}={result2}：San Check失败！扣除{result2}点SAN。"
                    else:
                        result2 = int(sc_fail)
                        role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                        POW = role_Chart[role].get("POW")
                        SAN = role_Chart[role].get("SAN")
                        if "#SAN" in role_Chart[role]:
                            SAN_ = role_Chart[role].get("#SAN")
                        else:
                            SAN_ = 100
                        self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                        self.ChatApp.role_values_entry[role].insert("1.0",
                                                                    f'{SAN}/{SAN_}:SAN\n')
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                        self.ChatApp.update_health_bar(role)
                        return f"{result}/{info}={result2}：San Check失败！扣除{result2}点SAN。"
            if HP_MP_check != "":
                print(role + ":" + HP_MP_check)
                fuhao = expression[0]
                expression = expression.replace(fuhao, "").lower()
                exp = expression
                if "NPC_name" in role:
                    HP = role_Chart_at_name[role.split("NPC_name")[0]].get("HP")
                    MP = role_Chart_at_name[role.split("NPC_name")[0]].get("MP")
                    SAN = role_Chart_at_name[role.split("NPC_name")[0]].get("#SAN")
                    MOV = role_Chart_at_name[role.split("NPC_name")[0]].get("MOV")
                    if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                        # if 有多个d 有多个符号
                        seen_letters = set()
                        result = 0
                        for char in expression:
                            print(char)
                            if char.isalpha():
                                if char in seen_letters:
                                    # 使用正则表达式分割中文、英文和数字
                                    parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                                    # 构建新的表达式，替换掉中文和英文
                                    num_expression = ''.join(parts)
                                    # 替换掷骰表达式
                                    num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                        str(random.randint(1, int(match.group(2)))) for _ in
                                        range(int(match.group(1)))),
                                                            num_expression)
                                    # 计算结果
                                    result += eval(num_expression)
                                seen_letters.add(char)
                        # if(只有一个d)
                        # 使用正则表达式分割中文、英文和数字
                        parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)
                        # 构建算式
                        formula_dice = ''.join(parts[0:3])
                        # 解析表达式
                        parts_ = formula_dice.split('d')
                        num_rolls = int(parts_[0])
                        num_faces = int(parts_[1])
                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result = sum(rolls)
                        formula_add = str(result) + parts[3] + parts[4]
                        result = eval(formula_add)
                    elif "d" in expression:
                        # 解析表达式
                        parts = expression.split('d')
                        num_rolls = int(parts[0])
                        num_faces = int(parts[1])

                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result = sum(rolls)
                        if num_rolls == 1:
                            exp = f"{expression}"
                        else:
                            exp = f"{'+'.join(map(str, rolls))}"
                    else:
                        result = expression
                        exp = ""
                    if HP_MP_check == "HP":
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                    elif HP_MP_check == "SAN":
                        # temp_HP_MP_check = HP_MP_check
                        itm = self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                    elif HP_MP_check == "MOV":
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                    else:
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                    # if (temp_HP_MP_check in role_Chart[role]) and HP_MP_check != "MOV":
                    # if str(role_Chart[role].get(temp_HP_MP_check)) != itm:
                    # role_Chart[role][temp_HP_MP_check] = itm
                    # itm = eval(str(role_Chart[role].get(temp_HP_MP_check)) + fuhao + str(result))

                    if HP_MP_check == "HP":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "SAN":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "MOV":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[
                                           0].strip()) + fuhao + result)
                    else:
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[
                                           0].strip()) + fuhao + result)
                    if HP_MP_check == "HP":
                        self.ChatApp.role_values_entry[role].delete("2.0", "3.0")
                        self.ChatApp.role_values_entry[role].insert("2.0",
                                                                    f'{itm}/{HP}:HP\n')
                    elif HP_MP_check == "SAN":
                        self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                        self.ChatApp.role_values_entry[role].insert("1.0",
                                                                    f'{itm}/{SAN}:SAN\n')
                    elif HP_MP_check == "MOV":
                        self.ChatApp.role_values_entry[role].delete("4.0", "5.0")
                        self.ChatApp.role_values_entry[role].insert("4.0",
                                                                    f'{itm}/{MOV}:MOV\n')
                    else:
                        self.ChatApp.role_values_entry[role].delete("3.0", "4.0")
                        self.ChatApp.role_values_entry[role].insert("3.0",
                                                                    f'{itm}/{MP}:MP\n')
                    des = f"{fuhao}{exp}={result}点{HP_MP_check}".replace("-=", "减少").replace("+=", "恢复")
                    des2 = "已" + des
                    des2 = des2.replace("已+", "已恢复").replace("已-", "已减少")
                    if HP_MP_check == "HP":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("2.0", "3.0").strip()}\n\n')
                    elif HP_MP_check == "SAN":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                    elif HP_MP_check == "MOV":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("4.0", "5.0").strip()}\n\n')
                    else:
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("3.0", "4.0").strip()}\n\n')
                    self.ChatApp.chat_log.yview(tk.END)
                    self.ChatApp.role_entries[role].insert(tk.END, des + "。")
                    self.ChatApp.update_health_bar(role)
                    return
                HP = role_Chart[role].get("HP")
                MP = role_Chart[role].get("MP")
                SAN = role_Chart[role].get("#SAN")
                MOV = role_Chart[role].get("MOV")
                if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                    # if 有多个d 有多个符号
                    seen_letters = set()
                    result = 0
                    for char in expression:
                        print(char)
                        if char.isalpha():
                            if char in seen_letters:
                                # 使用正则表达式分割中文、英文和数字
                                parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                                # 构建新的表达式，替换掉中文和英文
                                num_expression = ''.join(parts)
                                # 替换掷骰表达式
                                num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                    str(random.randint(1, int(match.group(2)))) for _ in range(int(match.group(1)))),
                                                        num_expression)
                                # 计算结果
                                result += eval(num_expression)
                            seen_letters.add(char)
                    # if(只有一个d)
                    # 使用正则表达式分割中文、英文和数字
                    parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)
                    # 构建算式
                    formula_dice = ''.join(parts[0:3])
                    # 解析表达式
                    parts_ = formula_dice.split('d')
                    num_rolls = int(parts_[0])
                    num_faces = int(parts_[1])
                    # 执行掷骰
                    rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                    result = sum(rolls)
                    formula_add = str(result) + parts[3] + parts[4]
                    result = eval(formula_add)
                elif "d" in expression:
                    # 解析表达式
                    parts = expression.split('d')
                    num_rolls = int(parts[0])
                    num_faces = int(parts[1])

                    # 执行掷骰
                    rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                    result = sum(rolls)
                    if num_rolls == 1:
                        exp = f"{expression}"
                    else:
                        exp = f"{'+'.join(map(str, rolls))}"
                else:
                    result = expression
                    exp = ""
                if HP_MP_check == "HP":
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                elif HP_MP_check == "SAN":
                    temp_HP_MP_check = HP_MP_check
                    itm = self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                elif HP_MP_check == "MOV":
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                else:
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                if (temp_HP_MP_check in role_Chart[role]) and HP_MP_check != "MOV":
                    if str(role_Chart[role].get(temp_HP_MP_check)) != itm:
                        role_Chart[role][temp_HP_MP_check] = itm
                    itm = eval(str(role_Chart[role].get(temp_HP_MP_check)) + fuhao + str(result))
                else:
                    if HP_MP_check == "HP":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "SAN":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "MOV":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[
                                           0].strip()) + fuhao + result)
                    else:
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[
                                           0].strip()) + fuhao + result)
                role_Chart[role][temp_HP_MP_check] = itm
                if HP_MP_check == "HP":
                    self.ChatApp.role_values_entry[role].delete("2.0", "3.0")
                    self.ChatApp.role_values_entry[role].insert("2.0",
                                                                f'{itm}/{HP}:HP\n')
                elif HP_MP_check == "SAN":
                    self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                    self.ChatApp.role_values_entry[role].insert("1.0",
                                                                f'{itm}/{SAN}:SAN\n')
                elif HP_MP_check == "MOV":
                    self.ChatApp.role_values_entry[role].delete("4.0", "5.0")
                    self.ChatApp.role_values_entry[role].insert("4.0",
                                                                f'{itm}/{MOV}:MOV\n')
                else:
                    self.ChatApp.role_values_entry[role].delete("3.0", "4.0")
                    self.ChatApp.role_values_entry[role].insert("3.0",
                                                                f'{itm}/{MP}:MP\n')
                des = f"{fuhao}{exp}={result}点{HP_MP_check}".replace("-=", "减少").replace("+=", "恢复")
                des2 = "已" + des
                des2 = des2.replace("已+", "已恢复").replace("已-", "已减少")
                if HP_MP_check == "HP":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("2.0", "3.0").strip()}\n\n')
                elif HP_MP_check == "SAN":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                elif HP_MP_check == "MOV":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("4.0", "5.0").strip()}\n\n')
                else:
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("3.0", "4.0").strip()}\n\n')
                self.ChatApp.chat_log.yview(tk.END)
                self.ChatApp.role_entries[role].insert(tk.END, des + "。")
                self.ChatApp.update_health_bar(role)
                return

            if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                print(expression)
                # if 有多个d 有多个符号
                seen_letters = set()
                for char in expression:
                    if char.isalpha():
                        print("multiple Ds with +/-")
                        if char in seen_letters:
                            # 使用正则表达式分割中文、英文和数字
                            parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                            # print(parts)
                            # 构建新的表达式，替换掉中文和英文
                            num_expression = ''.join(parts)
                            # 替换掷骰表达式
                            num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                str(random.randint(1, int(match.group(2)))) for _ in range(int(match.group(1)))),
                                                    num_expression)
                            # 计算结果
                            result = eval(num_expression)
                            result, adv_comment = self.cal_advantage(result, advantage)
                            # print(result)
                            # print(num_expression)

                            # formula_add.remove(formula_add.count() - 1)
                            if info != None:
                                info_ = info
                                info = None
                                comment = self.skill_check(info_, result)
                                # 执行算式
                                return f"{num_expression}={result}/{info_}：{comment}"
                            else:
                                # 执行算式
                                return f"{num_expression}={result}"
                        seen_letters.add(char)
                    else:
                        pass
                # if(只有一个d)
                print("one D with +/-")
                # 使用正则表达式分割中文、英文和数字
                parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)

                # 构建算式
                formula_dice = ''.join(parts[0:3])
                # 解析表达式
                parts_ = formula_dice.split('d')
                num_rolls = int(parts_[0])
                num_faces = int(parts_[1])
                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                formula_add = str(result) + parts[3] + parts[4]
                result = eval(formula_add)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info != None:
                    info_ = info
                    info = None
                    comment = self.skill_check(info_, result)
                    # 执行算式
                    return f"{formula_add}={result}/{info_}：{comment}"
                else:
                    # 执行算式
                    return f"{formula_add}={result}"
            else:
                print("one D no +/-")
                # 解析表达式
                parts = expression.split('d')
                num_rolls = int(parts[0])
                num_faces = int(parts[1])

                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info != None:
                    info_ = info
                    # print(info_)
                    info = None
                    if result <= 5 and info_ >= Critical_Success_SKill:
                        compare = "<"
                        comment = self.Critical_Success
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result == 1:
                        compare = "<"
                        comment = self.Critical_Success
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result <= info_ // 5:
                        compare = "<"
                        comment = self.Extreme_Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result <= info_ // 2:
                        compare = "<"
                        comment = self.Hard_Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result <= info_:
                        compare = "<"
                        comment = self.Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result >= 96 and info_ < Fumble_SKill:
                        compare = ">"
                        comment = self.Fumble
                        upgrade = ""
                    elif result == 100:
                        compare = ">"
                        comment = self.Fumble
                        upgrade = ""
                    else:
                        compare = ">"
                        comment = self.Failure
                        upgrade = ""
                    # 执行算式
                    if num_rolls == 1:
                        return f"{result}/{info_}：{comment}\n\n{upgrade}"
                    else:
                        return f"{'+'.join(map(str, rolls))}={result}/{info_}：{comment}\n\n{upgrade}"
                else:
                    if num_rolls == 1:
                        return f"{result}"
                    else:
                        return f"{'+'.join(map(str, rolls))}={result}"
        except Exception as e:
            return f"Error: {e}"

    def move_time_forward(self, timer, auto=True):
        switch_dict = {
            "time_1s": self.add_time_1sec,
            "time_3s": self.add_time_3sec,
            "time_1min": self.add_time_1min,
            "time_5min": self.add_time_5min,
            "time_10min": self.add_time_10min,
            "time_30min": self.add_time_30min,
            "time_1h": self.add_time_1h,
            "time_3h": self.add_time_3h,
            "time_12h": self.add_time_12h,
            "time_1d": self.add_time_1d,
            "time_1w": self.add_time_1w,
        }
        # 使用 get 方法获取对应时间列表名的函数，如果不存在则返回一个默认函数
        time_function = switch_dict.get(timer, lambda: print("Invalid time list name"))
        # 执行函数
        time_function()
        if not auto and ("min" in timer or "h" in timer or "w" in timer or "d" in timer):
            timer_ = timer.replace("time_", "").replace("min", "分钟").replace("h", "小时").replace("d", "天").replace("w",
                                                                                                                  "周")
            env_text = self.ChatApp.time_log.get("1.0", tk.END).strip()
            # self.chat_log.insert(tk.END,
            # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text}\n\n')
            time_info = env_text.split("【时间】")[1]
            date = time_info.split("【日期】")[1]
            time = time_info.split("【地点】")[0]
            time_info = time_info.split("【地点】")[1]
            place = time_info.split("【天气】")[0]
            time_info = time_info.split("【天气】")[1]
            weather = time_info.split("【日期】")[0]
            # 上下午
            if int(time.split(":")[0]) > 12:
                time_ = time + "㏘"
            else:
                time_ = time + "㏂"
            # 季节
            if 5 >= int(date.split("/")[1]) >= 3:
                date_ = "春♧" + date
            elif 8 >= int(date.split("/")[1]) >= 6:
                date_ = "夏♡" + date
            elif 11 >= int(date.split("/")[1]) >= 9:
                date_ = "秋♤" + date
            else:
                date_ = "冬♢" + date
            # 昼夜
            if "夏" in date_:
                if 19 >= int(time.split(":")[0]) >= 6:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            elif "冬" in date_:
                if 17 >= int(time.split(":")[0]) >= 8:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            else:
                if 18 >= int(time.split(":")[0]) >= 7:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜☆"
            date_ = date_.replace("Monday", datenamelist[0]).replace("Tuesday", datenamelist[1]).replace("Wednesday",
                                                                                                         datenamelist[
                                                                                                             2]).replace(
                "Thursday",
                datenamelist[3]).replace(
                "Friday", datenamelist[4]).replace("Saturday", datenamelist[5]).replace("Sunday", datenamelist[6])
            env_text_ = f"【时间】{time_}【地点】{place}\n【天气】{weather}【日期】{date_}"
            self.ChatApp.chat_log.insert(tk.END,
                                         f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n时间已流逝【{timer_}】...现在是：\n{env_text_}\n\n')
            self.ChatApp.chat_log.yview(tk.END)

    def add_time_1sec(self):
        # 添加处理 time_1s 的代码
        global _secondsTime
        _secondsTime += 1
        while _secondsTime >= 60:
            self.add_time_1min()
            _secondsTime -= 60
        print(f"秒表：{_secondsTime}秒")

    def add_time_3sec(self):
        # 添加处理 time_3s 的代码
        global _secondsTime
        _secondsTime += random.randint(1, 3)
        while _secondsTime >= 60:
            self.add_time_1min()
            _secondsTime -= 60
        print(f"秒表：{_secondsTime}秒")
        # global time
        # time_format = "%H:%M"
        # base_time = datetime.strptime(time, time_format)
        # time = base_time + timedelta(seconds=3)
        # 将新时间格式化为字符串
        # time = time.strftime(time_format)
        # reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        # self.ChatApp.time_log.delete("1.0", tk.END)
        # self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        # print("Adding 1 minute")
        # if time == "23:59:57":
        # print("新的一天")
        # self.ChatApp.chat_log.insert(tk.END,
        # f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n新的一天到来了...现在是{date}\n\n')
        # 滚动到最底部
        # self.ChatApp.chat_log.yview(tk.END)

    def newday(self):
        self.add_time_1d()
        print("新的一天")
        env_text = self.ChatApp.time_log.get("1.0", tk.END).strip()
        # self.chat_log.insert(tk.END,
        # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text}\n\n')
        time_info = env_text.split("【时间】")[1]
        date = time_info.split("【日期】")[1]
        time = time_info.split("【地点】")[0]
        time_info = time_info.split("【地点】")[1]
        place = time_info.split("【天气】")[0]
        time_info = time_info.split("【天气】")[1]
        weather = time_info.split("【日期】")[0]
        # 上下午
        if int(time.split(":")[0]) > 12:
            time_ = time + "㏘"
        else:
            time_ = time + "㏂"
        # 季节
        if 5 >= int(date.split("/")[1]) >= 3:
            date_ = "春♧" + date
        elif 8 >= int(date.split("/")[1]) >= 6:
            date_ = "夏♡" + date
        elif 11 >= int(date.split("/")[1]) >= 9:
            date_ = "秋♤" + date
        else:
            date_ = "冬♢" + date
        # 昼夜
        if "夏" in date_:
            if 19 >= int(time.split(":")[0]) >= 6:
                time_ = time_ + "昼☀"
            else:
                time_ = time_ + "夜☆"
        elif "冬" in date_:
            if 17 >= int(time.split(":")[0]) >= 8:
                time_ = time_ + "昼☀"
            else:
                time_ = time_ + "夜☆"
        else:
            if 18 >= int(time.split(":")[0]) >= 7:
                time_ = time_ + "昼☀"
            else:
                time_ = time_ + "夜☆"
        date_ = date_.replace("Monday", datenamelist[0]).replace("Tuesday", datenamelist[1]).replace("Wednesday",
                                                                                                     datenamelist[
                                                                                                         2]).replace(
            "Thursday",
            datenamelist[3]).replace(
            "Friday", datenamelist[4]).replace("Saturday", datenamelist[5]).replace("Sunday", datenamelist[6])
        env_text_ = f"【时间】{time_}【地点】{place}\n【天气】{weather}【日期】{date_}"
        env_text = f"【时间】{time}【地点】{place}【天气】{weather}【日期】{date}"
        self.ChatApp.chat_log.insert(tk.END,
                                     f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n新的一天到来了...\n{env_text_}\n\n')
        self.ChatApp.chat_log.yview(tk.END)

    def add_time_1min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=1)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 1 minute")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 59:
            self.newday()

    def add_time_5min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=5)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 5 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 55:
            self.newday()

    def add_time_10min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=10)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 10 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 50:
            self.newday()

    def add_time_30min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=30)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 30 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 30:
            self.newday()

    def add_time_1h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=1)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 60 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 23:
            self.newday()

    def add_time_3h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=3)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 180 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 21:
            self.newday()

    def add_time_12h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=12)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 720 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 12:
            self.newday()

    def add_time_1d(self):
        # 添加处理 time_1min 的代码
        global date
        time_format = "%Y/%m/%d %A"
        base_time = datetime.strptime(date, time_format)
        date = base_time + timedelta(days=1)
        # 将新时间格式化为字符串
        date = date.strftime(time_format)
        reply = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【日期】")[0]) + "【日期】"
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, reply + date)
        print("Adding 1 day")

    def add_time_1w(self):
        # 添加处理 time_1min 的代码
        global date
        time_format = "%Y/%m/%d %A"
        base_time = datetime.strptime(date, time_format)
        date = base_time + timedelta(days=7)
        # 将新时间格式化为字符串
        date = date.strftime(time_format)
        reply = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【日期】")[0]) + "【日期】"
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, reply + date)
        print("Adding 7 days")


class DraggableItem:
    def __init__(self, canvas, x, y, width, height, fill=None, image=None, outline=None, label=None, label2=None,
                 type=None, frame=None, secret=None, tuceng=None):
        global frame_Map
        global frames_Map
        global current_frame_map

        rgba_color = "#000000"  # 黑色
        alpha = 128  # 50% 的透明度
        # self.rgba_color_with_alpha = rgba_color + "{:02x}".format(alpha)   # 添加透明度
        self.rgba_color_with_alpha = fill
        self.canvas = canvas
        self.width = width
        self.height = height
        self.anchor = None
        self.resize_anchor = None
        self.label = label
        self.label2 = label2
        self.itemType = type
        self.image_references = []
        self.frame = frame
        self.image = image

        if image:
            if tuceng:
                if tuceng == "y":
                    self.item = canvas.create_image(x, y, image=image, tags="draggable")
                    self.canvas.tag_lower(self.item)
                else:
                    self.item = canvas.create_image(x, y, image=image, tags="draggable")
            else:
                self.item = canvas.create_image(x, y, image=image, tags="draggable")
            if self.itemType == "image_animate" or self.itemType == "image_temp_animate" or self.itemType == "DiceBotImage_animate":
                # 播放 GIF 动画
                # print(current_frame_map)
                self.animate_on_map(0, self.canvas, self.item,
                                    frames_map[self.frame])
            if label is not None and label2 is not None:
                self.label_below_image = tk.Label(self.canvas, text=label)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                self.label_below_image_canvas = self.canvas.create_window(x, y - 50, window=self.label_below_image,
                                                                          anchor=tk.NW)

                # label_below_image2 = tk.Label(self.canvas, text=label2, relief=tk.SUNKEN)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                # self.label_below_image_canvas2 = self.canvas.create_window(x - 35, y+45, window=label_below_image2,
                # anchor=tk.NW)
                self.label_below_image_canvas2 = canvas.create_text(x, y + 70, text=label2, font=("Arial", 10),
                                                                    fill="black",
                                                                    tags="draggable")
                self.label_below_image_canvas2_edit = canvas.create_text(x - 45, y + 70, text="❤", font=("Arial", 10),
                                                                         fill="black",
                                                                         tags="draggable")
                # if label2 is not None:
                # self.label_below_image_canvas = canvas.create_text(x + 50, y + 50, text=label2, font=("Arial", 5),
                # fill="black",
                # tags="draggable")
            elif label is None and label2 is not None:
                self.label_below_image = tk.LabelFrame(self.canvas)
                self.label_below_image_canvas = self.canvas.create_window(x, y - 50, window=self.label_below_image,
                                                                          anchor=tk.NW)
                if secret == "y":
                    self.label_below_image_canvas2 = canvas.create_text(x, y + 25, text=label2, font=("Arial", 10),
                                                                        fill="",
                                                                        tags="draggable")
                    self.label_below_image_canvas2_edit = canvas.create_text(x, y + 30, text="___", font=("Arial", 10),
                                                                             fill="black",
                                                                             tags="draggable")
                else:
                    self.label_below_image_canvas2 = canvas.create_text(x, y + 25, text=label2, font=("Arial", 10),
                                                                        fill="black",
                                                                        tags="draggable")
                    self.label_below_image_canvas2_edit = canvas.create_text(x, y + 30, text="___", font=("Arial", 10),
                                                                             fill="black",
                                                                             tags="draggable")
                self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<ButtonPress-2>", self.on_resize_img)
                self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<B2-Motion>", self.on_right_drag_img)

            else:
                self.label_below_image_canvas = None
                self.label_below_image_canvas2 = None
                self.label_below_image_canvas2_edit = None
        else:
            self.label_below_image_canvas2_edit = None

            if type == "rectangle":
                self.item = canvas.create_rectangle(x, y, x + width, y + height, fill=self.rgba_color_with_alpha,
                                                    outline=outline,
                                                    tags="draggable")
            elif type == "circle":
                self.item = canvas.create_oval(x, y, x + width, y + width, fill=self.rgba_color_with_alpha,
                                               outline=outline,
                                               tags="draggable")
            elif type == "oval":
                self.item = canvas.create_oval(x, y, x + width, y + height, fill=self.rgba_color_with_alpha,
                                               outline=outline,
                                               tags="draggable")
            elif type == "polygon3":
                x1 = x - width / 2
                y1 = y + height
                x2 = x + width / 2
                y2 = y + height
                points = [x, y, x1, y1, x2, y2]
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon5":
                points = []
                for i in range(5):
                    angle = math.radians(90 + i * 360 / 5)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon6":
                points = []
                for i in range(6):
                    angle = math.radians(30 + i * 360 / 6)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon8":
                points = []
                for i in range(8):
                    angle = math.radians(45 + i * 360 / 8)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygonStar":
                points = []
                for i in range(5):
                    angle = math.radians(90 + i * 360 / 5)
                    if i % 2 == 0:
                        points.append(x + width * math.cos(angle))
                        points.append(y + width * math.sin(angle))
                    else:
                        points.append(x + width / 2 * math.cos(angle))
                        points.append(y + width / 2 * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")

            elif type == "line":
                self.item = canvas.create_line(x, y, x + width, y + height, fill="black",
                                               tags="draggable")

            elif type == "text":
                self.item = canvas.create_text(x + 50, y + 50, text=label, font=("Arial", 12), fill="black",
                                               tags="draggable")

            self.itemType = type
            if label is not None:
                # label_below_image = tk.Label(self.canvas, text=label)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                # self.label_below_image_canvas = self.canvas.create_window(x, y, window=label_below_image, anchor=tk.NW)
                self.label_below_image2 = tk.Label(self.canvas, text=label2)
                if label2 is not None:
                    self.itemType = "text_PC"
                    self.label_below_image_canvas2 = self.canvas.create_window(x + 50, y - 10,
                                                                               window=self.label_below_image2,
                                                                               anchor=tk.NW)
                    self.canvas.itemconfig(self.item, text=label2, fill="black")

                else:
                    self.label_below_image_canvas2 = None
                if type == "text":
                    self.label_below_image_canvas = canvas.create_text(x + 30, y + 35, text="❤", font=("Arial", 10),
                                                                       fill="black",
                                                                       tags="draggable")
                else:
                    self.label_below_image_canvas = canvas.create_text(x + 10, y - 5, text=label, font=("Arial", 10),
                                                                       fill="black",
                                                                       tags="draggable")

            else:
                self.label_below_image_canvas = None
                self.label_below_image_canvas2 = None

        self.canvas.tag_bind(self.item, "<ButtonPress-1>", self.on_press)
        self.canvas.tag_bind(self.item, "<B1-Motion>", self.on_drag)
        self.canvas.tag_bind(self.item, "<ButtonPress-3>", self.on_right_press)

        if self.label_below_image_canvas:
            self.canvas.tag_bind(self.label_below_image_canvas, "<ButtonPress-1>", self.on_tag_press)
            self.canvas.tag_bind(self.label_below_image_canvas, "<ButtonPress-2>", self.on_resize)
            self.canvas.tag_bind(self.label_below_image_canvas, "<B2-Motion>", self.on_right_drag)
        if self.label_below_image_canvas2_edit != None:
            self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<ButtonPress-1>", self.on_tag_press)

    def config(self, **kwargs):
        # 遍历关键字参数，设置对象的属性
        for key, value in kwargs.items():
            setattr(self, key, value)
        if self.itemType == "text":
            #self.label_below_image.config(text=self.label)
            #self.label_below_image_canvas.config(text=self.label)
            #self.canvas.itemconfig(self.item, text=self.label, fill="black")
            pass
        elif self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            self.label_below_image.config(text=self.label)
            self.canvas.itemconfig(self.label_below_image_canvas2, text=self.label2, fill="black")
        elif self.itemType == "text_PC":
            self.label_below_image2.config(text=self.label)
            self.canvas.itemconfig(self.item, text=self.label2, fill="black")
        else:
            self.label_below_image.config(text=self.label)
            self.canvas.itemconfig(self.label_below_image_canvas, text=self.label, fill="black")
        self.canvas.itemconfig(self.item, image=self.image)

    def on_tag_press(self, event):
        # 弹出输入窗口并获取用户输入的文本
        # print("text")
        if self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            intiText = self.label2
        else:
            if self.itemType == "text":
                text = self.canvas.itemcget(self.item, "text")
            elif self.itemType == "text_PC":
                text = self.label2
            else:
                text = self.canvas.itemcget(self.label_below_image_canvas, "text")
            if text:
                intiText = text
            else:
                intiText = "标签"
        new_text = simpledialog.askstring("Input", "Enter new text:", initialvalue=intiText)
        secret = "n"
        if new_text:
            secret = simpledialog.askstring("隐藏？", "是否隐藏标签文字（y/n）:", initialvalue="n")
            if self.itemType == "text":
                if secret == "y":
                    self.canvas.itemconfig(self.item, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.item, text=new_text, fill="black")
            elif self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
                if secret == "y":
                    self.canvas.itemconfig(self.label_below_image_canvas2, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.label_below_image_canvas2, text=new_text, fill="black")
                self.label2 = new_text
            else:
                if secret == "y":
                    self.canvas.itemconfig(self.label_below_image_canvas, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.label_below_image_canvas, text=new_text, fill="black")

    def on_resize(self, event):
        # self.resize_anchor = event.x - 100, event.y - 50
        self.resize_anchor = self.canvas.coords(self.item)[:2]  # 获取图像左上角的坐标
        label_coords = self.canvas.coords(self.label_below_image_canvas)
        # self.resize_anchor = (self.resize_anchor[0] + label_coords[0], self.resize_anchor[1] + label_coords[1])
        pass

    def on_resize_img(self, event):
        # print("中键")
        # self.resize_anchor = event.x, event.y
        self.resize_anchor = self.canvas.coords(self.item)[:2]
        label_coords = self.canvas.coords(self.label_below_image_canvas2_edit)
        # self.resize_anchor = (self.resize_anchor[0] + label_coords[0], self.resize_anchor[1] + label_coords[1])
        pass

    def on_right_drag(self, event):
        if self.itemType == "text" or self.itemType == "text_PC":
            delta_x = event.x - self.start_x
            delta_y = event.y - self.start_y
            self.canvas.move(self.item, delta_x, delta_y)
            if self.label_below_image_canvas is not None:
                self.canvas.move(self.label_below_image_canvas, delta_x, delta_y)
                if self.label_below_image_canvas2 != None:
                    self.canvas.move(self.label_below_image_canvas2, delta_x, delta_y)
                    if self.label_below_image_canvas2_edit != None:
                        self.canvas.move(self.label_below_image_canvas2_edit, delta_x, delta_y)
            self.start_x = event.x
            self.start_y = event.y
            # dx = event.x - self.anchor[0]
            # dy = event.y - self.anchor[1]
            # self.canvas.move(self.item, dx, dy)
            self.anchor = event.x, event.y
            self.resize_anchor = event.x, event.y
        else:
            if self.resize_anchor:
                dx = event.x - self.resize_anchor[0]
                dy = event.y - self.resize_anchor[1]
                self.width += dx
                self.height += dy
                self.canvas.coords(self.item, self.canvas.coords(self.item)[0],
                                   self.canvas.coords(self.item)[1], self.width, self.height)
                self.resize_anchor = event.x, event.y

    def on_right_drag_img(self, event):
        if self.resize_anchor:
            dx = event.x - self.resize_anchor[0]
            dy = event.y - self.resize_anchor[1]
            self.width += dx
            self.height += dy
            x1, y1 = self.canvas.coords(self.item)[:2]  # 获取图像左上角的坐标
            # self.canvas.coords(self.item, x1, y1, x1+ self.width, y1+ self.height)
            self.canvas.scale(self.item, 0, 0, 1 + dx / self.width, 1 + dy / self.height)
            # self.canvas.itemconfig(self.item, width=self.width, hight=self.height)
            # self.canvas.delete(self.item)  # 删除旧的图像对象
            # 创建一个新的图像对象，并设置新的大小
            # self.item = self.canvas.create_image(x1, y1, image=your_image, tags="draggable")
            self.resize_anchor = event.x, event.y

    def apng_to_gif(self, apng_file, gif_file):
        # 使用 apng2gif 工具将 APNG 转换成 GIF
        subprocess.run(["apng2gif", apng_file, gif_file])
        return gif_file

    def animate_on_map(self, frame_index, canvas, current_frame, frames):
        # print(str(frame_index)+"/" + str(len(frames)))
        # 更新当前帧
        canvas.itemconfig(current_frame, image=frames[frame_index])
        # canvas.create_image(20, 20, anchor=tk.NW, image=frames[frame_index])
        # 循环播放下一帧
        frame_index = (frame_index + 1) % len(frames)
        self.after_id = canvas.after(50, self.animate_on_map, frame_index, canvas, current_frame, frames)

    def move_cursor_to_avoid(self):
        global isOpeningFiles
        isOpeningFiles = True
        # self.canvas.unbind("<ButtonRelease-3>")
        # 获取屏幕的宽度和高度
        # screen_width, screen_height = pyautogui.size()
        # 将鼠标指针移动到右下角
        # pyautogui.moveTo(screen_width, screen_height)
        # 加载user32.dll
        user32 = ctypes.windll.user32
        # 获取屏幕的宽度和高度
        screen_width = user32.GetSystemMetrics(0)
        screen_height = user32.GetSystemMetrics(1)
        # 将鼠标移动到右下角
        # user32.SetCursorPos(screen_width-100, screen_height-100)
        user32.SetCursorPos(screen_width, screen_height - 500)

    def on_right_press(self, event):
        global isOpeningFiles
        global frame_Map
        global frames_Map
        global current_frame_map
        global Is_fill
        global Is_square
        self.anchor = event.x, event.y
        if (("polygon" in self.itemType) and self.itemType != "polygon3"):
            if Is_fill:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='white',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = False
            else:
                if Is_square:
                    draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, 100, 80, fill='',
                                                        outline='black', label='标签', type=self.itemType)
                    Is_square = False
                else:
                    draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                        random.randint(20, 150), fill='',
                                                        outline='black', label='标签', type=self.itemType)
                    Is_square = True
                Is_fill = True
        elif self.itemType == "image_temp" or self.itemType == "image_temp_animate":
            self.canvas.delete(self.item)
            self.canvas.delete(self.label_below_image_canvas2)
            self.canvas.delete(self.label_below_image_canvas)
            self.canvas.delete(self.label_below_image_canvas2_edit)
        elif self.itemType == "image" or self.itemType == "text_PC" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            self.move_cursor_to_avoid()
            # 创建武器选择变量
            # t.sleep(1)
            avatar_path = filedialog.askopenfilename(title="为【" + self.label + "】选择战斗图片",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir="Images/BattleImages")
            if avatar_path:
                _, extension = os.path.splitext(avatar_path)
                filename, dot = os.path.splitext(os.path.basename(avatar_path))
                if os.path.exists(
                        'Images/BattleImages/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/BattleImages/' + filename + extension)
                if extension == ".apng" or extension == ".APNG":
                    avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
                if extension == ".gif" or extension == ".GIF":
                    image = Image.open(avatar_path)
                    width, height = image.size
                    frames_map[frame_Map] = [
                        ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                        for frame
                        in ImageSequence.Iterator(image)]
                    # 显示 GIF 图片的第一帧
                    current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                 image=frames_map[frame_Map][0],
                                                                 label=self.label,
                                                                 label2=self.label2, type="image_temp_animate",
                                                                 frame=frame_Map)
                    frame_Map += 1

                else:
                    with open(avatar_path, "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image
                    image = tk.PhotoImage(file=avatar_path)
                    draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                    label=self.label,
                                                    label2=self.label2, type="image_temp")

            # self.weapon_var = tk.StringVar(root)
            # self.weapon_var.set("请选择战斗图片")

            # 创建下拉列表
            # self.weapon_menu = tk.OptionMenu(root, self.weapon_var, "剑", "盾", "长矛")
            # self.weapon_menu.pack()

            # 创建按钮，用于确认选择
            # self.select_weapon_button = tk.Button(root, text="选择", command=self.select_weapon)
            # self.select_weapon_button.pack()
            isOpeningFiles = False

        elif self.itemType == "DiceBotImage":
            self.move_cursor_to_avoid()
            # t.sleep(1)
            avatar_path = filedialog.askopenfilename(title="载入图片",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir="Images/MapMarkers")
            if avatar_path:
                labeltext = simpledialog.askstring("图片标签", "输入标签文字（可留空）:", initialvalue="")
                secret = "n"
                if labeltext:
                    secret = simpledialog.askstring("隐藏？", "是否隐藏标签文字（y/n）:", initialvalue="n")
                suofang = int(simpledialog.askstring("大小", "输入图片大小阈值（可留空，默认50）:", initialvalue="50"))
                _, extension = os.path.splitext(avatar_path)
                filename, dot = os.path.splitext(os.path.basename(avatar_path))
                if os.path.exists(
                        'Images/MapMarkers/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/MapMarkers/' + filename + extension)
                if extension == ".apng" or extension == ".APNG":
                    avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
                if extension == ".gif" or extension == ".GIF":
                    image = Image.open(avatar_path)
                    width, height = image.size
                    if width >= suofang and height >= suofang:
                        percentage_w = suofang / width
                        percentage_h = suofang / height
                        percentage = min(percentage_w, percentage_h)
                        image = image.resize((int(width * percentage), int(height * percentage)), Image.LANCZOS)
                        width, height = image.size
                    if max([width, height]) >= 500:
                        tuceng = simpledialog.askstring("图层", "是否置于底层（y/n）:", initialvalue="y")
                    else:
                        tuceng = "n"
                    frames_map[frame_Map] = [
                        ImageTk.PhotoImage(frame.resize((int(width * 0.8), int(height * 0.8)), Image.LANCZOS))
                        for frame
                        in ImageSequence.Iterator(image)]
                    # 显示 GIF 图片的第一帧
                    if tuceng == "y":
                        current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                     image=frames_map[frame_Map][0],
                                                                     label2=labeltext, type="image_temp_animate",
                                                                     secret=secret,
                                                                     frame=frame_Map, tuceng="y")
                    else:
                        current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                     image=frames_map[frame_Map][0],
                                                                     label2=labeltext, type="image_temp_animate",
                                                                     secret=secret,
                                                                     frame=frame_Map)
                    frame_Map += 1

                else:
                    with open(avatar_path, "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        if width >= suofang and height >= suofang:
                            percentage_w = suofang / width
                            percentage_h = suofang / height
                            percentage = min(percentage_w, percentage_h)
                            image = image.resize((int(width * percentage), int(height * percentage)), Image.LANCZOS)
                            width, height = image.size
                        if max([width, height]) >= 500:
                            tuceng = simpledialog.askstring("图层", "是否置于底层（y/n）:", initialvalue="y")
                        else:
                            tuceng = "n"
                        image = image.resize((int(width * 0.8), int(height * 0.8)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image
                    image = tk.PhotoImage(file=avatar_path)
                    if tuceng == "y":
                        draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                        label2=labeltext, secret=secret, type="image_temp", tuceng="y")
                    else:
                        draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                        label2=labeltext, secret=secret, type="image_temp")
            isOpeningFiles = False
        else:
            if Is_fill:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='white',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = False
            else:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = True

        # def select_weapon(self, event):
        # weapon = self.weapon_var.get()

        # 根据选择的武器加载相应的图片
        # if weapon:
        # if weapon == "剑":
        # 载入剑的图片
        # image = tk.PhotoImage(file="sword.gif")
        # elif weapon == "盾":
        # 载入盾的图片
        # image = tk.PhotoImage(file="shield.gif")
        # elif weapon == "长矛":
        # 载入长矛的图片
        # image = tk.PhotoImage(file="spear.gif")
        # else:
        # 默认情况下，载入默认图片
        # image = tk.PhotoImage(file="default.gif")

        # 显示图片在 Canvas 上
        # draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=image, label=self.label,
        # label2=self.label2)

    def on_press(self, event):
        self.start_x = event.x
        self.start_y = event.y
        self.anchor = event.x, event.y
        self.resize_anchor = event.x - 100, event.y - 50
        # self.canvas.tag_lift(self.item)
        # if self.label_below_image_canvas is not None:
        # self.canvas.tag_lift(self.item)

    def on_drag(self, event):
        delta_x = event.x - self.start_x
        delta_y = event.y - self.start_y
        self.canvas.move(self.item, delta_x, delta_y)
        if self.label_below_image_canvas is not None:
            self.canvas.move(self.label_below_image_canvas, delta_x, delta_y)
            if self.label_below_image_canvas2 != None:
                self.canvas.move(self.label_below_image_canvas2, delta_x, delta_y)
                if self.label_below_image_canvas2_edit != None:
                    self.canvas.move(self.label_below_image_canvas2_edit, delta_x, delta_y)
        self.start_x = event.x
        self.start_y = event.y
        # dx = event.x - self.anchor[0]
        # dy = event.y - self.anchor[1]
        # self.canvas.move(self.item, dx, dy)
        self.anchor = event.x, event.y
        self.resize_anchor = event.x, event.y


class CanvasSaver:
    def __init__(self, canvas):
        self.canvas = canvas

    def save_canvas_state(self, filename):
        canvas_state = self.get_canvas_state()
        with open(filename, 'w') as f:
            json.dump(canvas_state, f)
        # self.canvas.postscript(file=filename, colormode="color")

    def load_canvas_state(self, filename):
        with open(filename, 'r') as f:
            canvas_state = json.load(f)
        self.set_canvas_state(canvas_state)

    def get_canvas_state(self):
        canvas_state = {
            'items': []
        }
        for item in self.canvas.find_all():
            item_type = self.canvas.type(item)
            item_coords = self.canvas.coords(item)

            item_tags = self.canvas.gettags(item)
            canvas_state['items'].append({
                'type': item_type,
                'coords': item_coords,
                'tags': item_tags,
            })
            if item_type in ["rectangle", "oval"]:
                fill = self.canvas.itemcget(item, "fill")
                outline = self.canvas.itemcget(item, "outline")
                # text = self.canvas.itemcget(item, "text")
                canvas_state_detail = canvas_state.get("items", {})
                canvas_state_detail["fill"] = fill
                canvas_state_detail["outline"] = outline
                # canvas_state_detail["text"] = text
        return canvas_state

    def set_canvas_state(self, canvas_state):
        self.canvas.delete('all')
        for item_data in canvas_state['items']:
            item_type = item_data['type']
            item_coords = item_data['coords']
            item_tags = item_data['tags']
            if item_type == 'image':
                # Add your handling for image items
                pass
            else:
                self.canvas.create_polygon(item_coords, tags=item_tags)


class LoadNPCDialog(simpledialog.Dialog):
    def __init__(self, parent, title):
        super().__init__(parent, title)
        # self.NPC_information = NPC_information
        # self.ChatApp = None
        # self.ChatApp = chat_app_instance
        # print(NPC_information)

    def body(self, master):
        role_Chart_at_name_ = load_Chart_at_name().copy()
        role_Chart_ = load_Chart().copy()
        self.npcNames = []
        self.slots = []
        self.slots.append("新窗口...")
        self.npcNames.append("随机...")
        self.npcNames.append("新的预设...")
        for role, chart in role_Chart_at_name_.items():
            if "PL " not in role:
                self.npcNames.append(role)
        for role, chart in role_Chart_.items():
            self.slots.append(role)

        tk.Label(master, text="选择NPC：").grid(row=0, column=0, sticky="e")
        tk.Label(master, text="使用名：").grid(row=1, column=0, sticky="e")
        tk.Label(master, text="装载到：").grid(row=2, column=0, sticky="e")
        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()
        self.source_var = tk.StringVar()
        self.source_entry = tk.Entry(master, textvariable=self.source_var)

        first_roll_values = self.npcNames
        second_roll_values = self.slots
        self.first_roll_entry = ttk.Combobox(master, textvariable=self.trust_var, values=first_roll_values)
        self.second_roll_entry = ttk.Combobox(master, textvariable=self.importance_var, values=second_roll_values)

        self.first_roll_entry.grid(row=0, column=1)
        self.second_roll_entry.grid(row=2, column=1)
        self.source_entry.grid(row=1, column=1, padx=5, pady=5)

        return self.first_roll_entry

    def apply(self):
        first_roll = self.trust_var.get()
        second_roll = self.importance_var.get()
        source = self.source_var.get()
        self.result = {}
        self.result[first_roll] = source
        if second_roll == "":
            self.result["slot"] = "KP"
        else:
            self.result["slot"] = second_roll
        # print(self.result)
        return self.result


class MemoryInfoDialog(simpledialog.Dialog):
    def __init__(self, parent, title, information_sources, role):
        # self.ChatApp = chat_app_instance
        self.information_sources = information_sources
        super().__init__(parent, title)

    def body(self, master):
        tk.Label(master, text="信息来源：").grid(row=0, sticky="e")
        tk.Label(master, text="信息内容：").grid(row=1, sticky="e")
        tk.Label(master, text="信任度：").grid(row=2, sticky="e")
        tk.Label(master, text="重要度：").grid(row=3, sticky="e")

        self.source_var = tk.StringVar()
        self.content_var = tk.StringVar()
        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()

        self.source_entry = tk.Entry(master, textvariable=self.source_var)
        self.content_entry = tk.Entry(master, textvariable=self.content_var)

        trust_values = ["完全信任（0）", "基本信任（-1）", "有疑虑（-2）", "不信任（-3）", "质疑矛盾（-4）", "疑神疑鬼（-5）", "过度解读（+4）"]
        self.trust_combobox = ttk.Combobox(master, textvariable=self.trust_var, values=trust_values)

        importance_values = ["关键信息（5）", "相关信息（4）", "边缘信息（3）", "模糊信息（2）", "无用信息（1）"]
        self.importance_combobox = ttk.Combobox(master, textvariable=self.importance_var, values=importance_values)

        self.source_entry.grid(row=0, column=1, padx=5, pady=5)
        self.content_entry.grid(row=1, column=1, padx=5, pady=5)
        self.trust_combobox.grid(row=2, column=1, padx=5, pady=5)
        self.importance_combobox.grid(row=3, column=1, padx=5, pady=5)

        return self.source_entry

    def apply(self):
        self.result = {}
        source = self.source_var.get()
        content = self.content_var.get()
        trust = int(self.trust_combobox.get().split("（")[1][:-1])  # 提取括号中的数字
        importance = int(self.importance_combobox.get().split("（")[1][:-1])  # 提取括号中的数字

        # 计算记忆指数
        memory_index = trust + importance

        # 给出评分
        if memory_index <= -1:
            rating = "遗忘"
        elif memory_index <= 0:
            rating = "无用信息"
        elif memory_index == 2:
            rating = "模糊信息"
        elif memory_index == 3:
            rating = "边缘信息"
        elif memory_index == 4:
            rating = "相关信息"
        else:
            rating = "关键信息"

        self.result["信息来源"] = source
        self.result["信息内容"] = content
        self.result["记忆指数"] = memory_index
        self.result["评分"] = rating
        print(f"信息来源: {source}, 信息内容: {content}, 信任度: {trust}, 重要度: {importance}, 记忆指数: {memory_index}, 评分: {rating}")
        return self.result


class MemoryInfoDialog_public(simpledialog.Dialog):
    def __init__(self, parent, title, role):
        # self.ChatApp = chat_app_instance
        super().__init__(parent, title)

    def body(self, master):
        tk.Label(master, text="信息来源：").grid(row=0, sticky="e")
        tk.Label(master, text="信息内容：").grid(row=1, sticky="e")
        tk.Label(master, text="共享人(代号)：").grid(row=2, sticky="e")
        tk.Label(master, text="评论：").grid(row=3, sticky="e")

        self.source_var = tk.StringVar()
        self.content_var = tk.StringVar()
        self.person_var = tk.StringVar()
        self.comment_var = tk.StringVar()

        self.source_entry = tk.Entry(master, textvariable=self.source_var)
        self.content_entry = tk.Entry(master, textvariable=self.content_var)
        self.person_entry = tk.Entry(master, textvariable=self.person_var)
        # 在 Entry 中显示默认值
        self.person_entry.insert(0, "KP")
        self.comment_entry = tk.Entry(master, textvariable=self.comment_var)

        self.source_entry.grid(row=0, column=1, padx=5, pady=5)
        self.content_entry.grid(row=1, column=1, padx=5, pady=5)
        self.person_entry.grid(row=2, column=1, padx=5, pady=5)
        self.comment_entry.grid(row=3, column=1, padx=5, pady=5)

    def apply(self):
        self.result = {}
        source = self.source_var.get()
        content = self.content_var.get()
        person = self.person_var.get()
        comment = self.comment_var.get()

        self.result["信息来源"] = source
        self.result["信息内容"] = content
        self.result["共享人"] = person
        if comment:
            self.result["评论"] = comment
        else:
            self.result["评论"] = "HO共同信息"
        return self.result


class DiceRollDialog(simpledialog.Dialog):
    def __init__(self, parent, title=None):
        super().__init__(parent, title)
        self.ChatApp = None
        # self.ChatApp = chat_app_instance

    def randomize_info(self):
        global room_info_search
        global room_info_list
        if len(room_info_list) > 0 and len(room_info_search) > 0:
            room_list = []
            for room, value in room_info_search.items():
                room_info_search[room]["信息"].clear()
                room_list.append(room)
            for content, type in room_info_list.items():
                room_info_search[random.choice(room_list)]["信息"][content] = type

    def upload_info(self):
        global room_info_list
        room_info_list[self.content_var.get()] = self.info_type_var.get()
        self.info_type_var.set("")
        self.content_var.set("")
        self.randomize_info()

    def clear(self):
        global room_info_search
        global room_info_list
        room_info_search.clear()
        room_info_list.clear()

    def upload_room(self, master):
        global room_info_search
        room_info_search[self.roomname_var.get()] = {"类型": self.room_var.get(), "扩散": int(self.kuosan_var.get()), "信息": {}}
        self.room_var.set("")
        self.roomname_var.set("")
        self.kuosan_var.set("")
        self.searched_room_name_list = []
        for roomnames, value in room_info_search.items():
            self.searched_room_name_list.append(roomnames)
        self.searched_room_name = ttk.Combobox(master, textvariable=self.searched_room_name_var,
                                               values=self.searched_room_name_list)
        self.searched_room_name.grid(row=11, column=1, sticky="e")
        self.randomize_info()

    def search_room(self):
        global room_info_search
        global room_info_list
        if self.searched_room_name_var.get() != "" and len(room_info_list) > 0:
            self.result_text_.delete("1.0", tk.END)
            if self.adjust_var.get() == "":
                self.adjust_var.set("0")
            if len(room_info_search[self.searched_room_name_var.get()]["信息"]) >= random.randint(1, room_info_search[self.searched_room_name_var.get()]["扩散"]-int(self.adjust_var.get())):
                _list = []
                for i, c in room_info_search[self.searched_room_name_var.get()]["信息"].items():
                    _list.append(i)
                infocontent = random.choice(_list)
                infotype = room_info_search[self.searched_room_name_var.get()]["信息"][infocontent]

                room_info_search[self.searched_room_name_var.get()]["信息"].pop(infocontent)
                room_info_list.pop(infocontent)
                self.result_text_.insert(tk.END, f"发现了一个[{infotype}]！：{infocontent}\n(房间内余{len(room_info_search[self.searched_room_name_var.get()]['信息'])}，共余{len(room_info_list)})。")
            else:
                self.result_text_.insert(tk.END, f"本次搜查未找到任何信息！(房间内余{len(room_info_search[self.searched_room_name_var.get()]['信息'])}，共余{len(room_info_list)})！")
                room_info_search[self.searched_room_name_var.get()]["扩散"] -= 1
        elif self.searched_room_name_var.get() == "":
            self.result_text_.insert(tk.END, "\n请选择房间！")
        elif len(room_info_list) <= 0:
            self.result_text_.insert(tk.END, f"\n所有信息已找到(余{len(room_info_list)})！")

    def selected_info_type(self):
        global room_info_list
        info_list = []
        for content, type in room_info_list.items():
            info_list.append(content)
        if "自定义" in self.info_type_var.get():
            self.content_var.set(f"信息#{str(len(info_list)+1)}")
            #self.content_entry.config(initialvalue=self.content_var.get())
        else:
            self.content_var.set(f"{self.info_type_var.get()}#{str(len(info_list) + 1)}")
            #self.content_entry.config(initialvalue=self.content_var.get())

    def selected_room(self):
        if self.room_var.get() in self.room_values_dic:
            self.kuosan_var.set(self.room_values_dic[self.room_var.get()])
            #self.kuosan_entry.config(initialvalue=self.kuosan_var.get())
        room_list = []
        if "自定义" in self.room_var.get():
            for room, value in room_info_search.items():
                if "自定义房间" in room:
                    room_list.append(room)
            self.roomname_var.set("自定义房间" + "#" + str(len(room_list)+1))
        else:
            for room, value in room_info_search.items():
                if self.room_var.get() in room:
                    room_list.append(room)
            self.roomname_var.set(self.room_var.get() + "#" + str(len(room_list)+1))
        #self.roomname_entry.config(initialvalue=self.roomname_var.get())

    def body(self, master):
        tk.Label(master, text="第一次掷骰结果：").grid(row=0, column=0, sticky="e")
        tk.Label(master, text="第二次掷骰结果：").grid(row=1, column=0, sticky="e")
        tk.Label(master, text="线索名（当前无效）：").grid(row=2, column=0, sticky="e")
        tk.Label(master, text="===情报扩散器").grid(row=3, column=0, sticky="e")
        tk.Label(master, text="编辑房间与情报===").grid(row=3, column=1, sticky="e")
        tk.Label(master, text="房间类型").grid(row=4, column=0, sticky="e")
        tk.Label(master, text="房间名").grid(row=5, column=0, sticky="e")
        self.roomname_var = tk.StringVar()
        self.roomname_entry = tk.Entry(master, textvariable=self.roomname_var)
        self.roomname_entry.grid(row=5, column=1, padx=5, pady=5)
        tk.Label(master, text="扩散度").grid(row=6, column=0, sticky="e")
        self.kuosan_var = tk.StringVar()
        self.kuosan_entry = tk.Entry(master, textvariable=self.kuosan_var)
        self.kuosan_entry.grid(row=6, column=1, padx=5, pady=5)
        tk.Label(master, text="情报类型").grid(row=7, column=0, sticky="e")
        tk.Label(master, text="情报内容").grid(row=8, column=0, sticky="e")
        self.content_var = tk.StringVar()
        self.content_entry = tk.Entry(master, textvariable=self.content_var)
        self.content_entry.grid(row=8, column=1, padx=5, pady=5)
        tk.Button(master, text="房间上传", command=lambda master=master: self.upload_room(master)).grid(row=9, column=0, padx=5, pady=5, sticky="nsew")
        tk.Button(master, text="信息上传", command=self.upload_info).grid(row=9, column=1, padx=5, pady=5, sticky="nsew")
        tk.Label(master, text="===情报扩散器").grid(row=10, column=0, sticky="e")
        tk.Label(master, text="开始使用===").grid(row=10, column=1, sticky="e")
        tk.Label(master, text="房间").grid(row=11, column=0, sticky="e")
        tk.Label(master, text="扩散调整").grid(row=12, column=0, sticky="e")
        self.adjust_var = tk.StringVar()
        self.adjust_var.set("0")
        self.adjust_entry = tk.Entry(master, textvariable=self.adjust_var)
        self.adjust_entry.grid(row=12, column=1, padx=5, pady=5)
        tk.Button(master, text="清空情报", command=self.clear, bg="red").grid(row=13, column=0, padx=5, pady=5, sticky="nsew")
        tk.Button(master, text="开始搜查", command=self.search_room).grid(row=13, column=1, padx=5, pady=5, sticky="nsew")
        self.result_text_ = tk.Text(master, wrap=tk.WORD, width=10, height=5, undo=True)
        self.result_text_.grid(row=14, column=0, sticky="nsew", columnspan=2)

        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()
        self.source_var = tk.StringVar()
        self.source_entry = tk.Entry(master, textvariable=self.source_var)

        first_roll_values = ["大失败（-20%）", "失败（10%）", "成功（100%）"]
        self.first_roll_entry = ttk.Combobox(master, textvariable=self.trust_var, values=first_roll_values)
        second_roll_values = ["放弃（0%）", "大失败（-80%）", "失败（-20%）", "成功（+20%）", "困难成功（+40%）", "极难成功（+60%）", "大成功（+100%）"]
        self.second_roll_entry = ttk.Combobox(master, textvariable=self.importance_var, values=second_roll_values)

        self.first_roll_entry.grid(row=0, column=1)
        self.second_roll_entry.grid(row=1, column=1)
        self.source_entry.grid(row=2, column=1, padx=5, pady=5)

        self.room_var = tk.StringVar()
        self.info_type_var = tk.StringVar()
        room_values = []
        self.room_values_dic = {"[自定义...]": 1, "卧室": 30, "书房": 20, "客厅": 40, "走廊/楼梯间": 5, "地下室": 5, "阁楼": 5, "浴室/卫生间": 10, "储藏库/车库": 30,
                           "花园/庭院/温室": 60, "阳台": 10, "厨房": 12, "秘密房间": 2}
        for room_, value_ in self.room_values_dic.items():
            room_values.append(room_)
        info_type_values = ["[自定义...]", "信函", "日记", "书籍", "杂志", "报纸", "地图", "日志", "纸条", "备忘", "残片", "画作", "照片", "笔记", "胶片", "录音", "网络"]
        self.room = ttk.Combobox(master, textvariable=self.room_var, values=room_values)
        self.room.bind("<<ComboboxSelected>>", lambda event: self.selected_room())
        self.info_type = ttk.Combobox(master, textvariable=self.info_type_var, values=info_type_values)
        self.info_type.bind("<<ComboboxSelected>>", lambda event: self.selected_info_type())
        self.room.grid(row=4, column=1)
        self.info_type.grid(row=7, column=1)

        self.searched_room_name_var = tk.StringVar()
        self.searched_room_name_list = []
        for roomnames, value in room_info_search.items():
            self.searched_room_name_list.append(roomnames)
        self.searched_room_name = ttk.Combobox(master, textvariable=self.searched_room_name_var, values=self.searched_room_name_list)
        self.searched_room_name.grid(row=11, column=1, sticky="e")

        return self.first_roll_entry

    def apply(self):
        first_roll = self.trust_var.get()
        second_roll = self.importance_var.get()
        source = self.source_var.get()

        # 根据规则计算最后的处理方案
        result_percentage = calculate_result_percentage(first_roll, second_roll)
        final_result = calculate_final_result(result_percentage)

        # 显示最终结果
        result_text = f"结果百分比：{result_percentage}\n处理方案：{final_result}\n\n===\n根据原模组信息总结至多五个关键词，按重要度排序，发放时按重要度低到高发放。\n" \
                      f"注意给出的关键词要是可探索、结合模组剧情的关键地点、物品、事件、人物等（一般重要度较低），或者是传达一种态度和推理思路（一般重要度最高）。\n" \
                      f"如果数量不够，则不提供任何关键词（比如只有一个关键地点，则在80%以上给出）如果信息过于简短，可以提前给出全部段落，负值同理；\n如果段落总结不出关键词，可以将关键词替换为句子。\n" \
                      f"注意虚假信息和无效信息是不一样的。无效信息在0%给出，虚假信息需要起到误导PC的作用（比如新增了一个地点，新增了一个人物，关键信息错误等） "
        messagebox.showinfo("处理方案", result_text)
        # self.ChatApp.add_inference2self(source, source + "的搜查进度", result_percentage, "DiceBot")

        print(result_text)


def calculate_result_percentage(first_roll, second_roll):
    # 根据规则计算可能的结果百分比
    # 请根据实际规则进行修改
    result_percentage = 0
    match = re.search(r'（(-?\+?\d+)%）', first_roll)
    if match:
        print(match.group(1))
        first_roll = int(match.group(1))
    match2 = re.search(r'（(-?\+?\d+)%）', second_roll)
    if match2:
        second_roll = int(match2.group(1))
    result_percentage = int(first_roll) + int(second_roll)
    return result_percentage


def calculate_final_result(result_percentage):
    # 根据可能的结果百分比计算最终处理方案
    # 请根据实际规则进行修改
    if result_percentage == -100:
        final_result = "虚假全部/5假词"
    elif result_percentage == -70:
        final_result = "虚假全部，留1真词"
    elif result_percentage == -40:
        final_result = "2真词1假词"
    elif result_percentage == -20:
        final_result = "2假词/1真2假/不提供"
    elif result_percentage == -10:
        final_result = "1假词/1真1假/不提供"
    elif result_percentage == 0:
        final_result = "不提供"
    elif result_percentage == 10:
        final_result = "1关键词"
    elif result_percentage == 20:
        final_result = "2关键词"
    elif result_percentage == 30:
        final_result = "3关键词"
    elif result_percentage == 40:
        final_result = "4关键词"
    elif result_percentage == 50:
        final_result = "5关键词"
    elif result_percentage == 70:
        final_result = "完整信息隐藏2关键词"
    elif result_percentage == 80:
        final_result = "完整信息隐藏1关键词"
    else:
        final_result = "完整信息"
    return final_result


# 从文件中读取 JSON 数据

def babel(self):
    global babel_on
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/巴别塔.json', 'r', encoding='utf-8') as file:
            self.babel_data = json.load(file)
        babel_on = True
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        self.babel_data = {}
        babel_on = False
        print("未启用“巴别塔”模块, 配置好角色后，在GameSaves下新建以“{}”为内容的 巴别塔.json 以初始化")

    # 如果数据非空，则启用“巴别塔”模块
    if self.babel_data:
        babel_on = True
        print("启用“巴别塔”模块")
    elif babel_on == False:
        print("未启用“巴别塔”模块, 配置好角色后，在GameSaves下新建巴别塔.json以初始化")
    else:
        babel_on = False
        print("准备启用“巴别塔”模块，正在初始化，请核对 GameSaves/巴别塔.json，修改角色“母语”（{'母语':60}）为母语（{'英语':60, '母语':'英语'}），确认国籍并重启")
        self.babel_data = {}
        for role, info in role_Chart.items():
            data_ = {}
            home = -1
            for skill, percent in info.items():
                if "语" in skill:
                    if percent == "EDU":
                        data_[skill] = 0
                        data_["国籍"] = "地球"
                    else:
                        data_[skill] = percent
                        if home < int(percent):
                            data_["国籍"] = skill.replace("语", "") + "国"
            self.babel_data[self.role_entries_name[role]] = data_
        with open('GameSaves/巴别塔.json', 'w', encoding='utf-8') as file:
            json.dump(self.babel_data, file, ensure_ascii=False)


def fire_babel(self, role):
    # 在 data 中获取角色信息
    print(f"===")
    global babel_on
    role = self.role_entries_name[role]
    if babel_on and (role in self.babel_data):
        lan_list = {}
        dic = self.babel_data[role]
        lan_main = str(dic["母语"]).replace("0", "英语")
        for language, skill in self.babel_data[role].items():
            if language != "母语" and language != "国籍":
                if skill >= 10:
                    lan_list[language] = skill
        for role2 in self.roles:
            role2 = self.role_entries_name[role2]
            if role2 != role and (role2 in self.babel_data):
                dic2 = self.babel_data[role2]
                # self.list_skills = []
                if lan_main in dic2:
                    # self.list_skills.append(lan_main)
                    if (dic2[lan_main] + dic[lan_main] >= 60) and dic2[lan_main] >= 10:
                        print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{lan_main}] 聊得很开心！")
                    else:
                        self.best_lan = "None"
                        self.best_lan_skill = 0
                        for language, skill in self.babel_data[role2].items():
                            if language != "母语" and language != "国籍":
                                if language in lan_list:
                                    if skill + lan_list[language] >= 80 and skill >= 20:
                                        print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{language}] 聊得很开心！")
                                        self.best_lan = "GOOD"
                                        break
                                    elif skill >= 5:
                                        if self.best_lan_skill < skill:
                                            self.best_lan = language
                                            self.best_lan_skill = skill
                        if self.best_lan != "None":
                            if self.best_lan == "GOOD":
                                pass
                            elif self.best_lan_skill <= 5:
                                print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么，但知道那可能是 [{self.best_lan}]，可以去请教一下别人！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 60 and self.best_lan_skill >= 50:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [母语({dic2[dic2['母语']]}): {dic2['母语']}] ！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 40 and self.best_lan_skill >= 30:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [困难母语({int(dic2[dic2['母语']] / 2)}): {dic2['母语']}] ！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 10 and self.best_lan_skill > 5:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [极难母语({int(dic2[dic2['母语']] / 5)}): {dic2['母语']}] ！")
                            else:
                                print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                            self.best_lan = "None"
                            self.best_lan_skill = 0
                        else:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                else:
                    self.best_lan = "None"
                    self.best_lan_skill = 0
                    for language, skill in self.babel_data[role2].items():
                        if language != "母语" and language != "国籍":
                            if language in lan_list:
                                if skill + lan_list[language] >= 80 and skill >= 20:
                                    print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{language}] 聊得很开心！")
                                    self.best_lan = "GOOD"
                                    break
                                elif skill >= 5:
                                    if self.best_lan_skill < skill:
                                        self.best_lan = language
                                        self.best_lan_skill = skill
                    if self.best_lan != "None":
                        if self.best_lan == "GOOD":
                            pass
                        elif self.best_lan_skill <= 5:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么，但知道那可能是 [{self.best_lan}]，可以去请教一下别人！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 60 and self.best_lan_skill >= 50:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [母语({dic2[dic2['母语']]}): {dic2['母语']}] ！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 40 and self.best_lan_skill >= 30:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [困难母语({int(dic2[dic2['母语']] / 2)}): {dic2['母语']}] ！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 10 and self.best_lan_skill > 5:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [极难母语({int(dic2[dic2['母语']] / 5)}): {dic2['母语']}] ！")
                        else:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                        self.best_lan = "None"
                        self.best_lan_skill = 0
                    else:
                        print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")


if __name__ == "__main__":
    root = tk.Tk()
    app = ChatApp(root)
    root.protocol("WM_DELETE_WINDOW", app.on_closing)  # 捕获窗口关闭事件
    # root.protocol("WM_DELETE_WINDOW", self.new_window.on_closing)  # 捕获窗口关闭事件
    # root.wm_attributes('-transparentcolor', 'white')
    root.mainloop()
