# -*- coding: utf-8 -*-

import math
import os
import re
import shutil
import subprocess
import psutil
import threading
from collections import defaultdict
from random import random
import random
# import time as t
import tkinter as tk
from tkinter import scrolledtext, filedialog, ttk, simpledialog, messagebox
from datetime import datetime, timedelta
import configparser
# import imageio
# import pyautogui
import ctypes

import numpy as np
from PIL import Image, ImageTk, ImageSequence
import json
import pygame


# import apng

# import win32gui
# import win32con
# import win32api


# import logging

# logging.basicConfig(level=logging.DEBUG)  # 设置日志级别为 DEBUG

def create_folder(folder_path):
    try:
        os.makedirs(folder_path)
        print(f"文件夹 '{folder_path}' 创建成功")
    except FileExistsError:
        print(f"文件夹 '{folder_path}' 已经存在")


audio_list = {}
babel_on = False
frame_Map = 0
frames_map = {}
current_frame_map = {}
Is_fill = False
Is_square = False
Cards_list = {}
isOpeningFiles = False
Is_Opened = False
log_file_last_name = ""
is_hiding_health_bar = False
focused_NPC = ""
room_info_search = {}
room_info_list = {}
hurt_position = ["【头部】","【左眼】","【右眼】","【颈部】","【腹部】","【胸部】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【躯干】","【左臂】","【右臂】","【左手】","【右手】","【下腹】","【左腿】","【右腿】","【左脚】","【右脚】"]

def play_audio(file_path, name, loops=-1):
    if file_path:
        pygame.mixer.init()
        # pygame.mixer.music.load(file_path)
        # pygame.mixer.music.play(loops = loops)
        sound = pygame.mixer.Sound(file_path)
        sound.play(loops=loops)
        if loops == -1:
            audio_list[name] = sound


def kill_audio(name):
    audio_list[name].stop()
    audio_list.pop(name)


# 例子：创建名为 'my_folder' 的文件夹在当前工作目录下
create_folder('AppSettings')
create_folder('Bots')
create_folder('GameSaves')
create_folder('Images')
create_folder('Images/AvatarImages')
create_folder('Images/IconImages')
create_folder('Images/SheetImages')
create_folder('Images/BattleImages')
create_folder('Images/MapMarkers')
create_folder('ReplayResources')
create_folder('ReplayResources/BG')
create_folder('ReplayResources/BGM')
create_folder('ReplayResources/SE')
create_folder('ReplayResources/FX')
create_folder('ReplayResources/HandOut')
create_folder('CardDecks')
create_folder('QuickSaves')

# 便于直接编辑的一系列字符串 一定要包括[成功/失败]，否则无法辨认（程序、用户角度）
string_list_Critical_Success = {"通用": ["￥.。.￥。￥.。\n是大成功！\n.￥.。.￥。.￥。", "这次是大成功！/微笑"]}
string_list_Extreme_Success = {"通用": ["（深呼吸）...极难成功！恭喜您！", "极难成功！恭喜您。"]}
string_list_Hard_Success = {"通用": ["困难成功！"]}
string_list_Success = {"通用": ["检定成功，期待您的表现。", "检定成功，请多加利用/微笑"]}
string_list_Failure = {"通用": ["失败了，请您不要灰心..."]}
string_list_Fumble = {"通用": ["嗯...抱歉，看起来是大失败呢..."]}
# 便于直接编辑的一系列字符串 - 妙语模块
mav_words = {"_mav_prob": 0.01, "通用": ["陛下所言甚是.../陶醉"], "沃姆": ["陛下所言甚是.../陶醉"]}
mav_prob = mav_words["_mav_prob"]  # 妙语概率
encounter_prob = 10

# 默认掷骰原因
reason_string_list = ["不可名状的原因", "懒得写原因", "", "", "", "", ""]  # 保留空白以提高不抽取的概率
reason_silent_string_list = ["不可告人的妙计", "想到了开心的事情", "KP的回眸一笑", "", "", ""]

# 星期文字翻译规范
datenamelist_ = {0: ["星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日"],
                 1: ["周一", "周二", "周三", "周四", "周五", "周六", "周日"],
                 2: ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"], "3": ["月", "火", "水", "木", "金", "土", "日"],
                 4: ["月曜日", "火曜日", "水曜日", "木曜日", "金曜日", "土曜日", "日曜日"],
                 5: ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]}
datenamelist = datenamelist_[1]
style_dice_icon = ["♡", "▣", "◈", "†", "‡"]
# 部分活字文字特效编辑 ♡▣◈†‡ xxx→因y掷骰◈技能
# 高亮
style_highlight_style = ["<color=#FFFF00><b><弹跳>【", "】</弹跳></b></color>"]  # 黄加粗，弹跳，保留【】
# 弱高亮
style_highlight_weak_style = ["<color=#FFFF00><b>[", "]</b></color>"]  # 黄加粗，保留[]
# 弱高亮2
style_highlight_weak_style2 = ["<color=#FFFF00><b>", "</b></color>"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
style_dice_reason_color = "→因<color=#FFFF00>"  # 黄
# 掷骰角色
style_dice_pcname_color = ["<color=#FFFF00>", "</color>"]  # 黄
# 掷骰技能
style_dice_skillname_style = [f"{style_dice_icon[2]}<弹跳><color=#FFFFFF>", "</color></弹跳>"]  # 白，弹跳

### 回声自动换行符（“#”）换行字数
EnterCharacters = 30
### 部分回声文字特效编辑HardCoding，开启富文本有效
# 震惊
style_shock_echo = ["[fg:#FFFFFF][b][bg:#FF0000]", "[/bg][/b][/fg]"]  # 黄加粗，弹跳，保留【】
# 弱化
style_weaken_echo = ["[fg:#FFFFFF70]", "[/fg]"]  # 黄加粗，弹跳，保留（）
# 高亮
style_highlight_style_echo = ["[fg:#000000][bg:#FFFF00][b]【", "】[/b][/bg][/fg]"]  # 黄加粗，弹跳，保留【】
# 弱高亮
style_highlight_weak_style_echo = ["[fg:#FFFF00][b][", "][/b][/fg]"]  # 黄加粗，保留[]
# 弱高亮2
style_highlight_weak_style2_echo = ["[fg:#FFFF00][b]", "[/b][/fg]"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
style_dice_reason_color_echo = "→因[fg:#FFFF00]"  # 黄
# 掷骰角色
style_dice_pcname_color_echo = ["[fg:#FFFF00]", "[/fg]"]  # 黄
# 掷骰技能
style_dice_skillname_style_echo = [f"{style_dice_icon[2]}[fg:#FFFFFF][bg:#000000]", "[/bg][/fg]"]  # 白，弹跳

# 部分回声文字特效编辑标签
# 震惊
# style_shock_echo = ["[震惊]", "[/震惊]"]  # 黄加粗，弹跳，保留【】
# 弱化
# style_weaken_echo = ["[弱化]", "[/弱化]"]  # 黄加粗，弹跳，保留（）
# 高亮
# style_highlight_style_echo = ["[高亮]【", "】[/高亮]"]  # 黄加粗，弹跳，保留【】
# 弱高亮
# style_highlight_weak_style_echo = ["[", "]"]  # 黄加粗，保留[]
# 弱高亮2
# style_highlight_weak_style2_echo = ["[", "]"]  # 黄加粗，不保留[]
# 掷骰原因（只接受color，除非同步修改掷骰角色）
# style_dice_reason_color_echo = "因[角色]"  # 黄
# 掷骰角色
# style_dice_pcname_color_echo = ["[角色]", "[/角色]"]  # 黄
# 掷骰技能
# style_dice_skillname_style_echo = ["[技能]", "[/技能]"]  # 白，弹跳

# 饮品列表
drink_list = ["椰子汁",
              "热红茶",
              "热柠檬茶",
              "黑咖啡",
              "炭烧咖啡",
              "卡布奇诺",
              "特浓咖啡",
              "绿茶",
              "莓果白茶",
              "石榴白茶",
              "黄茶",
              "黑茶",
              "伯爵灰茶",
              "冰咖啡",
              "伯爵奶茶",
              "贵夫人奶茶",
              "皇家红茶",
              "苔藓药茶",
              "椰香奶茶",
              "肉桂奶茶",
              "香草奶茶",
              "雪域薄荷",
              "蓝湖红茶",
              "热柠檬红茶",
              "榛果香茶",
              "咖啡红茶",
              "贵族红茶",
              "蓝调特色红茶",
              "冷翡翠绿茶",
              "麦香红茶",
              "玫瑰香茶",
              "水蜜桃冰绿茶",
              "杂果冰红茶",
              "锡兰茶",
              "甘菊茶",
              "蒲公英",
              "抹茶拿铁",
              "乌龙茶",
              "铁观音",
              "普洱茶",
              "菊花茶",
              "香片茶",
              "寿眉茶",
              "灰伯爵",
              "蜂蜜花草茶", "红酒",
              "威士忌",
              "白兰地",
              "龙舌兰",
              "朗姆酒",
              "伏特加",
              "金酒",
              "黑啤",
              "果啤",
              "白葡萄酒",
              "香槟",
              "荆球酒", "莫吉托",
              "长岛冰茶",
              "玛格丽特",
              "美态",
              "曼哈顿",
              "威士忌酸",
              "干马提尼",
              "白夫人",
              "特调荆球",
              "热巧克力",
              "热牛娜",
              "水",
              "矿泉水",
              "碳酸饮料",
              "酸奶",
              "运动饮料",
              "可乐",
              "冰淇淋饮品"]
# 日常列表
everyday_list = ["照顾搭档/他人",
    "在街上随意闲逛",
    "与搭档/他人一同生活",
    "与搭档/他人一起解决事件",
    "一直待在据点",
    "一味调查（自己）很感兴趣的事",
    "业余时做的事情得到表彰",
    "学习",
    "无意之中度过每一天",
    "为搭档/他人做饭",
    "日常过得并不顺利",
    "认真地干活",
    "倾心于最近所沉迷的兴趣",
    "企图离开搭档/他人身边",
    "目光无法从搭档/他人身上移开",
    "进行直播",
    "解决某些事件",
    "计划着与搭档/他人一同旅行",
    "回味与搭档/他人之间的回忆",
    "犯相思病",
    "发呆放空",
    "调查过去的事件",
    "打扫据点",
    "沉迷赌博",
    "尝试发展各种兴趣",
    "参与事件相关时遭遇闭门羹",
    "不认真地干活",
    "边吃边逛",
    "把据点弄得乱七八糟",
    "把搭档/他人放着不管",
    "锻炼"]
# 职业列表
career_list = [
    "Accountant 会计师",
    "Acrobat 杂技演员",
    "Actor 演员",
    "Agency Detective 事务所侦探",
    "Alienist 精神病医生（古典）",
    "Animal Trainer 动物训练师",
    "Antiquarian 文物学家（原作向）",
    "Antique Dealer 古董商",
    "Archaeologist 考古学家（原作向）",
    "Architect 建筑师",
    "Artist 艺术家",
    "Asylum Attendant 精神病院看护",
    "Assassin 刺客：参考罪犯",
    "Athlete 运动员",
    "Author 作家（原作向）",
    "Aviator 特技飞行员（古典）：参考飞行员",
    "Bank Robber 银行劫匪：参考罪犯",
    "Bartender 酒保",
    "Big Game Hunter 猎人",
    "Book Dealer 书商",
    "Bootlegger 打手：参考罪犯（参考走私者）",
    "Bounty Hunter 猎人",
    "Boxer/Wrestler 拳击手 / 摔跤手",
    "Burglar 窃贼：参考罪犯",
    "Butler/Valet/Maid 管家 / 男仆 / 女仆",
    "Chauffeur 私人司机：参考司机",
    "Clergy, Member of the 神职人员",
    "Computer Programmer 计算机程序员",
    "Computer Technician 计算机工程师",
    "Computer Hacker 黑客（现代）",
    "Conman 欺诈师：参考罪犯",
    "Cowboy/girl 牛仔",
    "Craftsperson 工匠",
    "Criminal 罪犯：参考黑帮",
    "Cult Leader 教团首领",
    "Deprogrammer 除魅师（现代）",
    "Designer 设计师",
    "Dilettante 业余艺术爱好者（原作向）",
    "Diver 潜水员",
    "Doctor of Medicine 医生 ( 原作向 ): 参考精神病学家",
    "Drifter 流浪者",
    "Driver 司机",
    "Editor 编辑",
    "Elected Official 政府官员",
    "Engineer 工程师",
    "Entertainer 艺人",
    "Explorer 探险家（古典）",
    "Farmer 农民",
    "Federal Agent 联邦探员",
    "Fence 赃物贩子",
    "Firefighter 消防员",
    "Foreign Correspondent 驻外记者",
    "Forensic Surgeon 法医",
    "Forger/Counterfeiter 赝造者、伪造者：参考罪犯",
    "Gambler 赌徒",
    "Gangster 黑帮",
    "Gun Moll 女飞贼（古典）：参考罪犯",
    "Gentleman/ Lady 绅士 / 淑女",
    "Hacker 黑客：参考计算机程序员",
    "Hobo 游民",
    "Hospital Orderly 勤杂护工",
    "Journalist 记者（原作向）",
    "Judge 法官",
    "Laboratory Assistant 实验室助理",
    "Laborer 工人",
    "Lawyer 律师",
    "Librarian 图书馆管理员（原作向）",
    "Lumberjack 伐木工：参考工人",
    "Maid 女仆：参考管家",
    "Mechanic(and Skilled Trades) 技师",
    "Military Officer 军官",
    "Miner 矿工：参考工人",
    "Missionary 传教士",
    "Mountain Climber 登山家",
    "Museum Curator 博物馆管理员",
    "Musician 音乐家",
    "Nurse 护士",
    "Occultist 神秘学家（原作向）",
    "Outdoorsman/Outdoorswoman 旅行家",
    "Parapsychologist 超心理学家",
    "Pharmacist 药剂师",
    "Photographer 摄影师",
    "Photojournalist 摄影记者：参考摄影师",
    "Pilot 飞行员：参考特技飞行员",
    "Police Detective/Officer 警察与警探（原作向）",
    "Private Investigator 私家侦探",
    "Professor 教授（原作向）",
    "Prospector 淘金客",
    "Prostitute 性工作者",
    "Psychiatrist 精神病学家",
    "Psychologist 心理学家",
    "Psychoanalyst 心理分析学家",
    "Reporter 通讯记者：参考记者",
    "Researcher 研究员",
    "Sailor 海员",
    "Salesperson 推销员",
    "Scientist 科学家",
    "Secretary 秘书",
    "Shopkeeper 店老板",
    "Smuggler 走私者：参考罪犯",
    "Soldier/Marine 士兵、海军陆战队士兵",
    "Spy 间谍",
    "Street Punk 混混：参考罪犯",
    "Student/Intern 学生、实习生",
    "Stuntman 替身演员",
    "Taxi Driver 出租车司机：参考司机",
    "Thug 暴徒：参考罪犯",
    "Tribe Member 部落成员",
    "Undertaker 殡葬师",
    "Union Activist 工会活动家",
    "Valet 男仆：参考管家",
    "Waitress/Waiter 服务生",
    "White-collar Worker 白领工人",
    "Zealot 狂热者",
    "Zookeeper 饲养员",
    "Clerk/Executive 职员、主管",
    "Criminal (Freelance/solo) 独行罪犯",
    "Film Star 电影演员",
    "Gangster Boss 黑帮老大",
    "Gangster Underling 黑帮马仔",
    "Investigative Journalist 调查记者",
    "Laborer, Unskilled 非熟练工人",
    "Middle/Senior Manager 中层、高层管理人员",
    "Police Detective 警探",
    "Sailor, Naval 军舰海员",
    "Sailor, Commercial 民用船海员",
    "Stage Actor 戏剧演员",
    "Uniformed Police Officer 警官",
    "【1】\n【自定义职业】\n【信誉】：?\n【职业属性】：教育×4\n【本职技能】：不多于8个【本职技能】。\n【介绍】：\n在【职业属性】中输入第二【职业属性】的数值（留空则视为EDU"
    "）并自行设置起始【信誉】。使用自定义职业前，请先咨询你的守秘人",
    "【2】\n【会计师】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，聆听，说服，侦查，任意其他两项个人或时代特长。\n【介绍】：\n会计师可能在企业工作或作为自由会计师，为个体经营者和企业客户担任顾问。他们是优秀的研究者，既勤奋又关注细节，能够通过仔细分析个人和企业交易记录、财务报表和其他记录支援其他调查员。",
    "【3】\n【杂技演员】\n【信誉】：9-20\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：攀爬，闪避，跳跃，投掷，侦查，游泳，任意两项其他个人或时代特长。\n【介绍】：\n杂技演员可能是参加各级比赛（甚至奥运会）的业余运动员，也可能是专业的演员，在马戏团、嘉年华、歌舞团之类的地方作为娱乐业从业者工作。",
    "【4】\n【演员-戏剧演员】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演），乔装，格斗，历史，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n在1920年代，虽然全国都有大型剧院，美国的戏剧中心仍然是纽约城。英国的情况与之相近，戏剧的中心在伦敦，其他的剧团则在各郡作巡回演出。巡回剧团乘火车旅行，演出内容既包括新编剧目，也包括莎士比亚和其他人的传统剧目。有些剧团也会花时间去国外采风，通常是去加拿大夏威夷澳大利亚和欧洲大陆。",
    "【5】\n【演员-电影演员】\n【信誉】：20-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演），乔装，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长（如骑乘或格斗）。\n【介绍】：\n许多演员有相当深厚的文化素养，认为自己才是“正统”的，倾向于轻视电影业的商业活动。直到 20 世纪后期电影业的地位提高，电影演员的薪酬增加，这种情况才发生改变。电影业和电影明星一直是世界人民关注的焦点。许多明星一夜成名，在媒体的聚光灯下过着光鲜亮丽的生活。",
    "【6】\n【事务所侦探、保安】\n【信誉】：20-45\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：一项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），射击，法律，图书馆，心理学，潜行，追踪。\n【介绍】：\n世界上有许多著名的侦探机构，其中最著名的是平克顿和伯恩斯调查局（后来合并成一家公司）。这样的公司一般有两类工作人员：安保人员和调查人员。企业或个人雇用安保人员来保护自己的资产和人员免受盗贼刺客和绑匪的威胁。这些安保人员角色使用巡警的职业模板。调查人员则是便衣侦探，负责为公司客户解决各种异常事件阻止谋杀事件寻找失踪的人员等等。",
    "【7】\n【精神病医生（古典）】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：法律，聆听，医学，外语，精神分析，心理学，科学（生物学，化学）。\n【介绍】：\n在1920年代，“精神病医生”这个词专用来称呼治疗精神失常的医生（也就是早期的精神科医生）。精神分析在当时的美国鲜为人知，而且它的基本内容都是性生活和如厕训练之类令大众不齿的东西。精神病学，一种正规的从行为主义发展来的医学理论则要普及得多。精神病医生精神科医生和神经科医生还经常爆发激烈的论战。",
    "【8】\n【动物训练师】\n【信誉】：10-40\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：跳跃，聆听，自然，心理学，科学（动物学），潜行，追踪，任意一项其他个人或时代特长。\n【介绍】：\n动物训练师可能在电影工作室巡回马戏团马厩工作或自由工作。不管是训练导盲犬狮子钻火圈，他们工作时基本要独自一人长时间近距离地照看这些动物。动物训练师可以像对人一样对动物使用「心理学」技能。",
    "【9】\n【文物学家（原作向）】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：估价，技艺（任一），历史，图书馆，外语，一项社交技能（魅惑、话术、恐吓、说服），侦查，任意一项其他个人或时代特长。\n【介绍】：\n文物学家也许是调查员可以从事的最具有洛夫克拉夫特风格的职业：那些历久弥新的的卓越作品湮没在古代传说中的神奇力量，总能使他们乐在其中。独立的收入使文物学家能够研究古旧晦涩的文物，或者根据自己的兴趣爱好集中探寻特别的种类。他们通常有着欣赏的眼光敏锐的头脑，和讽刺无知自大贪婪者的愚蠢时尖酸刻薄的幽默。",
    "【10】\n【古董商】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：会计，估价，汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，导航。\n【介绍】：\n古董商通常自己开店，从自己所在的地方转卖物品，或继续扩展业务范围，通过倒卖物品到城市商店赚取利润。",
    "【11】\n【考古学家（原作向）】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：估价，考古，历史，外语，图书馆，侦查，机械维修，导航或科学（任一：如化学、物理、地理等）。\n【介绍】：\n考古学家研究探索历史的痕迹。主要来说，是对人类历史相关的物质资料进行各种鉴识检查分析。这项工作包含辛苦细致的研究，更不必提情愿亲自下斗铲土的决心。在1920年代，成功的考古学家会被当成著名冒险家与探险家，名利双收。有人运用科学方法考古，不过更多的人对付老祖宗的秘密时喜好暴力破解的办法，甚至祭出炸药，这种碉堡了的办法现代人可是很难看得惯的。",
    "【12】\n【建筑师】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，技艺（技术制图），法律，母语，计算机或图书馆，说服，心理学，科学（数学）。\n【介绍】：\n建筑师掌握设计和营造建筑的知识，不论是个人房屋的改造还是造价数百万美元的地标工程。建筑师与项目经理紧密合作，负责监督施工全程。建筑师必须了解当地的规划法律，健康和安全法规，和基础的公众安全原则。他们既可以在大公司工作，也可以自由工作，这在很大程度上取决于【信誉】。在1920年代，许多人尝试在自家或小办公室单干。",
    "【13】\n【艺术家】\n【信誉】：9-50\n【职业属性】：教育×2＋敏捷或意志×2\n【本职技能】：技艺（任一），历史或自然，一项社交技能（魅惑、话术、恐吓、说服），外语，心理学，侦查，任意两项其他个人或时代特长。\n【介绍】：\n艺术家在这里可以是画家，雕塑家等等。他们有时沉浸于自己虚幻的想象当中，有时又沐浴在激发热情和理解的灵感之下。不论是否天资优秀，艺术家的内心必须足够强大，这样才能战胜生涯起步时的障碍和挑剔的眼光，并且在自己小有名气以后继续努力。有些艺术家对物质生活是否丰富并不在乎，而有些则有着强烈的创业倾向。",
    "【14】\n【精神病院看护】\n【信誉】：8-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，格斗（斗殴），急救，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，潜行。\n【介绍】：\n尽管少数富有的人会选择私人疗养院，大多精神病患者最终会被安置到州县设置的定点医院。这些地方除了医生护士以外，还会有一支看护队伍。选聘看护的时候，力量和体格往往比医学知识更被看重。",
    "【15】\n【运动员】\n【信誉】：9-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），骑乘，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。\n【介绍】：\n运动员可能效力于职业的棒球足球板球或者篮球队伍。这支队伍也许是大联盟队伍，有着稳定工资，参加的比赛万人瞩目；或者是众多小联盟队伍之一，尤其是在1920年代的棒球界。这些队伍往往寄于大联盟队伍篱下，各方面都受其管理，工资更是刚够运动员糊口又不至于让他们跳槽的水平。成功的运动员在自己的专业领域也会拥有相当的声誉。",
    "【16】\n【作家（原作向）】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（文学），历史，图书馆，自然或神秘学，外语，母语，心理学，任意一项其他个人或时代特长。\n【介绍】：\n作家不同于记者，他们用文字定义和探讨人们的社会生活，尤其是人们的情感变化。他们的劳动通常孤立而又自我中心：虽然以前写作是个能稳拿工资的行当，但如今只靠写作发大财的人屈指可数。作家的工作习惯相差极大。通常作家们会花费数月乃至数年的时间调查取材，为新书的创作做准备；然后闭门谢客，投入紧张的创作。",
    "【17】\n【酒保】\n【信誉】：8-25\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），聆听，心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n酒保虽然不一定是酒吧的掌柜，却一定是所有客人的朋友。对客人们的好声气，一部分来说是出于他们的职业或者业务，而更多的来说则是达到目的的一种手段。1920年代，由于禁酒令的存在，酒保变成了非法的职业；但是遍地开花的黑酒吧又不能没有酒保，结果就是酒保仍然不愁找不到活干。",
    "【18】\n【猎人】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：射击，聆听或侦查，自然，导航，外语或生存（任一），科学（生物学或植物学），潜行，追踪。\n【介绍】：\n猎人是优秀的追踪者和狩猎者，通常靠为富裕的客户捕猎为生。绝大多数猎人会对地球上某一个部分的情况烂熟于心，比如加拿大森林非洲草原等等。有些人可能从事盗猎活动，例如为私人收藏家捕捉珍稀动物，或者贩卖受保护的动物和违反道德的动物制品，如兽皮象牙之类.",
    "【19】\n【书商】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：会计，估价，汽车驾驶，历史，图书馆，母语，外语，一项社交技能（魅惑、话术、恐吓、说服）。\n【介绍】：\n书商可能拥有自己的店面或者利基（小众）邮购服务，也可能辗转全国甚至海外专门经销书籍。许多人拥有富有的，能提供利润丰厚又稀罕的工作的固定客户。",
    "【20】\n【赏金猎人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电子学或电气维修，格斗或射击，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，追踪，潜行。\n【介绍】：\n赏金猎人捉拿罪犯并将他们交给正义去审判。最常见的情况是受保释人的委托去缉捕逃狱者。赏金猎人们为了自己的猎物可以不择手段，几乎不会考虑其他人的正当权益之类细枝末节的东西。非法闯入威胁肢体暴力，都是赏金猎人屡试不爽的秘技。现在这些秘技还包括了电话窃听黑客操作和其他的秘密监控。",
    "【21】\n【拳击手、摔跤手】\n【信誉】：9-60\n【职业属性】：教育×2＋力量×2\n【本职技能】：闪避，格斗（斗殴），恐吓，跳跃，心理学，侦查，任意两项其他个人或时代特长。\n【介绍】：\n拳击手和摔跤手各分为职业和业余两种。职业拳击手和职业摔角手的活动由外部利益支持的赞助人安排，并有合同约束。他们还要进行全日制的工作和训练。业余拳击的竞赛种类非常丰富，同时它也是那些想成为职业拳手的人的训练场。不过也有业余和准职业的选手靠参加黑市拳击赛谋生，举办这些比赛的通常是本地的黑社会或者是从中渔利的庄家。",
    "【22】\n【管家、男仆、女仆】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：会计或估价，技艺（任一：如烹饪、裁缝、理发），急救，聆听，外语，心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n服务业人员。管家通常为一个大家庭打理家事。传统上，他负责的范围包括厨房仆人中位置最高。一般男管家还要负责管理其他的男仆（女管家类似）。更多的职责则听候主人差遣。男仆和女仆则为主人提供贴身服务，包括管理主人的服装准备浴室和担任私人助理。助理的工作则包括安排旅行日程财等。",
    "【23】\n【神职人员】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：会计，历史，图书馆，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。\n【介绍】：\n神职人员通常担任一个教区的牧师，或是经过分配外出传教，尤其是去国外（见传教士）。不同的教会工作的侧重点和组织结构各不相同，如天主教会的牧师可能上升到主教大主教和红衣主教，而一个卫理公会的牧师则会升职到教区主管和主教。有些教职人员在教堂接受医生律师学者的专业培训。这样的调查员应该选择最符合自己工作的职业模板。",
    "【24】\n【程序员、电子工程师（现代）】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学、图书馆，科学（数学），侦查，任意两项其他个人或时代特长。\n【介绍】：\n（现代）计算机程序员通常是设计编写测试调试和维护计算机程序源代码的职业。他们精通从形式逻辑到系统平台（程序运行环境）的各种知识，可能是自由工作者，也可能供职于软件开发部门。计算机技术人员负责计算机系统和网络的开发和维护工作，经常与其他人员（如项目经理）合作来保证系统的完整稳定和正常提供所需功能。",
    "【25】\n【黑客/骇客（现代）】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学，图书馆，侦查，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他技能。\n【介绍】：\n计算机黑客则利用计算机和计算机网络为手段，进行干扰或破坏以达成政治目的（有时被称为“政治黑客”）或获取非法利益。达成目标的手段主要是非法入侵计算机和其他用户帐户，目的则可能包括篡改网页垃圾邮件炸弹。",
    "【26】\n【牛仔】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，格斗或射击，急救或自然，跳跃，骑乘，生存（任一），投掷，追踪。\n【介绍】：\n牛仔在西部的牧区和牧场工作。有些人拥有自己的牧场，更多的则是在各处打工为生。想赚大钱的牛仔会去冒着丢胳膊少腿乃至送命的危险参加牛仔巡回赛，通过旅行获取名誉。在1920年代，一些牛仔能在好莱坞找到西部片替身演员和群众演员的工作，例如怀特•厄普就曾为西部电影担任顾问。在现代，有些牧场也对想要体验一把牛仔生活的游客开放。",
    "【27】\n【工匠】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，技艺（任二），机械维修，自然，侦查，任意两项其他个人或时代特长。\n【介绍】：\n工匠也可能被人叫做师傅或大师，是擅长对各种材料进行手工加工的人。通常都是才能出众的人，有的凭借自己的艺术作品出名，有的则会服务于自己的社区。",
    "【28】\n【罪犯-刺客】\n【信誉】：30-60\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：乔装，电气维修，格斗，射击，锁匠，机械维修，潜行，心理学。\n【介绍】：\n杀手是地下世界的冷血夺命者。这是一项严谨的活计，他们从外地受雇杀人，接近目标，果断下手，又迅速离开。杀手通常很难融入社会，因为很多杀手行为总是很刻板，其他人很容易以为他们不近人情。但是另一方面，他们也会结婚生子，在其他方面和普通人没有什么不同。",
    "【29】\n【罪犯-银行劫匪】\n【信誉】：5-75\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电气维修或机械维修，格斗，射击，恐吓，锁匠，操作重型机械，任意一项其他个人或时代特长。\n【介绍】：\n有些则组成分工明确，会详细调查并制定计划的犯罪组织。",
    "【30】\n【罪犯-打手、暴徒】\n【信誉】：5-30\n【职业属性】：教育×2＋力量×2\n【本职技能】：汽车驾驶，格斗，射击，两项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，侦查。\n【介绍】：\n罪犯可能为别人工作，后者通常是“匪帮”或罪犯家族。自由犯罪者则往往被称为抢劫犯打手罪组织豢养，不过团伙上层出事的时候，倒霉的往往是他们这些喽啰。对于他们来说，嘴紧和忠心属于职业道德。",
    "【31】\n【罪犯-窃贼】\n【信誉】：5-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：估价，攀爬，电气维修或机械维修，聆听，锁匠，妙手，潜行，侦查。\n【介绍】：\n罪犯的体格和相貌形形色色，有些是纯粹碰运气伺机行事，比如扒手.",
    "【32】\n【罪犯-欺诈师】\n【信誉】：10-65\n【职业属性】：教育×2＋外貌×2\n【本职技能】：估价，技艺（表演），法律或外语，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，妙手。\n【介绍】：\n欺诈师通常都是油嘴滑舌的人物。他们或单独或集体出没在富裕的人家和社区周边，诈取他们来之不易的钱财。许多骗局复杂精妙，诈骗团伙会倾巢出动乃至租用建筑；有些则不需要这么麻烦，只要一个骗子几分钟就能搞定。",
    "【33】\n【罪犯-独行罪犯】\n【信誉】：5-65\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：技艺（表演）或乔装，估价，一项社交技能（魅惑、话术、恐吓、说服），格斗或射击，锁匠或机械维修，潜行，心理学，侦查。\n【介绍】：\n也可能单打独斗，如果成功的报酬值得去费力冒险，才会和别人搭伙。",
    "【34】\n【罪犯-女飞贼（古典）】\n【信誉】：10-80\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任意），两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴）或射击（手枪），汽车驾驶，聆听，潜行，任意一项其他个人或时代特长。\n【介绍】：\n女飞贼是名为专业大盗的女人。大部分都是独立行动，也有对自己的男伴言听计从的时候。不过这也不一定，实际上情况可能完全相反，她完全可以在干了某一票以后就卷走所有现金和皮草溜之大吉。",
    "【35】\n【罪犯-赃物贩子】\n【信誉】：20-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，估价，技艺（伪造），历史，一项社交技能（魅惑、话术、恐吓、说服），图书馆，侦查，任意一项其他技能。\n【介绍】：\n赃物贩子，顾名思义是买卖偷抢来的财产，通常是收购赃物并转手卖给其他罪犯或（无意中）守法的顾客。主要来说，他们是小偷和买家的中间人，有时也会从交易中收取提成；不过更常见的还是以极低的价格直接收购赃物。",
    "【36】\n【罪犯-赝造者】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，估价，技艺（伪造），历史，图书馆，侦查，妙手，任意一项其他个人或时代特长（如计算机）。\n【介绍】：\n赝造者是地下世界的艺术家，专门从事伪造官方文件契约转让书，并提供伪造的签名。初学者只能做做小贼的假身份证，而顶级的赝造者连印假币的铸模都能做。",
    "【37】\n【罪犯-走私者】\n【信誉】：20-60\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：射击，聆听，导航，一项社交技能（魅惑、话术、恐吓、说服），汽车驾驶或驾驶（飞行器或船），心理学，妙手，侦查。\n【介绍】：\n走私一直是一个有利可图的高风险行当。走私者往往有一个合法的表面职业，比如船长飞行员或商人，以掩盖他们非法运输的行为。",
    "【38】\n【罪犯-混混】\n【信誉】：3-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，一项社交技能（魅惑、话术、恐吓、说服），格斗，射击，跳跃，妙手，潜行，投掷。\n【介绍】：\n街头混混一般都是些小年轻，弄不好还在寻觅加入真正黑帮的契机。不过他们的本事也就限于偷车，盗窃商店货物，抢钱或者夜盗。",
    "【39】\n【教团首领】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），神秘学，心理学，侦查，任意其他两项其他个人特长。\n【介绍】：\n美国的新兴宗教层出不穷。直到现在，也还有从新英格兰超验主义到“天父的儿女”等等许多种类。教团首领有的创立了严格的教条并且对信徒推行，另一些则仅仅是垂涎于信徒的金钱和权势。在1920年代，各种诱惑性的新兴宗教团体纷纷涌现。有些采取基督教的形式，有些则混杂了东方的神秘主义和神秘学的仪式。",
    "【40】\n【除魅师（现代）】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，格斗（斗殴）或射击，历史，神秘学，心理学，潜行。※经KP允许 可用催眠替换其中一项。\n【介绍】：\n除魅师的工作是说服（或者强迫）一个人放弃自己的信仰或是对宗教团体他们一般受雇于深陷教团之类组织的人的亲属，任务就是解救对方（通常靠绑架），并通过心理学手段使他们割断与原来教团的联系（“控制”）。也有不那么激烈的除魅师，他们的工作对象则是那些自愿离开教团的人，为他们完全地退出教团进行有效的指导。",
    "【41】\n【设计师】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，技艺（摄影），技艺（任一），计算机或图书馆，机械维修，心理学，侦查，任意一项其他个人特长。\n【介绍】：\n设计师的工作包括许多方面，从时装到家具或是其他任何东西。他们自由工作，为设计工作室和企业设计产品流程法律游戏图像等等。调查员特定的设计方向也会影响他们对专业技能的选择，如果需要的话要进行调整。",
    "【42】\n【业余艺术爱好者（原作向）】\n【信誉】：50-99\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），射击，外语，骑乘，一项社交技能（魅惑、话术、恐吓、说服），任意三项其他个人或时代特长。\n【介绍】：\n业余艺术爱好者靠经济自立遗产继承信托基金或者其他各种来源保障自己的生活开支，没有必要自己工作。如果经济条件足够好，他们甚至可以雇佣专业的经济顾问来打理自己的产业。他们可能有很高的学历，但不一定是真才实学；优越的经济条件使得他们性情古怪，口无遮拦。在1920年代，这些人可能会被时人称为“摩登女郎”或者“公子哥儿”。",
    "【43】\n【潜水员】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：潜水，急救，机械维修，驾驶（船），科学（生物），侦查，游泳，任意一项其他个人或时代特长。\n【介绍】：\n潜水员可能在军队执法机构或海绵采集海上救援环境保护甚至水下寻宝的民间机构工作。",
    "【44】\n【医生（原作向）】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。\n【介绍】：\n医生这里可能是指全科医生外科医生其他专科医生或者独立医学研究员。除去个人的目标以外，救死扶伤获得财富和荣誉提升公众的理性意识和科学素养也常常是医生的理想。农村和小城镇的卫生院是全科医生的舞台，而大城市的各大医院则是高手如云，集聚了众多专攻病理学毒理学整形外科脑外科等领域的专家。有些医生也可能担任全职或兼职的法医，进行尸检。",
    "【45】\n【流浪者】\n【信誉】：0-5\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬，跳跃，聆听，导航，一项社交技能（魅惑、话术、恐吓、说服），潜行，任意两项其他个人或时代特长。\n【介绍】：\n相对于那些因贫困而苦恼的人，流浪者选择四处漂泊的生活，可能是出于社会哲学经济的原因，或只是渴望摆脱社会的约束。流浪汉需要工作，有时几天或几个月，但他们应对问题时往往选择流动和孤立，而不是舒适和亲近。在美国，这种情况尤其常见，只要旅行本身没有什么危险，就会有人选择漂泊为生。",
    "【46】\n【司机-私人司机】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：汽车驾驶，两项社交技能（魅惑、话术、恐吓、说服），聆听，机械维修，导航，侦查，任意一项其他个人或时代特长。\n【介绍】：\n私人司机则是直接受雇于个人或企业，或者是专门提供连人带车的私人司机业务的中介机构。",
    "【47】\n【司机-司机】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，汽车驾驶，聆听，一项社交技能（魅惑、话术、恐吓、说服），机械维修，导航，心理学，任意一项其他个人或时代特长。\n【介绍】：\n专职司机可能为企业个人工作，也可能拥有自己的出租车或货车。",
    "【48】\n【司机-出租车司机】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，汽车驾驶，电气维修，话术，机械维修，导航，侦查，任意一项其他个人或时代特长。\n【介绍】：\n出租车司机可能属于大大小小的出租车公司，也可能靠自己的车和证件运营（在美国，需要出租车牌照）。出租车公司负责为出租车司机登记车辆并分配调度，方便司机自由揽客。出租车上必须统一安装计价器，并由出租车协会进行定期检查。通常司机还要通过警方的背景调查，获得特殊的驾驶许可证。",
    "【49】\n【编辑】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：会计，历史，母语，两项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意一项其他个人或时代特长。\n【介绍】：\n编辑的工作包括审核记者的稿件，撰写报刊社论，应对各种突发事件到了截稿时间要催稿，编辑工作只好偶尔为之啦。大型报社的编辑数量众多，包括比起新闻编辑更多参与业务运营的主编。其他编辑专门负责时尚体育或者其他板块。许多小报可能就只有一个编辑，他甚至有可能就是报社的业主或者唯一的全职员工。",
    "【50】\n【政府官员】\n【信誉】：50-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：魅惑，历史，恐吓，话术，聆听，母语，说服，心理学。\n【介绍】：\n以民选方式选举出来的政府官员享有与他们的职位相符的声望。小城市的市长和城镇的镇长之类，他们的影响力基本出不了城镇的范围，而且这样的职务基本上是兼职的，报酬也很少。大城市的市长，工资就相当可观了，而且还能把自己的城市管理得像小王国一样，影响力和权力比所在州的州长还要大。州议会的众参两院议员是相当有面子的职位。",
    "【51】\n【工程师】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：技艺（技术制图），电气维修，图书馆，机械维修，操作重型机械，科学（工程学，物理），任意一项其他个人或时代特长。\n【介绍】：工程师精通机械和电气设备，可能在民间或军工企业工作，也可能是个发明家。他们擅长应用科学、数学知识和丰富的创造思维，解决各种技术问题。\n",
    "【52】\n【艺人】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演类，如表演、演唱、喜剧等），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。\n【介绍】：\n艺人包括小丑歌手舞蹈演员喜剧演员杂耍艺人魔术师，各种以在人前表演谋生的人。他们乐于向更多的人表现自己的能力，并期待观众回报的掌声。在1920年代，这一职业并不受人尊重。不过1920 年代好莱坞明星的高薪彻底改变了很多人的想法，现在这个职业背景已经通常被视作是优势了。",
    "【53】\n【探险家（古典）】\n【信誉】：55-80\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬或游泳，射击，历史，跳跃，自然，导航，外语，生存。\n【介绍】：\n在20世纪早期，这世界还有许多地区尚未有人涉足，而探索这些地方正是探险家的工作。这种令人兴奋不已的生活方式，其经济来源则是科学界的赞助私人的捐赠博物馆的委托和报纸杂志图书电影的版权等等。黑非洲的大部分仍然不为人知，同样的地方还包括了南美的马托格罗索高原，澳大利亚的大沙沙漠，撒哈拉和阿拉伯沙漠，和亚洲的茫茫戈壁。尽管南北极点已经被探险家征服了。",
    "【54】\n【农民】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（耕作），汽车驾驶（或运货马车），一项社交技能（魅惑、话术、恐吓、说服），机械维修，自然，操作重型机械，追踪，任意一项其他个人或时代特长。\n【介绍】：\n农民可能自己拥有土地，自己从事农牧业，也可能是受雇在农场工作。农业劳动繁重而枯燥，特别适合那些喜欢户外体力劳动的人。1920年代是美国城镇人口超过农村人口的首个十年。从这时起一直到现在，自耕农民都在受到规模化农业企业和剧烈波动的农产品市场的双重冲击。",
    "【55】\n【联邦探员】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：汽车驾驶，格斗（斗殴），射击，法律，说服，潜行，侦查，任意一项其他个人或时代特长。\n【介绍】：\n联邦执法机构和特工种类各异。有些身着制服，比如美国司法部的人员；另外一些则穿便服，工作内容也类似警探，比如联邦调查局的人员。",
    "【56】\n【消防员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，汽车驾驶，急救，跳跃，机械维修，操作重型机械，投掷。\n【介绍】：\n消防员是公职人员，通常为所管辖的社区服务。他们夜以继日地工作，或者连续几天的倒班工作，吃住包括娱乐活动都要局限在消防局里。消防员的管理结构类似军队，职位包括中尉上尉和局长等等。",
    "【57】\n【驻外记者】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：历史，外语，母语，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n驻外记者是新闻界的精英人才。他们拿着固定工资，靠报销单环游全世界。在1920年代，驻外记者通常供职于大型报社广播电台或者国家级通讯社。当代的驻外记者也可能自由撰稿或者为电视台网络通讯社和国际新闻通讯社工作。这个职业的工作内容五花八门，经常能激动人心。不过自然灾害政治动荡和战争也会成为驻外记者报道的主要内容，工作也不总是一帆风顺。",
    "【58】\n【法医】\n【信誉】：40-60\n【职业属性】：教育×4\n【本职技能】：外语（拉丁文），图书馆，医学，说服，科学（生物学，鉴证，制药），侦查。\n【介绍】：\n法医是一个高度专门化的职业，大多数法医为市县或州执法机构工作。工作内容包括尸体解剖，推定死因，并为公诉人提供建议。法医也常常会在刑事审判中出庭提供证言。",
    "【59】\n【赌徒】\n【信誉】：8-50\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，技艺（表演），两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，妙手，侦查。\n【介绍】：\n赌徒是罪犯世界里最花哨的一群人。他们衣着光鲜，不论朴实还是华丽都魅力四射。不论是靠赛马、纸牌游戏还是其他赌博方式，他们总是要凭自己的运气过活。老练的赌徒会频繁地光顾犯罪组织开设的地下赌场。低级的赌徒则出入于狭窄的小巷，在骰子房耍弄灌铅的骰子，或者是挤坐在阴暗的台球室里。",
    "【60】\n【黑帮-黑帮老大】\n【信誉】：60-95\n【职业属性】：教育×2＋外貌×2\n【本职技能】：格斗，射击，法律，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，侦查。\n【介绍】：\n黑帮可能是整个城市、一部分城市的大佬，老板总管业务，负责交易，并要就各种各样的问题给马仔们拿主意。更重要的是，老板可以各种高人一等，只要能找到马仔或者小弟去干的事，他基本是不肯污了自己的手去做的。黑社会在1920年代上升为突出的社会问题。现在的黑帮老大也需要大量的小弟来负责保卫、推广、在街道里推行自己的业务。",
    "【61】\n【黑帮-马仔】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，格斗，射击，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。\n【介绍】：\n也可能只是给这些大佬打工的马仔。马仔们通常有自己的保护范围，比如监管非法运输和收取保护费等等。虽然大部分黑帮是按来源的民族划分——如爱尔兰裔、意大利裔、非洲裔和犹太裔，黑帮的成员仍然可能是任何民族。除去贩私酒和贩毒以外，卖淫、保护、赌博、腐败等等都是这些犯罪组织的业务范围。",
    "【62】\n【绅士、淑女】\n【信誉】：40-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），两项社交技能（魅惑、话术、恐吓、说服），射击（步枪/霰弹枪），历史，外语（任一），导航，骑乘。\n【介绍】：\n绅士淑女指的是有良好的教养品行、举止彬彬有礼的人。通常用来称呼上流社会（通过继承或津贴）拥有相当财富的人。在上世纪20年代，这样的人至少要有一个仆人（管家、男仆、女仆、私人司机），还要有城市或乡村的宅第。家庭的富有并重要，因为家庭的社会地位往往比财产更被上流社会所看重。",
    "【63】\n【游民】\n【信誉】：0-5\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：技艺（任一），攀爬，跳跃，聆听，锁匠或妙手，导航，潜行，任意一项其他个人或时代特长。\n【介绍】：\n游民只有少数的人愿意去当，虽然失业的人、醉倒在阴沟里的醉鬼到处都是。和流浪者只会在必需时才工作不同，游民的工作本身就是流浪。他们不断地坐火车旅行，从一个城市辗转到另一个城市，他们是身无分文的诗人、漂泊者，铁路上的探索者、冒险者和盗贼。但是铁路上的生活一样充满危险。且不说穷困潦倒、无家可归，还要面对来自警察、周围居民和铁路员工的敌意。",
    "【64】\n【勤杂护工】\n【信誉】：6-15\n【职业属性】：教育×2＋力量×2\n【本职技能】：电气维修，一项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），急救，聆听，机械维修，心理学，潜行。\n【介绍】：\n勤杂护工在医院的工作包括倒垃圾、打扫房间、运送病人，还有一些其他乱七八糟的工作。总之对他们的要求不比对看门人多多少。",
    "【65】\n【记者(原作向)-调查记者】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（艺术或摄影），一项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，母语，心理学，任意两项其他个人或时代特长。\n【介绍】：\n记者用文字对当天的新闻事件进行报导与评论，一天之内就要完成一个作家一周的工作量。他们通常为报纸、杂志、广播电台、电视台或者新闻网站撰稿。优秀的调查记者在报道事件的同时，即使面对丑恶，也能保持自身的清廉正直。恶心的记者则被现实所压倒，最终丧失自己的节操，肆意操纵文字歪曲真相。",
    "【66】\n【记者(原作向)-通讯记者】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（表演），历史，聆听，母语，一项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，侦查。\n【介绍】：\n通讯记者则是新闻传媒行业大军中的一员。大部分记者从事实地工作，包括走访见证人、查看记录、收集叙述。有些记者被安排专门追踪警界、体育界或商界的热点新闻，其他人则是负责社会事件乃至园艺俱乐部之类的事情。通讯记者都会携带记者证，不过记者证除了各通讯社用来识别自己的雇员以外没有太大的作用。",
    "【67】\n【法官】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：历史，恐吓，法律，图书馆，聆听，母语，说服，心理学。\n【介绍】：\n法官是主持审判全过程的人，可能单独工作或是和同事组成合议庭。一般是推选或任命制，工作年限也分定期和终身。有的人是初出茅庐就当了法官，而其余的绝大多数，不论是在联邦最高法院还是遥远西部小镇的法官，其实至少都是经过注册的律师。",
    "【68】\n【实验室助理】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：计算机或图书馆，电气维修，外语，科学（化学和任意两项），侦查，任意一项其他个人特长。\n【介绍】：\n实验室助理在科研环境中工作，在首席科学家的监督下进行实验和行政工作。研究内容可能依首席科学家的研究学科而变化。但基本都包括取样、测试、记录和分析数据、调整和进行实验、制备标本和样品、管理实验室的日常工作，和保护工作人员的健康与安全。",
    "【69】\n【工人-非熟练工人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，电气维修，格斗，急救，机械维修，操作重型机械，投掷，任意一项其他个人或时代特长。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【70】\n【工人-伐木工】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，格斗（链锯），急救，跳跃，机械维修，自然或科学（生物学或植物学），投掷。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【71】\n【工人-矿工】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，科学（地质），跳跃，机械维修，操作重型机械，潜行，侦查，任意一项其他个人或时代特长。\n【介绍】：\n工人这一大类职业包括工厂工人、纺织工人、码头工人、养路工人、矿工、建筑工人等等。工人分为两种类型：熟练工和非熟练工。普通的工人虽然技术不熟练，但是仍然长于使用电动工具、起重机和其他工厂设备。",
    "【72】\n【律师】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，两项社交技能（魅惑、话术、恐吓、说服），心理学，两项其他技能。\n【介绍】：\n律师或法律顾问精通他们所在地区的法律，擅长把抽象的法学理论知识联系起来，为客户解决法律方面的疑难，担任辩护代理、法律顾问的工作，为客户提供解决办法。可能受托处理个人案件、接受法院指定，也可能专门为某个富裕客户或公司服务。在美国，“律师”一词一般只指辩护律师。在英国，“律师”一词则包括高级律师、初级律师还有一些执法机构。",
    "【73】\n【图书馆管理员（原作向）】\n【信誉】：9-35\n【职业属性】：教育×4\n【本职技能】：会计，图书馆，外语，母语，任意四项其他个人特长或专业书籍主题。\n【介绍】：\n图书馆管理员在公共机构和图书馆工作，负责管理图书目录和书库，并处理图书借阅等。在现代，图书馆管理员还要负责管理视听资料、电子书库。一些大公司可能聘用图书馆管理员管理书库，偶尔还会有富有的图书藏家招收他们管理自己的私人藏书。",
    "【74】\n【技师】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：技艺（木工、焊接、管道工等），攀爬，汽车驾驶，电气维修，机械维修，操作重型机械，任意两项其他个人或时代或技术特长。\n【介绍】：\n技师包括所有需要专业训练和作为学徒或实习生工作经验的职业，例如木工、石工、管道工、电工、设备安装工人、机修工人等等这些需要技术资质的职业。通常这些工人有自己的工会组织，会和承包人和雇主争取自己的权益。",
    "【75】\n【军官】\n【信誉】：20-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，射击，导航，急救，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：\n军官有严格的等级，许多等级还需要高等教育学历。各国武装部队都建立了人才培养系统，其中包括大学教育。在美国，许多大学开设军校生训练项目，可以让学员同时接受文化教育和军事训练。毕业的学员可以授以陆军或海军少尉军衔，并分派到各驻地。他们通常会为国家服役四年，之后可以退役复员。许多人有专门的任命，作为医生、律师和工程师工作。",
    "【76】\n【传教士】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），急救，机械维修，医学，自然，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。\n【介绍】：\n传教士云游到世界的各个角落，传播神的旨意，在文明的地方拯救“不幸的原始人”和“迷途的灵魂”。他们可能属于天主教、新教、伊斯兰教或者其他信仰系统，比如后期圣徒教会（摩门教）在欧美就有专门的传道所。有的传教士只凭自己的意志独立行动，有的则可能有教会以外的组织支持。基督教、伊斯兰教的传教者，佛教、印度教的法师，在全世界各个时代都能遇到。",
    "【77】\n【登山家】\n【信誉】：30-60\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，急救，跳跃，聆听，导航，外语，生存（阿尔卑斯或类似），追踪。\n【介绍】：\n登山家一般都是利用业余时间和假期的运动员，只有少数攀登著名高山的人才会去寻找财力和设备的赞助。19世纪登山运动开始兴起，到了1920年代，所有美洲和阿尔卑斯地区的主要山峰都被一一征服。经过与西藏人的冗长谈判之后，外国登山队终于获准进入喜马拉雅高峰地区。到了现代，登山可以是休闲运动或职业选择。如果是后者，则工作内容包括教练、向导、运动员或救生员等。",
    "【78】\n【博物馆管理员】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：会计，估价，考古，历史，图书馆，神秘学，外语，侦查。\n【介绍】：\n博物馆管理员可能负责大学或其他公共机构的大型设施，也可能负责小一些的博物馆，往往对本地的地质或者其他的内容颇有研究。",
    "【79】\n【音乐家】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：技艺（乐器），一项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，四项其他技能。\n【介绍】：\n音乐家可能加入乐团、乐队或者独奏，演奏的乐器则可以是任何你能想象的种类。音乐家想出人头地十分困难，签约发布唱片就更难了。所以绝大多数音乐家都贫穷又无人关注，只靠街头卖艺勉强维持生计。少数幸运儿可以找到固定工作，比如在酒吧、宾馆或者市交响乐团弹钢琴。对更少的人来说，在正确的时间出现在正确的地点，再加上一点点天赋，就能获得巨大的成功和可观的财富。",
    "【80】\n【护士】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：急救，聆听，医学，一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（生物学，化学），侦查。\n【介绍】：\n护士是专业的医疗助理，通常在医院和疗养院之类的地方工作，或者和全科医生一起合作。一般来说，护士会协助健康人或病人进行保健或康复活动（或者临终关怀），虽然其他人若是有足够的力量、意志或者知识，完全不需要护士帮助的康复也是可能的。",
    "【81】\n【神秘学家】\n【信誉】：9-65\n【职业属性】：教育×4\n【本职技能】：人类学，历史，图书馆，一项社交技能（魅惑、话术、恐吓、说服），神秘学，外语，科学（天文），任意一项其他个人或时代特长 ※经KP允许 可以包含克苏鲁神话。\n【介绍】：\n神秘学家是钻研深奥秘密和神秘魔法的人。他们对超自然能力深信不疑，并竭尽所能靠他们的能力去了解这些东西。许多人对不同神秘哲学和魔法理论的知识面都相当广泛，有些甚至相信自己专注研究三十年真的成为了魔法师。需要指出的是，神秘学家熟知的基本上是“表面的魔法”——克苏鲁神话魔法的秘密对他们仍然是未知的，或者不过是古书上描述那些诱人的线索而已。",
    "【82】\n【旅行家】\n【信誉】：5-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：射击，急救，聆听，自然，导航，侦查，生存（任一），追踪。\n【介绍】：\n旅行家爱好户外，他们一年中大部分时间都呆在户外，并且一出门就是相当长的时间；通常有相当的捕鱼和狩猎技术，能在最恶劣的环境之中幸存下来。擅长的技术可能包括登山、捕鱼、滑雪、皮划艇、攀登和露营。旅行家可能在国家公园或素质拓展中心做野外向导和护林员，也可能是有其他经济来源能让他们不用工作就能以这种方式生活，也说不定只有在需要的时候才会回到文明社会。",
    "【83】\n【超心理学家】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：人类学，技艺（摄影），历史，图书馆，神秘学，外语，心理学，任意一项其他个人或时代特长。\n【介绍】：\n超心理学家从不打算欣赏超常现象。相反，他们试图去观察，记录并研究这些实例。被叫做“捉鬼人”的他们利用技术手段来获取某人或某地点的超自然活动的证据，当然比起收集到实在的证据，更多的时候他们是在揭穿假冒和误认的超常现象。选择研究这个的人往往对不可视的神秘力量抱有相当的同情态度，并希望其他的科学家也能满意地点头肯定。",
    "【84】\n【药剂师】\n【信誉】：35-75\n【职业属性】：教育×4\n【本职技能】：会计，急救，外语（拉丁文），图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（制药，化学）。\n【介绍】：\n药剂师的管理一直以来都比医生更严格。所有的药剂师都要在各州注册，注册的条件则是高中毕业并至少在药学院学习三年。他们可能在医院或者药房工作，也可能自己开药房。",
    "【85】\n【摄影师-摄影师】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：技艺（摄影），一项社交技能（魅惑、话术、恐吓、说服），心理学，科学（化学），潜行，侦查，任意两项其他个人或时代特长。\n【介绍】：\n摄影师大部分是自由工作者，可能制作广告电影或者在照相馆做肖像拍摄。其他一些摄像师则在报纸、电视和电影产业工作。摄影作为一种艺术形式已经产生相当长的时间了，精英的摄影师可以从艺术、新闻报道、野生动物保护等多种角度出发创作他们的作品。不管是哪种立意，他们都能获得名誉和报酬。",
    "【86】\n【摄影师-摄影记者】\n【信誉】：10-30\n【职业属性】：教育×4\n【本职技能】：技艺（摄影），攀爬，一项社交技能（魅惑、话术、恐吓、说服），外语，心理学，科学（化学），任意两项其他个人或时代特长。\n【介绍】：\n摄影记者本质上就是拿照相机，为拍摄的照片写配文的记者。在1920年代，新闻短片走上历史舞台。笨重的35mm摄像装备走遍全球各地，搜寻有价值的新闻轶事、体育赛事和泳装选美比赛。新闻片制作人员一般分为三类：一类是画面中的记者，另两个人则负责摄像和灯光等等。新闻中的声音则是在新闻稿完成以后在录音棚中录入完成的。",
    "【87】\n【飞行员-飞行员】\n【信誉】：20-70\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：电气维修，机械维修，导航，操作重型机械，驾驶（飞行器），科学（天文），任意两项其他个人或时代特长。\n【介绍】：\n飞行员可以在美国邮政这样的企业工作，也可以在大大小小的民航公司做飞行人员。美国1926年之前没有对飞行员的职业要求,1926年航空商业法案通过之后才要求有执照。这个时代的多数飞行员从事嘉年华表演、特技飞行表演、乘飞机游玩或是小机场的空中的士等服务。也有飞行员在部队服现役。许多特技飞行员是在服役期间学会的驾驶飞机，有时仍然会被军队委派任务。",
    "【88】\n【飞行员-特技飞行员（古典）】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，电气维修，聆听，机械维修，导航，驾驶（飞行器），侦查，任意一项其他个人或时代特长。\n【介绍】：\n特技飞行员在嘉年华工作或者为大胆的消费者进行休闲飞行服务。参加有组织的飞行表演赛，不论是固定路线还是越野赛，往往都可以增加自己的知名度。在1920年代，好莱坞常常使用特技飞行员，飞机制造商也会录用一些飞行员为新机作测试。许多特技飞行员是在一次大战中掌握的飞行技术，所以许多人仍然在陆海空军或海岸警卫队服役；年轻的飞行员则基本上是在和平时期接受的训练或是自学成才。",
    "【89】\n【警方(原作向)-警探】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（表演）或乔装，射击，法律，聆听，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，一项其他技能。\n【介绍】：\n警探可能指挥他的下属进行详尽的调查，但是很难有机会集中精力对付单独一个事件，在美国他们很可能要同时处理数十乃至上百的案件。警探工作最关键的部分是通过梳理证词、重建现场情况，摒弃伪证，从而收集足够逮捕嫌疑人的证据，进而促成成功的刑事审判。警探和检察官的职责是分开的，这样可以保证证据在审判之前被独立地对待。",
    "【90】\n【警方(原作向)-巡警】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），射击，急救，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦查和下面的一种个人特长：汽车驾驶或骑乘。\n【介绍】：\n巡警则属于市、城镇、县治安部门或州、地区的警察机关。他们工作时可能步行、驾驶巡逻车，或者干脆坐办公室。",
    "【91】\n【私家侦探】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：技艺（摄影），乔装，法律，图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，一项其他个人或时代特长（如计算机、锁匠、格斗、射击）。\n【介绍】：\n私家侦探通常在警察不出手的地方活跃，包括收集证据为客户准备民事诉讼，追查跑路的配偶或生意伙伴，或者代理刑事案件的私人辩护。他们和任何专业人员一样，私家侦探从不顾及自己的私人情感，只要付钱，不管是有罪还是无罪的一方的委托他们都乐得接受。私家侦探过去可能在警察队伍里工作，利用以前的业务关系为现在工作谋求优势；然而事实并非总是如此。",
    "【92】\n【教授（原作向）】\n【信誉】：20-70\n【职业属性】：教育×4\n【本职技能】：图书馆，外语，母语，心理学，任意四项其他学术、时代或个人特长。\n【介绍】：\n教授是受聘于高等院校的学者。大公司也可能聘请他们以开展学术研究与产品开发。独立的学者也靠开办业余课程作为经济来源。最重要的一点，这一职业代表了 PhD（博士）的荣誉称号，意味着可以在世界各地的大学任终身教职。教授的专长是教学和专业研究，往往在自己的专业领域内有着可圈可点的学术成就。",
    "【93】\n【淘金客】\n【信誉】：0-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬、急救、历史、机械维修、导航、科学（地质），侦查，任意一项其他个人或时代特长。\n【介绍】：\n淘金客一直是美国西部的特色，即便在加利福尼亚淘金热和内华达康姆斯塔克发现金银矿的日子早已经过去的现在。他们无休止地在山间漫游，寻找能使自己一夜暴富的矿脉。而且现在发现石油和发现金子一样给力。",
    "【94】\n【性工作者】\n【信誉】：5-50\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（任一），两项社交技能（魅惑、话术、恐吓、说服），闪避，心理学，妙手，潜行，任意一项其他个人或时代特长。\n【介绍】：\n性工作者根据场合、背景和教养，从超级值钱的应召小姐到牛郎再到站街女都有可能。往往入这一行都是权宜之计，许多人梦想有朝一日能够脱身。少数人能够自己接客，不过绝大多数人基本都是被只认钱不认人的老鸨和皮条客逼迫着工作。",
    "【95】\n【精神病学家】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：外语，聆听，医学，说服，精神分析，心理学，科学（生物学，化学）。\n【介绍】：\n精神病学家是在现代专门从事精神失常诊断和治疗的医生。精神病学家掌握着精神药理学的治疗方法，使用精神类药物的资质，还能整理脑电图并对其进行计算机分析。到1930年代，任何一个医生都可以以精神病学家的身份进入美国医学协会名录中了。",
    "【96】\n【心理学家、精神分析学家】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：会计，图书馆，聆听，说服，精神分析，心理学，任意两项其他学术、个人或时代特长。\n【介绍】：\n心理学家虽然也经常被叫做心理治疗师和心理咨询师，不过这些工作都只是心理学的分支。临床心理学家可能实际接触病人，并且运用各种可能的心理治疗方法。注意心理学家和专业的精神病学家的区别，后者本质上还是医生。在1920年代，对人类行为的研究还是一个新兴的领域，主要的理论还是弗洛伊德心理学。",
    "【97】\n【研究员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：历史，图书馆，一项社交技能（魅惑、话术、恐吓、说服），外语，侦查，任意三项其他学术领域。\n【介绍】：\n学术界的研究课题不计其数，尤其是在天文学、物理学和其他理论领域。私人或企业也雇用了成千上万的研究员，重点在化学、制药和工程领域。石油公司则会聘用专业的地质学家，不一而足。研究员大部分的时间都在室内工作和写作，不过有的则会经常外出考察。考察研究员通常经验丰富，思想独立又足智多谋，可能受雇于私人或者为大学进行学术研究。",
    "【98】\n【海员-军舰海员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：电工或机械维修，格斗，射击，急救，导航，驾驶（船），生存（海上），游泳。\n【介绍】：\n新入伍的海员像陆军的同行一样，开始时需要接受基本的训练。这之后他们获得军衔，并被分配到各镇守府。虽然很多海员担任像水手长副手和司炉工（管理引擎）这样的传统角色，但是也有很多经过专门训练的机械师、无线电操作员、通风管理员之类。在美国，海员通常要服四年的现役和后两年的后备役，即在国家发布动员令时有应召服役的义务。",
    "【99】\n【海员-民船海员】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：急救，机械维修，自然，导航，一项社交技能（魅惑、话术、恐吓、说服），驾驶（船），侦查，游泳。\n【介绍】：\n民用船海员可能在渔船、客船，或运输原油或商品的运输船上工作。在美国，客船活跃在东西海岸和五大湖，运送渔民和游客。目前佛罗里达州在墨西哥湾和大西洋海岸拥有最多数量的客船。在禁酒令期间，许多客船船长发现把急切想喝酒的顾客运到3海里外，外国船只允许卖酒的地方是一桩赚钱的买卖。当然走私酒也报酬丰厚，但是危险就高多了。",
    "【100】\n【推销员】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，聆听，心理学，潜行或妙手，一项其他技能。\n【介绍】：\n推销员是商务工作的必需一环，他们的工作就是推广和销售公司的产品或服务。大部分推销员的时间要用来旅行、开会、和客户应酬。有些则主要坐办公室用电话联系潜在客户，还有的会在各社区巡回，挨家挨户上门推销。1920年代是企业家的年代，旅行推销成了一种日常生活方式。有些推销员在固定的地区工作，有些则可以自由漫游，寻找任何地方可能出现的商机。",
    "【101】\n【科学家】\n【信誉】：9-50\n【职业属性】：教育×4\n【本职技能】：任意三项科学专业领域，计算机或图书馆，外语，母语，一项社交技能（魅惑、话术、恐吓、说服），侦查。\n【介绍】：科学家是在追求知识的过程中挖掘真理的人。如果想要利用科学知识制造有用的物品，需要的是工程师；而如果想要扩展“可能”这个概念的范围，那就是科学家的工作了。科学家们通常在企业和大学工作，以进行他们的研究。虽然主攻一个科学领域，但是真正称职的科学家一般也能达到通晓其他数个科学领域的水平。他们对自己的母语也能使用自如，学历也相当高，甚至拥有博士学位。\n",
    "【102】\n【秘书】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计，技艺（打字或速记），两项社交技能（魅惑、话术、恐吓、说服），母语，图书馆或计算机，心理学，任意一项其他个人或时代特长。\n【介绍】：秘书的范围是从高薪的私人管理助理到普通的打字员。这份工作的重点在于以自己各种沟通协调能力，支持主管和经理人员。因为身处企业流程的中心，许多秘书比老板对企业的内部运作和经营还要熟悉。在1920年代，秘书工作主要是通信工作，例如听写打印信件，整理文档系统，并为老板安排会议时间。有的情况下，秘书还会负责老板的生活，比如安排假期、为老板和家人置办礼物，还有保护老板的安全。\n",
    "【103】\n【店老板】\n【信誉】：20-40\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），电气维修，聆听，机械维修，心理学，侦查。\n【介绍】：店老板经营小店、市场摊位或者是小饭馆。这种店往往都是小本自营，不过也有为其他东家照顾生意的。不少店是家族式管理，工作人员大部分都有亲属关系，其他的雇员即便有也很少。在1920年代，还有不少的老板娘开起了自己的理发店和帽店。\n",
    "【104】\n【士兵、海军陆战队士兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。\n【介绍】：所有应征人员首先要在“训练营（新兵连）”接受基本训练，在训练营中新兵将学习如何行军、射击和敬礼。结束训练营的训练后，大部分的新兵会分配到步兵营，虽然也有分配到炮兵营和坦克营的。少部分会接受非战斗的训练，例如通风系统、机械装备、文职甚至军官接待。海军陆战队名义上属于海军，但是和陆军士兵在背景、训练方式和技能方面都很相近。\n",
    "【105】\n【间谍】\n【信誉】：20-60\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：技艺（表演）或乔装，射击，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，妙手，潜行。\n【介绍】：间谍为国家和组织的情报部门卖命。他们能以从大使到厨房清洁工的任何职业身份作为掩饰，刺探他们所需的情报。有些间谍数年如一日的持续着卧底工作，另一些穿个马甲就换一个身份。在本国委任的间谍通常会去往外国工作。间谍除了情报收集和反情报收集的主要工作，也会被委派其他任务，例如招募新间谍和国家批准的暗杀等。\n",
    "【106】\n【学生、实习生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：语言（母语或外语），图书馆，聆听，三个学习的专业，任意两项其他个人或时代特长。\n【介绍】：学生可能在大学或学院学习，实习生则是正在接受宝贵的入职培训，获得最低报酬的公司员工。\n",
    "【107】\n【替身演员】\n【信誉】：10-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，闪避，电气维修或机械维修，格斗，急救，跳跃，游泳，下面任选一项：潜水、汽车驾驶、驾驶（任一），骑乘。\n【介绍】：替身演员在电影和电视剧工业中活跃，专门模拟坠楼、车祸等灾难场景。他们通常会接受格斗技巧和舞台格斗的训练。任何的替身特技表演都是有风险的。在现代，替身演员基本都是工会的成员，想要加入工会，他们必须有证明自己能力的证书。而且，所有的特技场景还要有特技总监负责指导动作。但是在1920年代，行业规范没有成型，所以事故率和死亡率居高不下。\n",
    "【108】\n【部落成员】\n【信誉】：0-15\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，格斗或投掷，聆听，自然，神秘学，侦查，游泳，生存（任一）。\n【介绍】：至少，从家族忠诚来说，部落文化无处不在。在部落中，亲属关系和传统习俗的首要地位是不言而喻的。一个部落通常来说是一个相对较小的群体。相比起法律和个人权利，部落更加依据个人荣耀而裁定行为。崇拜，复仇，嘉奖，以及荣耀——所有的一切都是部落成员个人所有的，而如果领袖或是仇敌被视为有荣耀的人，那么他们个人也必然在某种程度上十分有名。\n",
    "【109】\n【殡葬师】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：会计，汽车驾驶，一项社交技能（魅惑、话术、恐吓、说服），历史，神秘学，心理学，科学（生物学，化学）。\n【介绍】：殡葬师又叫殡葬业者或葬礼主持人，是负责运行丧葬仪式的职业。工作也包含土葬和火化等内容。在葬礼上，殡葬师要进行防腐、裹衣、入殓、遗体美容等等工作。殡葬师的执照由各州发放。他们可能自己拥有殡仪馆，或者在别人的殡仪馆工作\n",
    "【110】\n【工会活动家】\n【信誉】：5-50\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），格斗（斗殴），法律，聆听，操作重型机械，心理学。\n【介绍】：工会活动家是组织者、领导者，有时也是空想者或者别有用心的抗议者，通常是工人的伙伴、老板的对头。各行各业都有工会，不论是码头工人、建筑工人、矿工还是演员。在20世纪早期，工会活动家所在的工会面临着诸多危险。大企业想要毁掉它，政治家在支持它和谴责它之间摇摆不定，社会主义者和共产主义者试图影响它，还有犯罪组织试图夺取它。\n",
    "【111】\n【服务生】\n【信誉】：9-20\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，技艺（任一），闪避，聆听，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。\n【介绍】：服务生在酒店、酒吧或者其他餐饮业场所服务顾客。通常薪酬很低，不过通过对顾客良好服务，可以得到他们给的小费。在禁酒令时期，售酒场所的服务员是非法职业。不过犯罪组织把控的地下酒吧中仍然存在许多工作机会。\n",
    "【112】\n【白领工人-职员、主管】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：会计，语言，法律，图书馆或计算机，聆听，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。\n【介绍】：白领工人可能是从最低等级的白领职员到中层或高层的管理人员。所属单位则可能从小型中型的本地企业直到大型的国家级甚至跨国公司。职员被扣工资是家常便饭，工作也往往单调乏味。不过如果在工作中展现出了天分，那也会被看上，将来会得到提拔。中高层管理人员的工资比较高，当然责任也比较重，要负责管理公司的日常事务。\n",
    "【113】\n【白领工人-中高层管理人员】\n【信誉】：20-80\n【职业属性】：教育×4\n【本职技能】：会计，外语，法律，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。\n【介绍】：职员被扣工资是家常便饭，工作也往往单调乏味。不过如果在工作中展现出了天分，那也会被看上，将来会得到提拔。中高层管理人员的工资比较高，当然责任也比较重，要负责管理公司的日常事务。虽然未婚的白领并不少见，但很多管理人员还是很顾家，家里一般会有配偶和孩子——家庭通常是他们的期望。\n",
    "【114】\n【狂热者】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：历史，两项社交技能（魅惑、话术、恐吓、说服），心理学，潜行，任意三项其他个人或时代特长。\n【介绍】：热情而有动力、鄙视安逸的生活，狂热者们为人类更好的生活或者为人类中最精华部分的利益而躁动不安。一些狂热者通过暴力推进他们的信仰，但是并不能说采取和平方式的就比他们好说话，他们每个人都梦想着为自己的理想辩护。\n",
    "【115】\n【饲养员】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：驯兽，会计，闪避，急救，自然，医学，科学（制药，动物学）。\n【介绍】：饲养员负责动物的喂养和看护，场地管理员和服务员管理其他杂务。通常饲养员会专门照看某一种动物，可以对动物使用「医学」技能。\n",
    "【116】\n【大使】\n【信誉】：50-90\n【职业属性】：教育×2＋外貌×2\n【本职技能】：魅惑，历史，恐吓，话术，聆听，母语，说服，心理学。(用一到两种外语取代前面两种技能)",
    "【117】\n【运动员（游泳/潜水）】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），外语，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。",
    "【118】\n【运动员（高尔夫）】\n【信誉】：50-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），骑术，一项社交技能（魅惑、话术、恐吓、说服），游泳，投掷，任意一项其他个人或时代特长。",
    "【119】\n【运动员（网球）】\n【信誉】：30-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：跳跃，格斗（斗殴），闪避，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦察，投掷，任意一项其他个人或时代特长。",
    "【120】\n【运动员（田径）】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬，跳跃，格斗（斗殴），外语，一项社交技能（魅惑、话术、恐吓、说服），闪避，投掷，任意一项其他个人或时代特长。",
    "【121】\n【发言人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：乔装，闪避，三项社交技能（魅惑、话术、恐吓、说服），心理学，外语，任意一项其他个人或时代特长。",
    "【122】\n【保释担保人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，图书馆，心理学，任意两项其他个人或时代特长。",
    "【123】\n【神职人员(天主教牧师)】\n【信誉】：20-70\n【职业属性】：教育×4\n【本职技能】：会计，母语，外语(拉丁文)，图书馆，神秘学，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【124】\n【神职人员(新教牧师)】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：会计，历史，图书馆，聆听，外语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【125】\n【神职人员(犹太教拉比)】\n【信誉】：9-60\n【职业属性】：教育×4\n【本职技能】：母语，外语（希伯来语），历史，图书馆，神秘学，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他技能。",
    "【126】\n【专栏作家】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），历史或图书馆，母语，外语，心理学，潜行。",
    "【127】\n【社会主义者/激进主义者】\n【信誉】：0-30\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：格斗（斗殴），两项社交技能（魅惑、话术、恐吓、说服），射击（手枪），外语，心理学，任意两项其他个人或时代特长。",
    "【128】\n【撰稿人】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：母语，艺术（文学），两项社交技能（魅惑、话术、恐吓、说服），历史，图书馆，聆听，心理学。",
    "【129】\n【罪犯（赌博庄家）】\n【信誉】：50-80\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计,两项社交技能（魅惑、话术、恐吓、说服）,心理学，侦察，妙手，任意一项其他个人或时代特长。",
    "【130】\n【罪犯（放高利贷者）】\n【信誉】：50-80\n【职业属性】：教育×2＋敏捷或外貌×2\n【本职技能】：会计，估价，两项社交技能（魅惑、话术、恐吓、说服）,心理学，侦察，任意两项其他个人或时代特长。",
    "【131】\n【罪犯（扒手）】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服）,潜行，聆听，心理学，侦察，妙手，任意一项其他个人或时代特长。",
    "【132】\n【罪犯（地下钱庄）】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，聆听，说服，侦察，任意其他两项个人或时代特长。",
    "【133】\n【罪犯（黑律师）】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：会计，法律，图书馆，两项社交技能（魅惑、话术、恐吓、说服），心理学，两项其他技能。",
    "【134】\n【牙医】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【135】\n【外科医生/内科医生】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【136】\n【整形医生】\n【信誉】：30-80\n【职业属性】：教育×4\n【本职技能】：急救、医学、外语（拉丁文）、心理学、科学（生物学，制药），任两种其他学术或个人特长。",
    "【137】\n【司机-公交司机】\n【信誉】：30-50\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：会计，汽车驾驶，电气维修，机械维修，领航，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。",
    "【138】\n【实地调研员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：会计，攀爬或跳跃，急救，图书馆，外语，一项社交技能（魅惑、话术、恐吓、说服），两项研究领域相关技能。",
    "【139】\n【电影摄制人员】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：艺术/工艺(任一,如摄影)，攀爬，汽车驾驶，电气维修，机械维修，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【140】\n【司法科学家】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），医学，法律，科学（化学，司法科学，药学），侦察，任意一项其他个人或时代特长。",
    "【141】\n【运动经理】\n【信誉】：20-70\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，格斗（斗殴），闪避，两项社交技能（魅惑、话术、恐吓、说服），急救，心理学，任意一项其他个人或时代特长。",
    "【142】\n【商船队船员】\n【信誉】：20-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：人类学，攀爬，电气维修或机械维修，跳跃，操作重型机械，外语，生存（海上），任意一项其他个人或时代特长。",
    "【143】\n【古典音乐家】\n【信誉】：9-30\n【职业属性】：教育×2＋意志或敏捷×2\n【本职技能】：会计，技艺（乐器），一项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，三项其他技能。",
    "【144】\n【赛车手/ 赛艇手】\n【信誉】：30-70\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：汽车驾驶，电气维修，机械维修，驾驶（船），心理学，侦察，任意两项其他个人或时代特长。",
    "【145】\n【电台播音员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【146】\n【推销员（圣经推销员）】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，聆听，心理学，潜行或妙手，一项其他技能。",
    "【147】\n【推销员（旅行推销员）】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），汽车驾驶，领航，聆听，心理学，一项其他技能。",
    "【148】\n【小企业家】\n【信誉】：50-70\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），心理学，四项经营业务相关技能。",
    "【149】\n【舞台工作人员】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：艺术/ 工艺（任一），母语，两项社交技能（魅惑、话术、恐吓、说服），乔装，心理学，任意两项其他个人或时代特长。",
    "【150】\n【证券经纪人】\n【信誉】：60-90\n【职业属性】：教育×4\n【本职技能】：会计，估价，母语，两项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长。",
    "【151】\n【勘测员】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，艺术（摄影），图书馆，博物学，领航，生存（任一），侦察，任意一项其他个人或时代特长。",
    "【152】\n【电话接线员】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：母语，外语，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【153】\n【星探】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦察，任意两项其他个人或时代特长。",
    "【154】\n【医疗技术员】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），电气维修，图书馆，机械维修，医学，科学（生物，化学，药学）。",
    "【155】\n【队医】\n【信誉】：9-30\n【职业属性】：\n【本职技能】：两项社交技能（魅惑、话术、恐吓、说服），急救，医学，科学（药学），心理学，侦察，任意一项其他个人或时代特长。",
    "【156】\n【寻宝猎人】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：估价，攀爬，汽车驾驶或驾驶（飞行器或船），电气维修或机械维修，历史，跳跃，一项社交技能（魅惑、话术、恐吓、说服），侦察。",
    "【157】\n【西部治安官】\n【信誉】：20-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：汽车驾驶，射击（任一），格斗（斗殴，鞭），法律，说服或心理学，骑术，追踪。",
    "【158】\n【暴走族】\n【信誉】：5-10\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），汽车驾驶，机械维修，话术，恐吓，任意三项其他个人或时代特长。",
    "【159】\n【神职人员(和尚,尼姑)】\n【信誉】：5-60\n【职业属性】：教育×4\n【本职技能】：艺术（书法），历史或图书馆，外语（汉语或梵语），学问（佛教），一项社交技能（魅惑、话术、恐吓、说服），心理学，聆听，任意一项其他个人或时代特长。",
    "【160】\n【神职人员(神官,巫女)】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：艺术（书法，另任一），图书馆，神秘学，学问（神道教），一项社交技能（魅惑、话术、恐吓、说服），心理学，任意一项其他个人或时代特长。",
    "【161】\n【风水师】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：艺术（任一），图书馆，神秘学，学问（道教），一项社交技能（魅惑、话术、恐吓、说服），科学（天文，地质），任意一项其他个人或时代特长。",
    "【162】\n【家传降妖人】\n【信誉】：9-20\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），博物学，神秘学，学问（佛教或神道教），心理学，潜行，任意两项其他个人或时代特长。",
    "【163】\n【高中生(教育60以下)】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：攀爬、潜行、跳跃、图书馆、格斗（任一）、母语、科学（任一）或历史、外语（英语或其他）。",
    "【164】\n【市子（盲人）】\n【信誉】：5-30\n【职业属性】：教育×4\n【本职技能】：艺术（表演），聆听，学问（神道教），神秘学，历史，话术或说服，心理学，任意一项特长。※经KP同意，可以用「灵媒」技能代替一项自选技能。",
    "【165】\n【言灵师/阴阳师】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：艺术（书法，另任一），历史或图书馆，母语，学问（阴阳道），科学（天文），神秘学，任意一项其他个人或时代特长。",
    "【166】\n【炼丹师】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：图书馆，医学，神秘学，科学（化学），博物学，学问（道教），外语（汉语），急救或精神分析。",
    "【167】\n【外语教师】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：历史，聆听，母语，心理学，两项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【168】\n【非法移民】\n【信誉】：0-5\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：乔装，话术，聆听，侦察，潜行，妙手，心理学，任意一项其他个人或时代特长。",
    "【169】\n【相扑力士(SIZ>80,STR>70)】\n【信誉】：9-60\n【职业属性】：教育×2＋力量×2\n【本职技能】：闪避，格斗（斗殴），恐吓，跳跃，心理学，侦察，任意两项其他个人或时代特长。(体型+2D6,你的体型可以超过99)",
    "【170】\n【渔民】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：机械维修，操作重型机械，游泳，驾驶（船），科学（天文），领航，博物学，侦察。",
    "【171】\n【心理治疗师】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（任一），两项社交技能（魅惑、话术、恐吓、说服），法律，外语，心理学，精神分析，任意一项其他个人或时代特长。",
    "【172】\n【女学生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：一项社交技能（魅惑、话术、恐吓、说服），自行车驾驶，急救，聆听，艺术/ 工艺（任一），图书馆，格斗（矛）或射击（弓），外语（任一）。",
    "【173】\n【寄居学生】\n【信誉】：5-10\n【职业属性】：教育×4\n【本职技能】：急救，会计，手艺（木匠），说服，图书馆，外语（任一），任意两项其他个人或时代特长。",
    "【174】\n【动物辅助治疗师】\n【信誉】：30-50\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：聆听，心理学，精神分析，科学（动物学），跳跃，追踪，博物学，任意一项其他个人或时代特长。跳跃，追踪，博物学，任意一项其他个人或时代特长。",
    "【175】\n【急诊医生/救援队员】\n【信誉】：10-50\n【职业属性】：教育×4\n【本职技能】：医学，急救，科学（化学），锁匠，机械维修，电气维修，攀爬，跳跃。",
    "【176】\n【密医】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：医学，急救，会计，一项社交技能（魅惑、话术、恐吓、说服），法律，科学（药学），外语，任意一项其他个人或时代特长。",
    "【177】\n【科学搜查研究员】\n【信誉】：30-50\n【职业属性】：教育×4\n【本职技能】：艺术（摄影），医学，法律，科学（化学，司法科学，药学），侦察，任意一项其他个人或时代特长。",
    "【178】\n【山岳救援队员】\n【信誉】：10-50\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：急救，聆听，跳跃，追踪，攀爬，领航，生存（山地），外语。",
    "【179】\n【舞者】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演类，如表演、演唱、喜剧等），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【180】\n【服装设计师】\n【信誉】：20-60\n【职业属性】：教育×4\n【本职技能】：会计，技艺（摄影），技艺（任一），计算机或图书馆，乔装，心理学，侦察，任意一项其他个人特长。※可以通过成功的「侦察」检定，从对方的服饰判定其地位和收入等。",
    "【181】\n【海上自卫队员】\n【信誉】：9-30\n【职业属性】：教育×4\n【本职技能】：电气维修或机械维修，格斗，射击，急救，领航，驾驶（船），生存（海上），游泳。",
    "【182】\n【海警】\n【信誉】：20-40\n【职业属性】：教育×4\n【本职技能】：急救，机械维修，博物学，领航，一项社交技能（魅惑、话术、恐吓、说服），驾驶（船），侦察，游泳。",
    "【183】\n【陆上自卫队员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【184】\n【私人军事公司成员】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【185】\n【冒险家教授】\n【信誉】：55-80\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：攀爬或游泳，射击，历史，跳跃，博物学，领航，外语，生存。",
    "【186】\n【评论家】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），历史或图书馆，母语，外语，心理学，潜行。",
    "【187】\n【偶像】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演,歌唱,舞蹈），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【188】\n【歌手】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（歌唱,舞蹈,乐器），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【189】\n【搞笑艺人】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演,杂技,喜剧），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，任意两项其他个人或时代特长。",
    "【190】\n【运动员艺人】\n【信誉】：9-20\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：攀爬，闪避，跳跃，投掷，侦察，游泳，任意两项其他个人或时代特长。",
    "【191】\n【播音员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【192】\n【主持人】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【193】\n【电视解说员】\n【信誉】：50-80\n【职业属性】：教育×4\n【本职技能】：艺术（表演），母语，魅惑，话术，说服，心理学，任意两项其他个人或时代特长。",
    "【194】\n【网络明星】\n【信誉】：9-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：技艺（表演，歌唱，喜剧），乔装，两项社交技能（魅惑、话术、恐吓、说服），聆听，心理学，计算机，电气维修。",
    "【195】\n【经纪人】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：汽车驾驶、两项社交技能（魅惑、话术、恐吓、说服），潜行，聆听，法律，任意两项其他个人或时代特长。",
    "【196】\n【捉鬼人】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：神秘学，科学（物理，化学，生物），机械维修，艺术（摄影），电气维修，一项社交技能（魅惑、话术、恐吓、说服）。",
    "【197】\n【占卜师、灵媒师】\n【信誉】：9-30\n【职业属性】：教育×2＋教育或外貌×2\n【本职技能】：艺术（表演），历史，图书馆，两项社交技能（魅惑、话术、恐吓、说服），神秘学，心理学，任意一项其他个人或时代特长。",
    "【198】\n【机械师】\n【信誉】：9-40\n【职业属性】：教育×4\n【本职技能】：技艺（木工、焊接、管道工等），攀爬，汽车驾驶，电气维修，机械维修，操作重型机械，任意两项其他个人或时代或技术特长。",
    "【199】\n【厨师】\n【信誉】：9-30\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：手艺（烹饪），科学（生物，化学），格斗（斗殴），博物学，侦察，外语，任意一项其他个人或时代特长。",
    "【200】\n【网络犯罪者】\n【信誉】：10-70\n【职业属性】：教育×4\n【本职技能】：计算机，电气维修，电子学，图书馆，侦察，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他技能。",
    "【201】\n【佣兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：攀爬或游泳，闪避，格斗，射击，潜行，生存，下面任选两项：急救、机械维修、外语。",
    "【202】\n【自宅警备员】\n【信誉】：1-10\n【职业属性】：教育×4\n【本职技能】：计算机，聆听，潜行，图书馆，母语，任意三项符合尼特族形象的特长。",
    "【203】\n【壮汉保镖】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），射击，急救，一项社交技能（魅惑、话术、恐吓、说服），法律，心理学，侦察和下面的一种个人特长：汽车驾驶或骑术。",
    "【204】\n【游戏测试员】\n【信誉】：9-20\n【职业属性】：教育×4\n【本职技能】：手艺（游戏），计算机，电气维修，电子学，聆听，一项社交技能（魅惑、话术、恐吓、说服），任意两项其他个人或时代特长。",
    "【205】\n【交际花】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌×2\n【本职技能】：艺术（任意），估价，潜行，一项社交技能（魅惑、话术、恐吓、说服），急救，其他语言（欧洲），心理学，骑术，（乔装、钳工）中的一种，任意一项其他个人或时代特长",
    "【206】\n【考古学家】\n【信誉】：30-60\n【职业属性】：教育×4\n【本职技能】：会计，艺术（任意），估价，历史，图书馆，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意两项其他个人或时代特长",
    "【207】\n【贵族】\n【信誉】：70-99\n【职业属性】：教育×2＋教育或外貌×2\n【本职技能】：拉丁语，法律，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），骑术，射击（霰弹枪），任意三项其他个人或时代特长",
    "【208】\n【艺术家】\n【信誉】：10-40\n【职业属性】：教育×2＋敏捷或意志×2\n【本职技能】：艺术及手艺（任意多种），估价，历史，图书馆，其他语言（欧洲），侦查，任意两项其他个人或时代特长",
    "【209】\n【作家】\n【信誉】：10-40\n【职业属性】：教育×4\n【本职技能】：艺术（写作），历史，图书馆，其他语言（欧洲），母语，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长",
    "【210】\n【马车夫】\n【信誉】：3-10\n【职业属性】：教育×2＋敏捷×2\n【本职技能】：闪避，马车驾驶，跳跃，聆听，机械维修，博物学，导航，一项社交技能（魅惑、话术、恐吓、说服），侦查，格斗（鞭），任意一项其他个人或时代特长",
    "【211】\n【牧师】\n【信誉】：20-65\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：历史，拉丁语，图书馆，一项社交技能（魅惑、话术、恐吓、说服），心理学，任意两项其他个人或时代特长",
    "【212】\n【咨询侦探】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：人类学，估价，科学（化学），急救，历史，法律，图书馆，聆听，心理学，其他语言（任意），侦查，追踪，任意两项其他个人或时代特长",
    "【213】\n【工匠】\n【信誉】：9-35\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：会计，估价，手艺（任意多种），机械维修，一项社交技能（魅惑、话术、恐吓、说服），侦查，任意一项其他个人或时代特长",
    "【214】\n【罪犯】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：估价，乔装，一项社交技能（魅惑、话术、恐吓、说服），潜行，锁匠，格斗（任意两项），任意一项其他个人或时代特长",
    "【215】\n【业余艺术爱好者】\n【信誉】：10-70\n【职业属性】：教育×2＋外貌×2\n【本职技能】：任意六项个人或时代特长",
    "【216】\n【艺人】\n【信誉】：10-40\n【职业属性】：教育×2＋外貌或意志×2\n【本职技能】：艺术（任意多种），乔装，闪避，两项社交技能（魅惑、话术、恐吓、说服），聆听，母语，心理学，任意三项其他个人或时代特长",
    "【217】\n【退役军官】\n【信誉】：40-75\n【职业属性】：教育×4\n【本职技能】：潜行，急救，射击（手枪、来复枪）,导航，其他语言（任意）,一项社交技能（魅惑、话术、恐吓、说服）,心理学，骑术,格斗（剑），侦查，（攀爬、游泳）中的一种",
    "【218】\n【探险家】\n【信誉】：45-70\n【职业属性】：教育×2＋外貌或敏捷或力量×2\n【本职技能】：人类学，考古学，估价，科学（生物学），攀爬，急救，射击（手枪、来复枪），格斗（斗殴），博物学，导航，其他语言（任意），驾驶（小艇，船，热气球），骑术，潜行，侦查，游泳，追踪",
    "【219】\n【私家侦探】\n【信誉】：9-40\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，两项社交技能（魅惑、话术、恐吓、说服），法律，图书馆，聆听，锁匠，艺术及手艺（摄影），侦查，任意一项其他个人或时代特长",
    "【220】\n【记者】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：估价，闪避，两项社交技能（魅惑、话术、恐吓、说服），图书馆，聆听，其他语言（欧洲），母语，艺术及手艺（摄影），心理学，侦查。",
    "【221】\n【劳工】\n【信誉】：0-10\n【职业属性】：教育×2＋力量×2\n【本职技能】：估价，一项社交技能（魅惑、话术、恐吓、说服），闪避，急救，机械维修，重型机械操作，任意一项其他个人或时代特长，以及从以下任选两种：（攀爬，斗殴，手艺（任意），马车驾驶，驾驶：船）",
    "【222】\n【律师】\n【信誉】：20-80\n【职业属性】：教育×4\n【本职技能】：会计，估价，两项社交技能（魅惑、话术、恐吓、说服），历史，拉丁语，法律，图书馆，聆听，心理学，任意两项其他个人或时代特长",
    "【223】\n【医生】\n【信誉】：30-70\n【职业属性】：教育×4\n【本职技能】：科学（生物学、药剂学），急救，拉丁语，图书馆，医学，心理学，任意两项其他个人或时代特长",
    "【224】\n【警察】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：格斗（斗殴），闪避，一项社交技能（魅惑、话术、恐吓、说服），急救，射击（手枪），法律，聆听，心理学，潜行，侦查",
    "【225】\n【教授/学者】\n【信誉】：20-50\n【职业属性】：教育×4\n【本职技能】：图书馆，其他语言（欧洲），一项社交技能（魅惑、话术、恐吓、说服），心理学，至多六种额外的学问技巧作为个人专长",
    "【226】\n【科学家】\n【信誉】：10-60\n【职业属性】：教育×4\n【本职技能】：手艺（任意），历史，图书馆，机械维修，一项社交技能（魅惑、话术、恐吓、说服），侦查，至多六种其他学问技巧作为个人专长",
    "【227】\n【佣人】\n【信誉】：0-10\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：手艺（任意），闪避，聆听，潜行，任意一项其他个人或时代特长，以及从以下中最多选取三个：（会计，估价，马车驾驶，礼仪，急救，其他语言（欧洲），说服）",
    "【228】\n【店主】\n【信誉】：9-30\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：会计，估价，手艺（任意），聆听，一项社交技能（魅惑、话术、恐吓、说服），心理学，侦查，任意一项其他个人或时代特长",
    "【229】\n【士兵】\n【信誉】：9-30\n【职业属性】：教育×2＋力量或敏捷×2\n【本职技能】：闪避，急救，潜行，聆听，机械维修，射击（来复枪），潜行，侦查，任意两项其他个人或时代特长",
    "【230】\n【密探】\n【信誉】：30-70\n【职业属性】：教育×2＋外貌或敏捷×2\n【本职技能】：乔装，一项社交技能（魅惑、话术、恐吓、说服），潜行，历史，图书馆，聆听，锁匠，导航，其他语言（欧洲），心理学，侦查，格斗（任意）"
]
# 特征列表
trait_mec_list = [
    "特征是[娇生惯养]：效果：智力(INT)-1(5)，体质(CON)+2(10)",
    "特征是[粗壮]：效果：体型(SIZ)+1(5)",
    "特征是[灵敏]：效果：敏捷(DEX)+1(5)。当体型(SIZ)小于等于9(45)时，灵敏而又娇小，敏捷(DEX)+2(10)",
    "特征是[时尚]：效果：一直注意着衣装打扮，外貌(APP)+1(5)",
    "特征是[天才]：效果：天生脑袋动得快，智力(INT)+1(5)",
    "特征是[意志坚定]：效果：不会对意志(POW)和SAN带来变动，现在的理智值+5点。但是不能超过最大理智值。",
    "特征是[努力家]：效果：教育(EDU)+1(5)。且无视教育(EDU)带来的年龄下限。",
    "特征是[幸运的守护符]：效果：拥有幸运守护符。只要带在身边意志(POW)+1，如果没带在身边就会招来不幸意志(POW)-1。意志(POW)的增减会影响幸运，但不会影响理智值。",
    "特征是[家传的宝物]：效果：拥有画卷、书籍、武器、家具等宝物，对于探索者或者故事整体带来特别的价值。也许宝物是拥有魔法力量的神器",
    "特征是[无法预期的协助者]：效果：探索者拥有一位对自己尽忠、也许会前来救援的协助者。KP决定协助者是谁，LUCK决定协助者的影响力。",
    "特征是[手指灵活]：效果：任意一个“手艺”的基本成功率为50%。且“机械维修”和“电器维修”+10%",
    "特征是[存在感弱]：效果：一出生就不受人注目。“潜行”和“躲藏”+20%",
    "特征是[有名人之子]：效果：“信用”+20%",
    "特征是[藏书者]：效果：“图书馆”+20%。且就算不去图书馆也可以在自己的书库里进行“图书馆”判定",
    "特征是[观察力敏锐]：效果：“侦查”+30%",
    "特征是[户外爱好者]：效果：“方向感”、“自然史”、“跟踪”+20%",
    "特征是[技能稀奇]：效果：探索者可以在KP的同意下，获得一个对日常生活没有帮助只有特定的人感兴趣的技能，“智力(INT)*5”%",
    "特征是[艺术天赋]：效果：任意的一个“艺术”技能加“智力(INT)*3”%，玩家指定音乐、评论等专业。",
    "特征是[海归]：效果：获得“教育(EDU)*5”%点数，加到最多3个“其他语言”技能上",
    "特征是[前职业]：效果：获得“教育(EDU)*3”%点数，加到玩家决定的前职业的职业技能上",
    "特征是[天气预报员]：效果：看向外面，通过“灵感(IDEA)”判定，则可以预知短时间([1D6+1]小时)内的天气。可以预测到降水概率、风向、风强度、台风的时间带、容易产生落雷的地方等。",
    "特征是[职业车手]：效果：所有“汽车驾驶”技能基本成功率为50%",
    "特征是[暴走族]：效果：所有“驾驶(Pilot)”技能基本成功率为50%",
    "特征是[战士]：效果：把周围的一切都当做武器。所有近战武器(不包括使用肉体的技能)的基本成功率为50%",
    "特征是[枪炮达人]：效果：5个枪支技能的基本成功率为50%",
    "特征是[格斗家]：效果：3个空手战斗技能的基本成功率为50%",
    "特征是[骏捷]：效果：“回避”的基本成功率变为“敏捷(DEX)×5”",
    "特征是[能够信赖的人]：效果：只要还保持自己的好名声，就可以选择任意3个交流系技能，各+10%",
    "特征是[体育全能]：效果：任选4个运动系技能，其中1个技能+20%，3个技能+10%",
    "特征是[平凡的姿容]：效果：“乔装”+20%。对方只见过你一回，并且对方没有通过“灵感(IDEA)”判定的话，你可以用“我大众脸”的借口，让对方以为没见过你。",
    "特征是[眼神凶煞(D)]：效果：外貌(APP)-1(5)，且“信用”-10%",
    "特征是[路痴(D)]：效果：“方向感”基本成功率为1%，且无法通过经验判定获得成长",
    "特征是[害羞(D)]：效果：对异性的“快速交谈”、“说服”、“信用”各-10%",
    "特征是[被动物讨厌(D)]：效果：大多数动物只要看到探索者就会进行恐吓",
    "特征是[不可思议(D)]：效果：也许从别的世界来的精神交换者或是妄想延伸出来的人格会渐渐显形",
    "特征是[吸引物(D)]：效果：容易招怪物的喜爱。如果被怪物带走了的话，不会被杀，而是会被监禁或是更糟糕。",
    "特征是[带着眼镜(D)]：效果：失去眼镜的话，在KP的判断下，关于视觉的技能-20%",
    "特征是[重要的东西(D)]：效果：一直将其他人不重视但是对自己很重要的东西带在身边，如果失去的话丧失理智点1/1D8",
    "特征是[暗黑的祖先(D)]：效果：你是邪恶一族、食人者、超自然怪物的后裔。查看LUCK，骰目越高祖先越邪恶",
    "特征是[害怕夜晚(D)]：效果：深夜12点以后还要活动的话，“灵感(IDEA)”和“知识”判定的成功范围变为各自的1/2。但是擅长早起",
    "特征是[受动物喜欢]：效果：大多数动物会跟探索者亲近",
    "特征是[脑洞]：效果：发疯后，探索者特有的感性可以看穿隐藏在恐怖身后的真相。KP可以在黑幕时为之揭示一部分的宇宙恐怖吧。(但黑幕以外可以什么也不告诉)",
    "特征是[失败是发明之母]：效果：技能判定中骰出“96”或以上骰目，并“失败”的话，立即进行特别的经验判定，失败的话0点，成功则获得1点技能点数",
    "特征是[宠物]：效果：探索者拥有最爱的狗、猫、鸟等。在游戏的一段故事结束后，可以通过相互互动，回复理智值1D3点。但是不能超过能力值SAN或最大理智值点数。",
    "特征是[马虎]：效果：马上就会忘记不好的事情。可以在精神病院或精神治疗科回复的理智值+1。",
    "特征是[病毒抗性]：效果：骰毒物(POT)抵抗表时，成功范围+20%",
    "特征是[潜水达人]：效果：对窒息的体质(CON)判定的成功范围+20%",
    "特征是[酒鬼]：效果：以酒精为毒物的时候，对探索者来说，所有关于酒精的POT为1/2(小数入)。",
    "特征是[顽强]：效果：所有使用抵抗表的时候，成功范围+5%",
    "特征是[招架者]：效果：冲击的体质(CON)判定的成功范围+20%",
    "特征是[奇妙的幸运]：效果：当神格或神话生物随机指定攻击目标时，你被排除在外。单独攻击或范围攻击时，不适用。",
    "特征是[投掷天才]：效果：<投掷>时的武器伤害加值不是1/2，而是适用通常的伤害加值。",
    "特征是[钢铁力量]：效果：伤害加值上升一段(-1D4变成0,0变成+1D4)。但伤害加值是1D6或以上的时候，不上升一段而是加值再+1",
    "特征是[还活着]：效果：从死亡中生还的机会不是下一回合，而是5回合以内。",
    "特征是[看穿弱点]：效果：贯穿的几率不是通常的1/5，而是1/2，但最大为40%。",
    "特征是[快速恢复]：效果：生命力的回复判定结果+1",
    "特征是[不屈精神]：效果：晕倒，则可在接下来的各回合开始时进行[体质(CON)×2]的判定，成功则就算不接受治疗，该回合起也可以再次行动",
    "特征是[收集爱好者]：效果：任选一种收集物。你在该收集方面很有名，通过<幸运>判定的话，对方会感同身受，被你感动。",
    "特征是[失踪的家人]：效果：探索者有家人失踪了，长篇跑团过程中可能会出现(遇到海难、据说死于异国他乡、被其他亲人带走等)",
    "特征是[抱有好感]：效果：你对游戏中登场的某人抱有好感，由KP裁定，该人是谁、为何抱有好感。LUCK决定抱有多大好感(越高越喜欢)"]
# mbti列表
mbti_list = ["INFP：调停者（Mediator）“凡是金子未必都发光，流浪的人未必都迷茫，老而弥坚者不会凋零，深根不会被寒霜触及。（托尔金）”\n共情，慷慨，豁达开明，创造力，热情，有理想；脱离现实，容易自闭，成事困难，易被暗示，情感脆弱，取悦症，自我批判过于严苛\n调停者人格类型的人是真正的理想主义者，他们总是从最坏的人和事中寻找最好的一面，想方设法让情况变得更好。 虽然可能看起来冷静，内向甚至害羞，但他们内心的火焰和热情可以光芒四射。 他们仅占人口的4%，常常被人误解，但当他们找到志同道合的人时，他们之间的和谐就像是快乐和灵感的源泉。指引“调停者”的是他们的原则，而不是逻辑、头脑发热或是实用性。 当决定如何行动时，他们以荣誉、美好、道德和善良为准则，引导他们行动的是纯粹的意图，而非奖惩。调停者人格类型的人以这样的品质为荣，他们也的确应该这样，但不是每个人都能理解这些感情背后的驱动力，这会让他们陷入孤独。\n【“我们知道自己是谁，但不知道自己能成为谁”】——在好的情况下，这些品质使“调停者”能与他人开展深层次的交流，自如地使用明喻和暗喻，理解和创造象征符号来分享看法。 这种直截了当的交流方式很适合创造型工作，也难怪有很多著名的“调停者”都是诗人、作家和演员。 对“调停者”来说，理解自身和周边环境很有必要，他们把自己投射到作品中，以此表达出这些想法。“调停者”非常善于表达自己，擅长使用暗喻和虚构人物来表现自己的美丽和神秘。他们高超的语言能力不仅限于母语，他们有学习第二（甚至第三！）语言的天赋。 他们高超的交流能力也与爱好和谐的愿望完美结合，能够帮助他们在找到目标后顺利前行。\n【“听很多人说，对很少人讲”】——与更擅长交际的人格类型不同的是，他们的注意力只集中在很少的人身上，原因只有一个：分散注意太耗费精力，甚至会因为世界上太多无能为力的坏事而感到沮丧。 对于“调停者”的朋友而言，这是一个令人伤感的情景，他们需要“调停者”展示乐观积极的一面。如果不加注意，“调停者”们可能因为过于用力追求美好而忽视必要的日常琐事。 他们经常陷入沉思，比任何其他人格类型都更享受假设和哲学思考。 如果任其发展，“调停者”也许会减少与人接触，缩回壳中，这可能需要朋友和伴侣非常努力才能把他们拉回现实世界。幸运的是，“调停者”们的情感，创造力，利他和理想主义仿佛春天的花朵，总会不时地报答他们自己和所爱的人，不是通过逻辑和实用性，而是一种时刻启发着同情，善良和美好的世界观。",
             "INTP：逻辑学家（Logician）“借鉴昨天，活在今天，憧憬明天。重要的是绝不停止质疑。（爱因斯坦）”\n善于分析，独到，豁达开明，求知欲，客观；社交割裂，麻木不仁，经常不满足现状，不耐烦，完美主义\n只有3%的人口为逻辑学家型人格，极为罕见，尽管如此，他们也并不以为意，因为他们根本不屑与“平庸”为伍。 逻辑学家们展现出积极主动的创造性，异于常人的视角以及永不枯竭的智慧，这都令他们深感自豪。 人们常常将逻辑学家称为哲学家、思考者，或是爱空想的教授，在历史的长河中，许多科学发现就是他们的智慧之花结出的丰硕果实。\n【“混混噩噩的生活不值得过”】——逻辑学家之所以声名远播，是因为他们提出的各种聪明绝顶的理论和无懈可击的逻辑 — 事实上，他们是所有人格类型中在逻辑方面最为严谨的一类人。具有逻辑学家人格类型的人热衷于各种模式，而发现话语之间的纰漏几乎是他们与生俱来的习惯，所以，对逻辑学家说谎可不是什么明智之举。 颇有讽刺意味的是，逻辑学家的话却不可全信 — 不是因为他们不够诚实，而是因为逻辑学家人格类型的人喜欢在跟自己的辩论中分享并未完全成熟的想法，他们只是为了从他人口中试探对各种想法和理论的意见，而不是将他们作为真正的谈话伙伴。这样一来，人们常常认为这类型人格的人不太可靠，但实际情况却是，在发现问题，深入探究与问题相关的各种因素和细节，并另辟蹊径找到可行的解决之道方面，没有人比逻辑学家更有热情和能力 — 只是别指望他们能按时给你进度报告。 拥有逻辑学家人格类型的人往往对各种按部就班的活动与维护工作兴趣寥寥，但只要他们置身于可以激发其创造基因和潜力的环境，逻辑学家们就会不惜一切代价投入时间和精力，力求制定出富有真知灼见且不偏不倚的解决方案。\n【“智慧始于怀疑”】——他们看上去不务正业，在无止境的白日梦中虚度光阴，但逻辑学家的思维过程从未停息，从他们睁开眼的那一刻起，他们的头脑中总是不断冒出各种想法。 持续的思考让他们看上去像是在沉思或者神游，因为他们经常在自己的脑海里进行激烈的辩论，但当他们与熟人或爱好相近的人相处时，他们又会变得非常放松而友好。 但当逻辑学家人格的人置身于陌生人中间，我们看到的却是他们难以掩饰的羞涩，即便是对他们的结论或理论来点友好善意的谐谑，他们也会认为是受到了指责，很快就会掀起一场口角之争。当逻辑学家格外激动时，说出的话也会变得语无伦次，因为他们会努力解释逻辑结论的一系列链条，而这又会让他们产生最新的想法。 通常情况下，如果别人对逻辑学家所说的内容感到一头雾水难以理解，他们会选择换个话题，而不会用通俗易懂的语言把事情说个明白。而当别人在阐释自己的思维过程时，若充满主观判断和感情色彩，逻辑学家也会选择换个话题。 假设有一个无比复杂的发条装置，它接受任何可能的事实和想法，以充满创意的推理来处理每一个事实和想法，并给出最合乎逻辑的结果 — 这就是逻辑学家大脑的工作原理。这类型人格的人几乎无法容忍情绪化的活动扳手干扰他们的机器运转。\n【“改变世界先改变自己”】——况且，逻辑学家根本不理解情绪化的抱怨为何物，他们的朋友也不会从他们那里得到情感上的支持。 具有逻辑学家人格类型的人更倾向于给出一系列条理清楚的建议去解决根本问题，提出一种在他们那些更加敏感的朋友那里并不受欢迎的观点。 这种情况很可能延伸到一些社交对话和目标上，例如计划晚餐和结婚，因为逻辑学家更关心的是独创性和立竿见影的效果。真正让逻辑学家难以大展拳脚的一点在于，他们对失败有一种永无休止且深入骨髓的恐惧。 逻辑学家人格类型的人很容易对自己的想法和理论推倒重来，会担心自己错过了一些重要的线索，所以他们总是踟蹰不前，迷失在一个无法让自己的想法得见光明的无形世界中。 打消这种自我怀疑，是逻辑学家面临的最严峻的挑战，但在他们克服挑战的过程中，给世人带来的智慧天赋，无论高低多寡，都使他们值得为此一战。",
             "INTJ：建筑师（Architect）“你并非有权力发表看法。你的权利是发表有根据的看法。没人有无知的权利。（哈伦·埃利森）”\n理性，明智且有见识，独立，坚定，求知欲，独到；傲慢，不顾感情，过于苛刻，好争论，社交无知\n人们常说，高处不胜寒。作为人数最少且战略能力最强的人格类型之一，“建筑师”们对此深有体会。 他们仅占人口的 2%，女性则更为稀少，只有 0.8%。这让他们很难找到志同道合能够与其过人的智慧和审慎的思考方式比肩的同类。 建筑师人格类型的人想象力丰富却很果断，雄心壮志但注重隐私，充满好奇心但从不浪费精力。\n【“正确的态度可以达到任何目标”】——他们生来对知识充满渴望，这在他们的人生初期就有所体现，孩童时他们常被叫做书虫。 虽然他们的同龄人把这当成侮辱，他们却可能觉得说的很对，甚至以此为骄傲，享受着自己广博的知识储备。 他们喜欢分享知识，对自己擅长的领域很有信心，但他们更喜欢设计和执行各自领域中的完美计划，而不是对流言蜚语这类无聊的话题发表看法。在很多人看来好似悖论，但从纯粹的理性角度来说，“建筑师”们的生活可以有明显的矛盾却又很有道理。 比如，他们既是爱幻想的理想主义者，又是刻薄的愤世嫉俗者，一个看起来无法共存的冲突。 这是因为“建筑师”相信，有了努力，智慧和思考，就没有做不到的事，与此同时他们又觉得人们太过懒惰，目光短浅，自私自利难成大器。 不过他们的愤世嫉俗并不能阻止他们追求认准的目标。\n【“有关原则的事，绝不动摇”】——“建筑师”们散发着自信和神秘的光环，他们深刻的观察，原创的想法，强大的逻辑使他们能够用纯粹的意志力和人格力量来促成变革。 有时候，“建筑师”们看起来似乎要拆解并重建每个想法和系统，享受这个过程所体现的完美主义甚至道德观念。 跟不上“建筑师”进展的人，或者连其中意义都看不到的人，很可能马上，并永远地失去他们的尊重。规则，限制和传统为“建筑师”们所不齿，他们认为任何事物都应该接受质问和审核，如果被他们发现破绽，就会单方面的发挥他们高超的技术，并实施有时无情但永远独特的方法和思想。这并非冲动之举，事实上无论最终的目标多么有吸引力，“建筑师”们都会尽力保持理性。每一个想法，不论是自己的还是别人的，都要接受类似于“这个方法可行吗”的拷问。 这个机制时刻都在运行着，对任何人任何事都不例外，但它也让建筑师人格类型的人经常因此陷入麻烦。\n【“人在独处的时候才能思考更多”】——“建筑师”们对自己花时间学习过的领域聪明又自信，不幸的是，社会条约并不属于其中之一。 白色谎言和闲聊对于渴望真理和深度的人格类型来说已足够艰难，但“建筑师”们可能已经到了将社会习俗视为彻头彻尾的愚蠢的程度。 讽刺的是，对他们来说最好的方式就是呆在舒服的地方，远离聚光灯，“建筑师”们做熟悉的工作时展现出的自信很容易吸引具有相似气质和兴趣的人，无论在爱情还是其他方面。他们把生命的过程当成一盘大棋，每一步都体现着思考和智慧，时刻评估着对策，战术和备用方案，确保比对手更快一步，以保持对情况的控制并获得最大程度的自由。 这并不是说“建筑师”们会肆意践踏良心，但对很多其他人格类型的人来说，“建筑师”们对感情用事的不屑可能使他们看起来不受道德约束，这也解释了为什么很多虚构的反派角色（和被误解的英雄）都以此人格类型为原型。",
             "INFJ：提倡者/倡导者（Advocate）“每个人都需要做出选择，是走在富有创造力的利他主义之光中，还是具有破坏性的自私自利的黑暗中。（马丁·路德·金）”\n创造力，洞察力，有操守，热情满满，无私，利他主义；对批评敏感，拒绝敞开心扉，完美主义，拒绝平庸枯燥，倾向过度劳累\n提倡者人格类型的人非常稀少，只有不到 1% 的人口属于这种类型，但他们对世界的贡献不容忽视。 他们具有与生俱来的理想主义和道德感，但真正令他们与其他理想主义人格类型区分开来的是，他们果断决绝。他们不是懒散的空想家，而是能脚踏实地完成目标，留下深远的积极影响的人。他们把帮助他人作为生活的意义，虽然你会在营救活动和慈善工作中发现他们的身影，但他们的真正理想是从根本上解决问题，让人们一开始就不会陷入困境。\n【“互帮互助”】——“提倡者”们常常集各种特质于一身： 轻言细语却很有看法，为自己的信念不懈奋斗。 他们坚决果断，但不会把精力用在一己私利上 – 提倡者们行事风格有创造力，富有想象力，充满信念和感性，他们并非为了创造优势，而是建立平衡。 平等主义和因果报应是对他们很有吸引力的思想，他们相信用爱和同情来感化暴君的心是帮助这个世界最好的方式。对提倡者人格类型的人来说，很容易与他人建立联系，他们的话语温暖感性有人情味，而非纯粹的逻辑与事实。 他们的同事和朋友把他们当作安静的外向类型是不无道理的，但他们要知道“提倡者”们需要独处的时间来养精蓄锐，所以对他们的突然离开不要太过惊讶。 “提倡者”们很在乎别人的感受，也希望被以同样的方式对待 — 这有时需要给他们留几天独处的时间。\n【“生命不息，奋斗不止”】——最重要的是，倡导者人格类型的人要记得照顾好自己。 他们对信念的激情很可能超出自己所能承受的范围，一旦热情失控，他们很可能发现自己处于劳累，不健康和紧张的状态。 这在“提倡者”们对抗冲突和批评的时候尤其明显，他们的感性迫使他们尽一切可能逃避那些人身攻击，但是当情况不可避免时，他们会用很不理性且无益的方式反抗。在“提倡者”们看来，世界充满了不必要的不平等。 没有任何其他类型比他们更适合发起一场或大或小的纠错运动。 他们只需要记得，在他们关心这个世界的同时，别忘了关照一下自己。",
             "ENFP：竞选者（Campaigner）“你用什么谋生方式，我不关心；我想知道，你的追求，你是否敢于梦想去触碰你内心的渴望。你的年龄多大，我不关心；我想知道，你是否愿意像傻瓜一样不顾风险，为了爱，梦想，还有活着就该有的冒险。（山居梦客(Oriah Mountain Dreamer)）”\n好奇，洞察力，热心，喜好分享，社交达人，播撒欢乐，温厚和蔼；取悦症，无法在一件事长期集中，因不爱处理单调事务而显得杂乱无章，过于乐于助人，过于乐观，坐立不安\n竞选者人格类型的人是真正富有自由精神的人。 他们常常是聚会上的焦点，但是与眼前的兴奋和快乐相比，他们更享受与人们建立的社会和情感联系。 富有魅力，独立，精力充沛且有同情心，占人口 7% 的他们在人群中随处可见。\n【“一个想法可以改变世界”】——他们长袖善舞，愿意讨好他人，并且受直觉型特点的影响，能够带着旺盛的好奇心和充沛的精力去领悟言外之意。 他们倾向于把生活看成是万物相连的错综复杂的谜题，与把这个谜题看作是一系列系统性的策划的“分析家”们不同的是，竞选者人格类型的人会透过情感，同情和神秘主义的棱镜来观察，并时刻寻找着更深层的含义。竞选者人格类型的人非常独立，不会满足于稳定和安全，他们渴求创造和自由。对很多人格类型来说这些品质都难以抗拒，一旦发现能激发他们想象力的事物，他们会变得精力充沛，充分吸引人们的目光，被同伴们尊为领导者和专家，不过这并不总是喜欢独立的“竞选者”们想要的。 更糟糕的是，他们觉得会被领导地位所带来的行政负担和例行的维护工作所困扰。 他们的自尊依赖于他们提出原创解决方案的能力，他们需要创新的自由。如果被困在无聊的工作中，他们会很快失去耐心或变得沮丧。\n【“不要丢掉那“一点点疯狂””】——幸运的是，“竞选者”们知道如何放松，他们可以在工作时热情努力的理想主义者和舞池中新颖狂热的自由主义者中完美转换，转换速度之快，连最亲密的朋友们也会惊讶不已。 置身于人群，也会给他们一个与他人建立情感联系的机会，帮助他们洞悉能引发朋友和同事积极性的事物。 他们相信每个人都应该花些时间去认可和表达感情，他们的同情心和社交性也使这变成一个自然的话题。但“竞选者”们需要小心的是，如果过于相信直觉，对朋友的动机有过多揣测和期待，就可能误读某些信号并使计划变得困难，而用更直接的方式则可以让事情变得轻松简单。 这种社会压力是让爱好和谐的人格类型夜不能眠的棘手问题。 “竞选者”们非常情绪化且细腻敏感，很容易察觉自己的行为对双方的影响。“竞选者”们会花很多时间去探索社会关系，感受和想法之后，才会释放信任。 一旦他们找到自己在这个世界上的位置，他们的想象力，同情心和勇气很可能会产生惊人的效果。",
             "ENTP：辩论家（Debater）“追寻危险而独立的思想者的脚步。不畏争议表达观点。说出你的想法，宁愿被当作精神病也不受盲从的耻辱。对于你认为重要的问题，无论如何也要表达立场且坚决拥护。（托马斯·约翰·沃森）”\n知识渊博，快速思考，创造力，很擅长头脑风暴，有魅力，精力丰富；好争辩，麻木不仁，无法妥协，三分钟热度，不喜欢实践\n辩论家人格类型的人是故意持相反意见的人，善于把观点和信条剪得支离破碎并撒在空中给所有人看。 与更有决心的人格类型相比，“辩论家”这样做并非想要取得更深层的含义或战略性的目标，而仅仅因为有趣。 没人比“辩论家”们更喜欢头脑的交锋，因为这可以给他们一个运用聪明才智，连结不同想法来证明自己观点的机会。这会产生一种奇怪的并列效果，在他们十分诚实的同时，会为一个并不相信的观点而争论，从别人的角度出发用另一种视角来证明一个事实。故意持相反意见不仅使辩论家人格类型的人更好地理解别人的思考方式，也更好地理解相反观点，因为辩论家就是与之争论的人。这种策略不能与外交家们寻求的相互理解所混淆 — 辩论家们一直在追求知识，有什么求知方式会比从方方面面攻击或拥护一个观点更好呢？\n【“这里没有规则 — 我们想要实现目标！”】——尽管不被别人看好，但也要苦中作乐，辩论家人格类型的人喜欢另辟蹊径，在常规的思维方式中训练思维，这让他们在需要改善现有系统，打破成规发现新出路的情况下有着不可取代的地位。 然而，为具体实施想法所做的日常工作会让他们痛苦不已。 “辩论家”们喜欢头脑风暴，野心勃勃，但他们会尽一切可能避免枯燥乏味的工作。 他们大约仅占人口的 3%，这个比例不多也不少，他们可以创造新颖的想法，再由数量更多，更加挑剔的其他人格类型来做具体实施和维护的后勤工作。“辩论家”们辩论的能力也许会令人烦恼 — 虽然在需要的时候被人欣赏，一旦惹到别人则达不到好的效果，比如在会议上公开质疑老板，或从伴侣的每一句话中挑刺。 他们的心直口快使情况变得更为复杂，他们说话不拐弯抹角，也没有兴趣成为别人眼里感性的富有同情心的人。 志趣相投的人会与“辩论家”们相处得很好，但对于那些更敏感类型的人，以及这个社会整体而言，通常是反对冲突的，倾向于情感，安抚，甚至白色谎言而非不快的事实和冷酷的理性。这会使“辩论家”们感到心灰意冷，他们发现自己争吵式的玩笑常在不经意间惹来麻烦，比如在质疑别人的信念不顾别人感受而触碰底线时。 己所不欲勿施于人，“辩论家”不能容忍被溺爱，也不喜欢别人拐弯抹角，尤其在寻求帮助时。 辩论家人格类型的人觉得自己因目光长远，自信，知识丰富，敏锐的幽默感而受到尊重，但很难成功运用这些品质来发展更深刻的友谊和恋爱关系。\n【“看似繁重的工作让人与机遇失之交臂”】——“辩论家”们在利用他们的天分的路上需要走得更远－他们智力的独立和自由的想象在当他们是管理者，或能被管理者聆听时极有价值，但达到那个位置所需要的坚持是他们最大的困难。一旦他们坐稳了这样一个位置，“辩论家”们要记住如果要实现自己的想法，就需要别人来添砖加瓦 — 如果他们耗费更多时间赢得争论而非建立共识，就会发现所拥有的支持不足以让自己取得成功。 如此擅长故意唱反调，这种人格类型的人会发现，最复杂和最高回报的智力挑战在于如何理解更感性的视角，以及在强调逻辑与发展的同时也懂得关心和妥协。",
             "ENTJ：指挥官（Commander）“你的时间是有限的，所以不要浪费它为别人而活。不要陷入教条 — 活在其他人的思想成果之中。不要让他人意见产生的噪音淹没你自己的心声。最重要的是，要拥有追随你的内心和直觉的勇气。他们已经知道你真正想成为什么。其他所有都是次要的。（史蒂夫·乔布斯）”\n高效，精力充沛，自信，意志坚定，战略性思考，有魅力，鼓舞人心；固执，支配欲，无法妥协，不耐烦，傲慢，无法处理情感，冷酷无情\n指挥官人格类型的人是天生的领导者。 这种人格类型的人天生具有魅力和信心，他们所散发的权威性能召集大家为着一个共同目标努力。 但与领导者人格类型有所不同的是，他们的性格中有着近乎残酷的理性，用强大的动力、坚定的决心和锋芒毕露的思想实现为自己制定的一切目标。 好在只有 3% 的人口具有这种人格类型，否则就会无情碾压那些剩下的大多数胆小又敏感的人格类型 — 但是对于许多我们习以为常的公司和机构，我们都要感谢他们的贡献。\n【“幸福来自于获得成就时的喜悦”】——如果有什么东西是“指挥官”们所热爱的，那一定非挑战莫属，无论挑战大小，他们都会坚定地相信，只要有足够的时间和资源，就没有无法达成的目标。 这种品质让指挥官型人格类型的人成为睿智的企业家，他们高瞻远瞩，能够将精力长期集中在自己的目标上，并且按部就班地执行自己的计划，矢志不移，目标明确，最终成为强大的企业领导者。 这种决断通常是一种自我实现的预言，因为指挥官型人格类型的人会凭借纯粹的意志力努力达成目标，如果换成其他人则可能半途而废，另寻出路，而他们拥有的社交技能也会督促激励着他们身边的人，并取得丰硕的成果。在谈判桌上，无论是在公司环境下还是购买一辆汽车，“指挥官”们始终处于主导地位，毫不留情且锱铢必较。 这不是因为他们冷血无情或者是恶魔的化身，更重要的原因在于，指挥官人格类型的人天生喜欢挑战，喜欢斗智斗勇，拥有在这种环境下造就的智慧，如果对方难以招架，那就休怪“指挥官”让自己成为最后赢家的野心一览无遗。指挥官”脑子里想的是，“我才不在乎你是否把我看作一个冷漠无情的“混球”，只要我一直做个志在必得的“混球”就行。如果问起指挥官会尊重什么，那就是能够在智力上与之比肩的人，行事的准确度和质量能够与之旗鼓相当的人。 指挥官人格类型的人在发现他人的才能方面可谓天赋异禀，这对他们的团队建设（因为即便一个人聪明绝顶，也不可能单打独斗就能成功）大有助益，也能让指挥官们有所收敛，无需时时展现自己的傲慢和屈尊态度。 但是他们也非常善于以令人发指的后知后觉唤起他人的失败感，而这也确实会让指挥官人格类型的人陷入麻烦当中。\n【“培养人际关系技巧”】——在 Analyst Role 集团里，无论何种人格类型，情绪表达都不是他们的强项，但由于他们的社会属性，指挥官人格类型的人所展现的情绪尤其公开，会有更多的人直接感知到他们的情绪。 尤其是在专业的环境下，指挥官人格类型的人动辄就会粉碎一些人敏感的神经，在他们眼里，这些人效率低下，资质平庸或者浑浑噩噩。 对于具有指挥官人格类型的人来说，表露情绪就是在展示自己的弱点，他们很容易因此树敌 — 他们必须牢记一点，自己的成功绝对离不开一个正常运转的团队，这不仅是为了实现他们自己的目标，更是为了得到认可和反馈，而奇怪的是，指挥官人格类型的人对于这些极为敏感。指挥官人格类型的人是名副其实的能量库，他们树立了一种英雄般的形象 — 事实上，他们也担得起英雄这一称谓。 对这种人格类型的人的忠告：他们的地位不仅仅是通过自己的奋斗得来的，也有团队成员在背后的大力支持，因此，必须要承认团队成员的贡献、才能和需要，尤其是从情感的角度，认可团队成员的支持协作，这一点至关重要。 即便他们奉行的是“假装可以，直到自己真正做到”，如果指挥官人格类型的人能够将情绪方面的健康关注点与自身的各项优势结合起来，他们将收获深刻而又令人满意的人际关系，以及所有值得拥有的艰难胜利。",
             "ENFJ：主人公（Protagonist）“你此时此刻做的任何事都会激起涟漪影响他人。你的姿态可以照亮心扉也可以传播焦虑。你的气息可以将爱散发也可以使愁云笼罩。你的一瞥可以唤起欢乐。你的言语可以启发自由。你的每个动作都可能打开一扇心灵之窗。（大卫·戴达）”\n愿意倾听不同观点，可靠，热情，无私，有魅力；不现实，过于理想化，居高临下，过度要求他人，共情过度\n主人公人格类型的人是天生的领导者，充满激情，魅力四射。 这类型人格的人约占人口的 2%，他们常常是我们的政客，教练和老师，帮助、启发他人取得成就并造福整个世界。 他们浑身散发着天然的自信，潜移默化地影响着周围的人，也能够指导他人团结协作，帮助他们提升自己并改进社区，而他们自己也可从中获得自豪感与快乐。\n【“对人们怀着坚定的信心”】——主人公人格类型的人散发着真实、关怀和利他主义的光环，人们常常被他们强大的人格力量所折服，当他们觉得有必要的时候，一定会大胆直言。 对他们来说，与人交流是自然又简单的事情，面对面的交流更是不在话下。他们与生俱来的敏锐洞察力让主人公人格类型的人很容易理解他人的内心活动，无论是通过事实与逻辑还是纯粹的情感。 他们擅长发现他人的动机，看穿表面上毫无关联的活动，并能够把这些想法融合在一起，当成一个共同目标，用令人着迷的口才与人交流。主人公人格类型的人从不掩饰对他人的兴趣，这几乎是他们的一个性格弱点 — 当他们选择相信某人，他们会过度参与别人的问题，过分信任他人。 幸运的是，这种信任常常会成为自我实现的预言，因为他们的利他主义和真诚能够启发他们在乎的人去成为更好的自己。 但如果不够谨慎，他们的过分乐观有时会超出别人愿意或可以接受的程度。主人公人格类型的人也容易落入另一个陷阱： 他们有着惊人的内省和分析自身情感的能力，但如果过分纠结于另一个人的困境，他们可能患上情感上的臆想症，把别人的问题当成自己的问题，并试图解决某个自身并不存在的问题。 如果这些性格达到了受阻于他人所体验的束缚的程度，则主人公类型的人们可能无法走出两难境地，对自己对他人都没有帮助。 当这种情况发生时，主人公人格类型的人一定要抽出身来，用自省能力来区分自身真实的情感和那个需要从另一个角度来看的问题。\n【“...再艰难的挣扎也不能够阻止我们去支持我们坚信的正义目标”】——这种人格类型的人会说到做到、真诚而富有同情心，用富有感染性的热情去领导、团结、鼓舞团队是最令他们快乐的事。主人公人格类型的人是热心的利他主义者，有时甚至会成为他们的一个弱点，他们会勇敢地挺身反抗，并坚决支持他们相信的人和想法。 难怪很多著名的主人公人格类型的人都是影响力深远的政治家和文化领袖 — 这种人格类型想要带领人们走向更加美好光明的未来，无论是领导一个国家走向繁荣，还是领导他的少年垒球队取得一场艰难的胜利。",
             "ISFP：探险家（Adventurer）“在一天中我会变化。醒来时是一个人，睡觉时却明明是另一个人。（鲍勃·迪伦）”\n魅力，情绪敏感，富于想象，热情，好奇，艺术天赋；向往自由而恶意独立自主，无法预测和制定长期计划，容易有压力，过于好胜，上下不定的自尊心\n探险家人格类型的人是真正的艺术家，这并不是说他们是通常意义上的兴高采烈到郊外画几棵小树的画家。 但他们通常都精于此道。 他们会运用审美，设计，甚至选择和行动来打破社会常规。 探险家人格类型的人喜欢用美感和行为方面的实验来颠覆传统的期望。很有可能他们已经说过不止一次“不要控制我！”\n【“很满意自己的身份”】——“探险家”们生活在一个多彩感性的世界，与人们和想法的联系会让他们深受启发。 他们乐于重新解读这些联系，利用自身和新的视角重新实验和发明。 没有人比他们更喜欢用这种方式去探索和体验。 这营造出一种自发性，使“探险家”们看起来变化莫测，甚至对亲密的朋友和所爱的人也是如此。即便这样，“探险家”们却是不折不扣的内向型，在他们退到幕后独自养精蓄锐的时候，会让朋友们大吃一惊。 不过虽然在独处，不代表他们闲坐着，他们利用这样的时间自省，审查并重新评判自己的信条。 与纠结于过去或未来相比，他们更愿意思考此时此刻的自己。 然后摇身一变，从他们退隐的地方归来。“探险家”们喜欢找各种方式来释放自己的激情。 他们比别的人格类型更容易参与有风险的行为，比如赌博和极限运动。 幸运的是，他们与周围环境的协调使他们比别人更擅长这些。 “探险家”们也喜欢与人交往，有种很难抗拒的魅力。他们总会凭借赞美之词软化内心，从即将不负责任鲁莽冒险的边缘拉回来。但是，如果被批评伤害到，结果会很糟糕。 一些“探险家”可以承受措辞友善的评价，把它当作另一个视角，帮助自己把激情指往新的方向。 但如果这些评价刻既刻薄又经不起推敲，他们就会大发雷霆。“探险家”对旁人的感受很敏感且重视和谐。 在面对批评时，他们很难做到走到一边冷静下来远离“风暴中心”。 但活在当下也有其好处，一旦从争论中冷静下来，他们也通常可以不计前嫌，继续前进就当没发生过。\n【“意义存在于生命的每个角落”】——“探险家”面对的最大挑战是计划未来。 找到支持其目标的建设性想法，规划可以制定积极原则的目标，对他们来说并非易事。 与其他人格类型不同的是，“探险家”们不会从资产和退休两个方面去规划未来。 他们通过计划行动和行为来塑造自己的身份，建立由人生体验而不是股票组成的投资组合。如果这些计划和信条是高尚的，“探险家”的行为可以非常无私。但他们也可能建立一个更以自我为中心的身份，行为自私，控制欲强且专门利己毫不利人。 时刻谨记，主动成长为自己想成为的人，这一点至关重要。 培养和维持一个新的习惯可能很不容易，但每天花些时间来理解自己的动机将使“探险家”们能够运用自己的优势来追求任何渴望的事物。",
             "ISTP：鉴赏家/艺术能手（Virtuoso）“我想要享受人生，一个不同的人生。我不想每天去去到同一个地方，遇见同样的人，做一样的工作。我期待有趣的挑战。（哈里森·福特）”\n乐观，精力旺盛，有创造力且脚踏实地，有自然而然的直觉且理性，知晓轻重缓急，擅长处理危机，活在当下，易放松；固执，情绪不敏感，偏好私人空间且缄默，容易感到枯燥，不喜欢承诺和长期付出，在危险边缘试探的乐子人\n艺术能手人格类型的人喜欢用双手和眼睛去探索事物，他们通过冷静的理性主义和精神饱满的好奇心来感知和体验这个世界。 拥有这种人格的人是天生的制造者，他们在不同的项目中穿梭，从创造有用、充足的产物中获得乐趣，并在创造的过程中从外界学习。 艺术能手人格类型的人通常是机械师和工程师，他们亲手拆卸东西，并把它们安装还原到比之前更好一点的状态，从中获得极大的乐趣。他们通过创造、解决难题、反复试验和第一手的经验来探索新想法。 他们喜欢别人对他们的计划感兴趣，有时候甚至不介意别人介入。 当然，这是建立在那些感兴趣的人不会干涉“艺术能手”原则和自由的基础上，并且能够接受以同样的兴趣回报他们。艺术能手人格类型的人喜欢帮助别人和分享他们的经验，特别是他们关心的人。很可惜拥有这种人格类型的人并不常见，大约只占到人口总数的 5%。 艺术能手人格类型的女性尤其罕见，而且她们的角色可能与社会对女性的预期很不相配 — 她们通常从童年开始就被当成是假小子。\n“敢于不同”】——“艺术能手”们天性保守务实，使他们乍看起来很简单，但实际上读懂他们相当不易。 他们友好又缄默，行事冷静但会突然的不由自主，好奇心旺盛但是不能够持续专注于正式的研究，即便是他们的朋友和爱人也常常觉得他们难以捉摸。 他们可以暂时表现得非常忠诚和稳定，但是他们倾向于积累冲动的能量，并在没有任何征兆的情况下爆发出来，将他们的兴趣带到全新的方向。当这一人格类型的人发生巨大变化的时候，他们仅仅是在探索新兴趣的可行性，而不是一味的幻想探索。艺术能手人格类型的人的选择来源于实用的现实主义。他们的心中有很强的公平感，并以此来对待别人。这有助于人们理解他们身上一些令人迷惑的特征。 他们不会过度谨慎，也不会奉行己所不欲勿施于人的信条，反而会更加变本加厉，做出类似的反击，不论好坏，只为公平。艺术能手人格类型的人可能面临的最大的问题是，他们通常行动的太早。他们认为宽容的本性是理所当然的，并且想当然地认为别人也是如此。 他们会第一个讲出令人无动于衷的笑话，过度地参与到别人的项目和嬉笑打闹中。他们或许会因为更有趣的事物出现而突然改变计划。\n【“没有什么比所有都人都赞同更无聊的事情了”】——这种人格类型的人会认识到，许多其他类型的人和自己相比，在规则和可接受的行为上有更坚定的界限 — 感情更加细腻的人格类型不想听到令人无动于衷的玩笑，并且绝对不会自己也说一个，也不会参加喧闹的嬉戏，即使是在气氛融洽的聚会上也如此。 如果局面已经很情绪化，超越这些界线就会事与愿违，难以收场。这种人格类型的人很难揣测他人的情感，但要揣摩他们内心的情感和动机也并非易事，因此这也算是他们所热爱的公平的一种自然体现。 但他们趋向于用行动而非同情来探索与人之间的关系，这种倾向可能会导致一些非常令人沮丧的情况出现。 拥有艺术能手人格类型的人常常在界线和准则中挣扎，他们更喜欢自由自在，并且在需要的时候稍稍出界。如果能与理解他们风格和不可预测性的朋友一起共事，再加上他们的创造力、幽默感和亲力亲为，以创造可行的解决方案和实用的东西，那么“艺术能手”们会一直非常乐意创造各种有用的物品，并真心实意地喜欢它们。",
             "ISTJ：物流师/军需官（Logistician）“我的观察是每当某个任务一个人就可以完成… 两个人就会做得更差，三个或更多人时则几乎没什么行动。（华盛顿）”\n诚实，直接，意志坚强，尽职尽责，非常负责任，冷静而务实，创建和执行秩序，万事通；固执，麻木不仁，不善变通，批判，经常不合理地责备自己\n物流师人格类型的人被认为是数量最多的，大约占人口总数的 13%。 他们有很多明显的特征，例如正直，务实，恪尽职守，使他们深受家庭以及拥护传统，规则，标准的组织的青睐，比如律所，监管部门和军队。 这种人格类型的人愿意为自己的行为负责，为努力完成目标所做的一切感到骄傲。他们会毫不吝啬时间和精力，耐心准确地完成每个任务。他们不喜欢做假设，而是分析周围环境，根据事实采取最切实有效的行动。 他们从不废话，只要他们作出了决定，就会把取得目标需要的所有信息传播给别人，期待他人立刻掌握情况马上行动。 他们不能容忍犹豫不决，在自己的决定受到不切实际，尤其是忽略事实的理论的挑战时会很快失去耐心。如果这些挑战变成了浪费时间的辩论，截止日期越近他们就会变得越发愤怒。\n【“如果你尊重你的名誉，就结交那些优秀的人...”】——他们说做就做，不惜一切代价完成任务，那些不能说话算话的人使他们感到困惑。 如果再加上懒惰和虚伪，就是最为他们所不齿的类型。 因为这样，“军需官”们通常更喜欢独自工作，或至少要建立明确的等级制度，使他们可以确定并达成目标，而不用为别人的不可靠所扰。他们思维敏捷，用事实说话，宁愿自给自足也不愿意依赖别人。 对别人的依赖在他们看来是弱点，他们对责任的热情，可靠，和正直的人格不允许他们落入这样的陷阱。正直的人格对“军需官”很重要，甚至比自己的思想还重要，他们会不惜代价遵守已经建立的规则和准则，敢于承认自己的错误，实话实说，即使这样做会带来灾难性的后果也是如此。 对“军需官”来说，诚信比感性思考重要得多，他们直截了当的方式可能让别人误解他们冷漠，机械化。 这种人格类型的人很难对外表达自己的情绪和好感，但是说他们没感情甚至没人性会让他们很受伤。\n【“...与不合适的人在一起还不如独自一人”】——“军需官”的尽心尽力是很好的品质，使得他们能成就许多，但同时也是能被一些不严谨的人利用的弱点。 他们寻求安全和稳定，把顺畅的运营看作自己的责任，他们可能发现同事和爱人把责任推卸给自己，因为自己总会接受。 他们喜欢保留自己的看法用事实说话，但要等观察得到的证据解释一切可能需要很长时间。“军需官”们要记得照顾自己，他们对稳定和高效的尽心尽力可能使一些长期目标变得困难，因为别人会更加依赖他们，使他们可能常年累积情绪压力，一旦发泄这种压力时，通常为时已晚。 如果他们能找到真正感激和赞扬他们的品质，享受他们的聪慧、清晰和可靠品质的同事或配偶，他们会很满意自己所拥有的使事情稳步向前的能力，因为知道自己是这个完美运行的系统的一部分。",
             "ISFJ：守卫者（Defender）“只有分享才能把爱增加。只用奉献更多才能得到更多。（博恩·崔西）”\n给予支持，可靠，善于观察，热心，努力工作，技能丰富；过于谦虚，经常感到被冒犯，压抑自身感情，过分投入，不愿改变，利他主义\n守卫者人格类型是一个很独特的类型，他们的许多品质都与他们自身的特质不相符。 虽然非常照顾他人的感受，一旦到了需要保护其家人或朋友的时候，会变得非常强悍；虽然安静内向，却有很好的社交技巧和强大的社会关系；虽然追求安全和稳定，但只要他们得到了理解和尊重，就愿意接受改变。 和很多事物一样，具有守卫者人格类型的人作为一个整体不可小觑，他们的身份由他们如何使用这些强项而定义。“守卫者”是真正的利他主义者，非常善良，对相信的人和事物慷慨而富有激情。他们是所有人格类型中占人口总数比例最大的一个类型，接近 13%。 他们既能坚守最好的传统也乐善好施，所以会从事一些有历史感的行业，比如医学，学术，和社会慈善工作。这种人格类型的人（尤其是性格不安定的那一部分）经常一丝不苟到完美主义的程度，虽然他们有拖延的习惯，但他们总能可靠地按时完成工作。 守卫者人格类型的人重视自己的责任，时刻尽最大努力超出预期地让别人满意，无论在家庭还是工作中。\n【“眼见为实”】——守卫者人格类型的人所面临的挑战在于，如何确保让别人注意到自己做的事。 他们总是对自己的成就轻描淡写，虽然这样的善良经常会得到尊重，自私自利的人可能占他们爱奉献和谦虚的便宜，把工作推给他们，荣誉留给自己。 如果想保持自信和热情，“守卫者”们需要知道什么时候说不并用于为自己反抗。天生喜欢社交是内向者身上少见的特点，“守卫者”们不会把出色的记忆力用在数据和琐事上，而是记住人和他们生活中的细节。 他们最擅长赠送礼物，他们天生富有想象力且感情细腻，他们的礼物可以送到接收者的心坎里。 对于被“守卫者”们当作朋友的同事们来说是这样，而在家庭里守卫者们会尽情表达爱意。\n【“我会尽可能地保护你”】——守卫者人格类型的人是一个奇妙的团体，正事没有完成之前，他们绝对不会虚度光阴。 与人亲密接触的能力是其他内向类型遥不可及的，他们使用这些关系来维系一个相互支持的快乐家庭，这对每个参与其中的人来说都很幸运。 他们在聚光灯下可能永远都不会觉得舒服，把团队的成就归功于自己会使他们感到内疚，但如果他们的努力被认可，“守卫者”们从所做的事情中得到的满足是其他人格类型无法企及的。",
             "ESFP：表演者（Entertainer）“我自私，没耐心，还有点缺少安全感。我会犯错，会失控，而且有时让人难以应付。但如果你接受不了我最坏的一面，你就不配拥有我最好的一面。（玛丽莲·梦露）”\n大胆自信，创造性，美感与表现力，实际的，观察敏锐，卓越的社交能力；过于敏感，讨厌冲突且倾向避免，容易感到乏味，不善长远规划，投身某项长期任务困难\n如果有人总是不由自主地开始又唱又跳，可以将其划分为表演者人格类型。 表演者人格类型的人会沉醉于当前的兴奋状态，而且希望人人如此。 说起激励他人，给他人打气助威，表演者人格类型的人会毫不吝惜自己的时间和精力，令人难以招架，任何其他人格类型在这方面都不能与之相提并论。\n【“我们每个人都是明星...”】——表演者人格类型的人是天生的表演者，他们热爱聚光灯，世界就是他们的舞台。 许多具有表演者人格类型的名人本身的确是演员，但是他们在朋友面前也会极尽表演之能事， 聊天时炫弄自己独特而不失率直的幽默感，努力成为目光的焦点，让每一次外出都仿佛置身于派对之中。 他们是十足的社交动物，喜欢最简单的事物，对他们而言，没有什么比跟一大群好友嬉笑玩乐更快乐的事情了。他们不仅仅擅长交谈，表演者人格类型是所有人格类型中拥有最强美感的一类。 无论是装饰打扮、着装，还是设施齐备的家，表演者人格类型的人都会展现出异于常人的时尚美感。 他们一眼就能看出什么是有吸引力的，能够大胆改变周围环境来展现个人风格。 他们天生好奇心旺盛，喜欢研究新设计，对各种风格驾轻就熟。尽管表象并非一贯如此，表演者人格类型的人是心知肚明的：自己并不是全部重点 — 他们观察力敏锐，能够非常敏感地捕捉到他人的情绪。 具有这种人格类型的人，常常是第一个让别人坦率地说出棘手问题的人，他们非常乐意提供情感支持和实用的建议。 但如果问题是出在他们自己身上，表演者人格类型的人更愿意息事宁人，而不是直面问题，迎头解决。 表演者人格类型的人通常都有点戏剧化且激情四溢，但当他们可能成为非议的焦点时，就不是这种情况了。\n【“...理应闪闪发光”】——表演者人格类型的人面临的最大挑战在于，他们常常过度沉溺于眼前的一时痛快，以至于总是忽视自己的义务和责任，正是这些责任和义务才让眼前的快乐变成可能。 复杂的分析，重复的劳动并将统计数据与实际的后果进行匹配，对于具有表演者人格类型的人而言都并非易事。 他们宁愿寄望于运气或机遇，或者干脆从一众朋友那里寻求帮助。 对于具有表演者人格类型的人而言，要让他们长期记录一些事情，例如退休计划或糖摄入量，他们会感到非常头痛，因为并不是总有人在他们身边盯着，帮他们办好这些事情。表演者人格类型的人注重价值和质量，这些本身都是珍贵的品质。 但他们常常不善于规划，因此他们常常寅吃卯粮，入不敷出，信用卡对于他们而言是格外危险的东西。 表演者人格类型的人会将更多精力放在祈祷机遇的垂青，而不是脚踏实地规划长期目标，他们的漫不经心会让一些活动夭折泡汤。在表演者人格类型的人心目中，一旦发现自己因为受到环境的制约而不能与朋友欢聚一堂，简直没有什么比这更令人沮丧的事情了。在需要欢声笑语，或尝试新鲜有趣的事物时，表演者人格类型的人最受欢迎 — 带着大家一起玩最让他们开心。 他们可以聊上几个小时，有时候天南海北而唯独不聊他们想说的主题，他们愿意分享或分担所爱之人的感受，无论开心难过。 只要能记得把事情安排得井井有条，他们就做好了带上朋友，去体验这世界上的一切新鲜事物的准备。",
             "ESTP：企业家（Entrepreneur）“生活，要么是场大胆的冒险，要么什么都不是。（海伦·凯勒）”\n自信，敢于冒险，合理实际，创造力，洞察力，直接，好社交，合群；麻木不仁，不善处理感情，不耐，倾向风险，无视社交规则，可能无法顾大局，反叛常规\n企业家人格类型的人对周围的环境颇有影响 — 在聚会上发现他们的最好方式就是去找那些在人群中穿梭自如的人。 他们带着直接而朴实的幽默谈笑风生，喜欢成为人群中的焦点。 如果观众被邀请上台，他们会自荐，或推荐一个害羞的朋友。理论，抽象概念和单调乏味的关于全球问题及其影响的讨论很难令他们长时间保持兴趣。 他们的对话充满活力，也不乏智慧，他们喜欢讨论此时此刻的事，或者干脆动身去做。 企业家人格类型的人不会瞻前顾后，他们会在前进的过程中改正错误，而不是闲坐着思考备用计划和撤退方案。\n【“永远不要混淆动作与行动”】——企业家人格类型是最容易冒险的人格类型。 他们活在当下说做就做，是风暴的中心。 这种人格类型的人享受戏剧性，激情和快感，不是追求情绪的波动起伏而是为了对他们的逻辑思维带来刺激。 他们会在快速理性的刺激反应中根据眼前的实际情况作出重要决策。这使他们很难适应学校和其他秩序井然的组织。 这当然不是因为他们不聪明，事实上他们可以做得很好，而是因为正规教育所采用的受管制的教学方法与他们喜欢的实践学习方法相去甚远。 需要非常成熟的心态才能意识到这是成功所需的重要步骤，能创造更多令人兴奋的机会。同样具有挑战性的是，他们认为使用自己的道德标准比使用别人的更有意义。 规则就是用来打破的。 不过这种观点很难得到中学教师和公司上级的认可，反而会影响他们的名声。 如果他们能少惹麻烦，在枯燥的事情上投入更多精力和关注，他们的能力将不可限量。\n【“大多数人没有专心在听”】——他们也许是最有感知力和洞察力的类型，善于捕捉微小的变化。 无论是面部表情，衣着还是习惯的变化，这种人格类型的人都能发现别人根本注意不到的隐藏着的思想和动机。 企业家人格类型的人会立即利用这些观察，指出变化，提出问题，却很少考虑其敏感性。 他们必须注意的是，不是所有人都想让自己的秘密和决策公之于众。有些时候却亟需他们的观察力和行动力，比如一些企业环境里，尤其是紧急情况下。如果他们不够小心，可能会过于注重当下，有失分寸而伤害到那些感情更细腻的人，或者忽略了他们自己的健康与安全。 企业家人格类型的人只占人口的 4%，尽管有很多“企业家”让我们身边充满火药味，剑拔弩张，但是也不会多到引发系统性风险。“企业家”们激情满怀，能量爆棚，还有一个理性的，偶尔分神的大脑。 他们具有启发性，令人信服，生活丰富多彩，是天生的团队领导者，他们会带领大家走上一条少有人走的道路，为我们的所到之处带来生机与乐趣。 对他们而言，真正的难题是如何把这些品质用在有建设性且回报丰厚的目标上。",
             "ESTJ：总经理/执行官（Executive）“良好的秩序是一切的基础。（埃德蒙·伯克）”\n专心致志，意志坚定，直爽坦诚，忠诚，有耐心，可靠，喜爱建立秩序，出色的组织管理者；固守己见，不爱变通，不适应破例情况，批判，因社会地位和期望而过于自律，不易放松，情绪表达困难\n执行官人格类型的人是传统和秩序的代表，利用他们对正确，错误，和社会标准的理解来团结家庭和社区。 他们诚实，爱奉献，有尊严，他们的明确建议和指导被人看重，也愿意披荆斩棘，带领大家努力前行。 他们会因为团结大家而骄傲，常常承担起社区组织者的角色，努力组织大家一起庆祝当地重要的节日，或守护着那些使家庭和社区紧密相连的传统价值观。\n【“有尊严的人当为正义而战...”】——民主社会非常需要这样的领导者，他们占人口的 11% 以上，难怪全世界有很多著名的政治家和商业领袖都具有这一人格类型。 他们坚信法律的规则和掌握权利的重要性，他们的领导方式是以身作则，尽心尽力，诚实果断，坚决反对懒惰和作弊，尤其在工作时。 他们认为踏实努力工作是塑造品格的最佳方式。他们对周围的事务了如指掌，生活在一个由明确的事实组成的世界。对自己知识的确定性，使他们能够在受到很大阻力时依然能坚守原则，并坚持明确的是非观。 他们的看法绝非纸上谈兵，而是非常愿意深入研究最具挑战性的项目，并在过程中改进行动计划和捋清细节，即便是最复杂的任务，也会因此变得简单可行。但是，执行官人格类型的人不会单打独斗，他们希望自己的可靠性和职业道德能够有所回报。这种人格类型的人言出必行，如果合作伙伴或下属的无能懒惰甚至是欺诈行为威胁到承诺的兑现，他们绝不会压抑怒火。 他们因此落下了不懂变通的名声，但这并不是因为他们顽固不化，而是因为他们真的相信这些价值观是社会良性运行的基础。\n【“...勇于承担错误的人是值得称赞的”】——执行官人格类型的人是典型的模范公民： 他们帮助邻里，遵纪守法，努力确保每个人都参与到他们所珍视的社区和组织中。执行官人格类型的人面临的最大的挑战，是需要意识到不是所有人都会走同样的路或以同样的方式贡献力量。 真正的领导者既能发现个人和团体的优势，也能鼓励大家各抒己见畅所欲言。 唯有如此，执行官人格类型的人才能掌握所有事实，并领导大家沿着最适合他们的方向前进。",
             "ESFJ：执政官（Consul）“让我们互相支持，鼓舞，赋予力量。 让每个人的正能量都被所有人感受到。（黛博拉·戴）”\n技能丰富，责任心强，十分忠实，对他人敏感且温暖，社交达人；过于在意社交地位和影响，被社交规范限制，不愿创新和改变，对批评敏感，过于渴望关注，无意义的无私\n最适合形容“执政官”们的词就是“受欢迎”了 — 这也符合常理，因为他们大约占人口的 12%，是非常常见的类型。 在中学里，他们常常是拉拉队员或四分卫，在聚光灯下带领着队伍走向胜利和荣誉。 在以后的人生里，“执政官”同样享受去支持他们的朋友和爱着的人，组织聚会，尽一切可能让每个人开心。他们是打心底里的社会动物，时刻知道朋友们的最新动向。讨论科学理论，辩论国际政治不太可能维持“执政官”们的兴趣。 他们更在乎一些有形的实实在在的东西，例如提升社会地位，观察他人的举动。 关注周围的动态是他们必做的事情，但执政官人格类型的人会尽一切努力把他们的能力用在好的地方。\n【“尊重领导者的智慧”】——“执政官”们是利他主义者，他们极其认真地承担起帮助别人和做正确的事的责任。 与更为理想主义的人格类型不同的是，“执政官”们的道德指南针基于已有的传统和法律，他们支持权威和规则，而不会去从哲学和神秘主义中总结道德标准。 他们需要记住的是，人们来自很多不同的背景，有不同的思考角度，自己所认为对的事情并不总是真理。执政官人格类型的人喜欢助人为乐，享受做有意义的事情，只要他们的重要性被认可并受到感激。 这在家庭中尤其明显，“执政官”是忠诚爱奉献的伴侣和父母。 执政官人格类型的人尊重等级，努力使自己取得一定的权利，无论在家庭还是工作中，这使他们可以让每个人的分工明确，稳定，有秩序。\n【“和谐的关系”】——执政官人格类型的人活泼外向，乐于助人，聚会上总少不了他们的身影 — 他们总有时间跟每个人聊天嬉笑！ 但他们的投入绝非点到为止。 执政官人格类型的人发自内心地愿意倾听朋友的感情和动向，会记住小细节并时刻准备着用温暖的话语和细腻的情感表达自己的想法。 如果事态发展不对劲，或房间里产生了紧张气氛，他们会很快捕捉到并努力让所有人恢复到和谐稳定状态。执政官人格类型的人很不喜欢冲突，他们用很多精力去建立社会秩序，与未知的活动和自发性的聚会相比，他们更喜欢周全的计划和有组织的活动。 这种类型的人对他们安排的活动会竭尽全力，一旦想法被否定或者别人对此毫无兴趣，就很容易伤害到他们的感情。 重申一下，“执政官”们一定要记住，每个人都来自不同的背景，别人的不感兴趣并非有意针对他们或他们所组织的活动 — 只不过是不适合那些人罢了。与自己的细腻敏感达成妥协，是“执政官”最大的挑战 — 总是会有人反对和批评，虽然很难受，但这也是生活的一部分。 最适合他们做的事就是做他们最擅长的事： 成为一个榜样，解决力所能及的事，享受别人对他们所付出努力的感激。"]
# 穿着列表
app_list = ["奢华",
    "西装",
    "休闲装",
    "正装",
    "运动装",
    "平价",
    "墨镜",
    "衬衫",
    "T恤",
    "项链",
    "帽子",
    "军装风格",
    "耳钉/钉",
    "套衫/针织衫",
    "接发",
    "和服",
    "戒指",
    "项圈/贴颈项链",
    "凉鞋",
    "宽松夹克/套头衫/无袖连衣裙",
    "不注意打扮",
    "西装",
    "披肩外套",
    "白大褂",
    "手套",
    "烟斗",
    "背心",
    "和服",
    "色彩缤纷",
    "和搭档/他人一样",
    "有特征的唇膏",
    "眼罩",
    "靴子",
    "卫衣",
    "围巾",
    "挑染",
    "全权交由理发店决定",
    "内层染",
    "没打理的头发",
    "露肩装",
    "凉鞋",
    "交由妈妈/姐姐/友人等决定24",
    "蝴蝶领结",
    "厚底鞋",
    "汉字 T 恤",
    "高筒礼帽",
    "带有蝴蝶结",
    "编织帽",
    "绷带",
    "爆炸头",
    "（袖口衣领帽边镶毛的）毛边大衣",
    "超高级品牌",
    "单片眼镜",
    "动画角色的Cosplay",
    "放大镜",
    "米字旗图案",
    "女仆装或管家服",
    "学生服",
    "浴衣和服",
    "在哪都穿 T 恤",
    "喜欢的Cosplay"]
# 甜品列表
sweet_list = ["印尼威化饼干",
	"黄金肉松条",
	"椰蓉球",
	"蔓越莓曲奇饼干",
	"可比克",
	"妙脆角",
	"雪丽糍",
	"艾比利蛋糕",
	"好丽友派",
	"鲜虾片",
	"粟米条",
	"玉米花",
	"铜锣烧",
	"德芙巧克力",
	"海苔",
	"大白兔奶糖",
	"花生牛轧糖",
	"瑞士糖",
	"彩虹糖",
	"怡口莲太妃糖",
	"玉米软糖",
	"阿尔卑斯牛奶糖",
	"麦丽素",
	"跳跳糖",
	"石头糖",
	"酒心巧克力",
	"无花果",
	"浪味仙",
	"旺旺雪饼",
	"旺旺仙贝",
	"旺仔小馒头",
	"猫耳朵",
	"辣条",
	"秘制牛肉棒",
	"开心果",
	"山楂片",
	"香脆腰果",
	"可可曲奇饼干",
	"罐装水果糖",
	"肉松卷",
	"奶油瓜子",
	"泡椒凤爪",
	"咸蛋黄饼干","奥利奥",
		"蘑古力",
		"芝士条",
		"奶酪条",
		"果冻",
		"薯片",
		"爆米花",
		"水果糖",
		"棒棒糖",
		"蜜饯",
		"话梅",
		"干脆面",
		"泡泡糖",
		"奶糖",
		"葡萄干",
		"薄荷糖",
		"无花果",
		"牛肉干",
		"烤鱼片",
		"香辣鳗鱼丝",
		"香辣鱿鱼丝",
		"香辣鱿鱼块",
		"碳烤鱿鱼丝",
		"香辣小银鱼",
		"碳烤鱿鱼仔",
		"蜜汁猪肉脯",
		"麻辣猪肉铺",
		"麻辣牛肉",
		"鹌鹑蛋",
		"香辣牛板筋",
		"芒果干",
		"杨梅干",
		"香蕉片",
		"猕猴桃干",
		"草莓冻干",
		"蔓越莓沙琪玛","核桃酥饼","双皮奶","钵仔糕","钵仔糕","姜撞奶","糖不甩","马蹄糕","芋头粿","山药糕","红豆松糕","原味发糕","桂花糖藕糕","椰蓉千层糕","港式萝卜糕","翡翠凉果","桂花年糕","枣泥寿桃包","红糖松糕","蜜枣松糕","虾饺","南瓜糕","绿豆粉粿","咸蛋黄肉包","海鲜包","素菜冬粉包","小笼汤包","芋泥玉米包","绿豆沙蒸包","木瓜糕","白豆沙包","枣泥盖印包","破酥包","香煎牛肉包","黑芝麻包","奶皇包","百花糕","绿豆糕","椰汁糕","豆沙糕","赤豆糕","桂花糕","灯芯糕","海棠糕","玉带糕","水晶糕","粟子糕","烘粟子糕","粟子糕","提拉米苏","马卡龙","可可芭娜娜","薄荷雪拔","焦糖布丁","香草布丁","慕斯蛋糕","戚风蛋糕","忌廉巴夫","布朗尼","嘉莉朵","特玛星浪","茶拉明","蜂蜜松饼","熔岩蛋糕","花色小蛋糕","拿破仑蛋糕","玫瑰奶球","太妃布丁","芝士蛋糕","芒果糯米饭","樱桃派","三明治","芒果班戟","糯米糍","沙河蛋糕","水果馅饼麻团","巧克力海绵蛋糕","椰蓉蛋糕","甜甜圈","芝士蛋糕","巧克力曲奇饼","炸面包","珍多冰","苹果馅饼","太妃饼干","柠檬挞","蜂蜜蛋糕","欧培拉","蛋挞","华夫饼","焦糖布丁","巧克力慕斯","黑森林蛋糕","杏仁羚羊角","流沙牛角包","果仁蜜饼","苹果馅饼"]
# 动机列表
motive_list = {"_年龄": [
    "考虑到其岗位，异常年轻。",
    "年轻的，也许是在其岗位上崭露头角的人。",
    "在他们的岗位上已经年长或成熟。",
    "衰朽的，也许已经过了以前的辉煌期，或者还在坚守。"
],
    "_职业": [
        "街头罪犯、妓女、暴徒、扒手或类似人员。",
        "政府官员，警察，或国家的代理人。",
        "教师、教授或其他教育工作者。",
        "医生、护士、家庭保健员或保健工作者。",
        "日工、油炸厨师、园艺师或地位低下的蓝领。",
        "程序员、技术员、IT官员或其他技术人员。",
        "木匠，水管工，或熟练的蓝领工人。",
        "音乐家、歌手、舞者或其他艺人。",
        "商人、文员、银行家或其他白领工作。",
        "退休或丧失工作能力；重骰得到原来的工作。"
    ],
    "_令人难忘的怪癖": [
        "一个非常令人讨厌的口癖或重复的词语。",
        "保养得一尘不染或时尚的服装。",
        "明显的整容手术，品味不高。",
        "肢体缺失或明显的大疤痕。",
        "非常喜欢动物，可能有很多宠物。",
        "明显的性取向或少数族裔身份。",
        "与其工作有关的不寻常的气味在他们身上萦绕。",
        "总是忘记事情或对简单的事情摸不着头脑。",
        "习惯性的神经性运动抽搐。",
        "对当地的某一民族、阶级或政治团体有强烈的蔑视感。",
        "不得体的着装，太多或太少。",
        "总是要求别人帮忙或 '借钱'，无论是小事还是大事。",
        "有一个难以置信的梦想，以一种无效的方式追梦。",
        "对他们发现的任何情况都有充分的准备。",
        "极其沉默寡言，喜欢用手势交流。",
        "面部有刺青、穿孔或其他积极的身体修饰。",
        "对一个人有不合理的好感或厌恶。",
        "有一个引人注目的不寻常的身体特征。",
        "总是谈论和思考他们的家庭。",
        "性格极其平淡，只对自己的工作感兴趣。"
    ],
    "_社会地位": [
        "一个被遗弃的人，无论是因为职业还是个人素质。",
        "一个未经证实的人或不被信任的新来者。",
        "一个可靠的社区成员。",
        "一个当地的支柱，但却在暗地里犯着违反礼节的罪行。",
        "以前受人尊敬，但现在名声不佳的人。",
        "被许多人爱戴和钦佩，被其他同行羡慕的人。"
    ],
    "_与情况的关系": [
        "一个偶然闯入事件本身的旁观者。",
        "工作与情况的某些部分有关的人。",
        "一个不知情的卒子，对某人的计划是必要的。",
        "被威胁或利益诱导的不情愿的参与者。",
        "有亲戚或朋友成为其受害者的人。",
        "负责隐藏它或调查它的人。",
        "偶然发现其后果或遗迹的人。",
        "已经躲藏起来，被认为已经死亡或沉默的人。"
    ],
    "_驱使他们的问题": [
        "他们或所爱的人受到了暴力威胁。",
        "他们欠了涉事者很多钱。",
        "涉事者对他们进行了严重的勒索。",
        "他们觉得对涉事者有很大的人情债务。",
        "他们对涉事者提供的某种东西上瘾。",
        "他们在犯罪中合作过，现在不敢反抗了。",
        "他们需要一个人情，必须为之服务才能从某人那里赢得。",
        "涉事者如果愿意，可以在经济上毁掉他们。",
        "他们令人不安地经常做出糟糕的选择。",
        "有凶猛的野心，只能由涉事者协助。",
        "他们想要复仇，而涉事者可能会协助他们。",
        "他们对涉事者有严重的误解。"
    ],
    "_他们在这一情况中的优势": [
        "大量的金钱和它所能购买的服务。",
        "个人力量和强大的暴力容忍度。",
        "社区的热爱和他们的快速合作。",
        "一群愿意为他们做任何事的朋友。",
        "在需要时可以获得非法物品和武器装备。",
        "知道一个有利于对付PC的秘密。",
        "对处理问题有帮助的亲属网络。",
        "出色的欺骗和背叛的能力。",
        "一个可怕的庇护者，会惩罚任何伤害他们的人。",
        "作为一个地方官员或政府代理人的认可。",
        "获得一种神秘的力量或邪恶的魔法。",
        "对PC或其朋友和盟友的勒索。"
    ]}
# 特质列表
trait_list = {"描述": [
    "结实的",
    "英俊的",
    "笨拙的",
    "机灵的",
    "迷人的",
    "娃娃脸",
    "聪明的",
    "邋遢的",
    "死人脸",
    "肮脏的",
    "耀眼的",
    "书呆子",
    "年轻的",
    "疲倦脸",
    "肥胖的",
    "啤酒肚",
    "长头发",
    "苗条的",
    "优雅的",
    "稀烂的",
    "矮壮的",
    "苍白的",
    "阴沉的",
    "平庸的",
    "乐观的",
    "棕褐色",
    "皱纹人",
    "古板的",
    "狐臭的",
    "狡猾的",
    "健壮的",
    "娇俏的",
    "筋肉人",
    "魁梧的",
    "迟钝的",
    "虚弱的"
], "思想信念": ["你信仰并祈并一位大能。（例如毗沙门天、耶稣基督、海尔·塞拉西一世）",
            "人类无需上帝。（例如坚定的无神论者，人文主义者，世俗主义者）",
            "科学万能！科学万岁！你将选择其中之一。（例如进化论，低温学，太空探索）",
            "命中注定。（例如因果报应，种姓系统，超自然存在）",
            "社团或秘密结社的一员。（例如共济会，女协，匿名者）",
            "社会坏掉了，而你将成为正义的伙伴。应斩除之物是？（例如毒品，暴力，种族歧视）",
            "神秘依然在。（例如占星术，招魂术，塔罗）",
            "诸君，我喜欢政治。（例如保守党，共产党，自由党）",
            "“金钱就是力量，我的朋友，我将竭尽全力获取我能看到的一切。”（例如贪婪心，进取心，冷酷心）",
            "竞选者/激进主义者。（例如女权运动人，平等主义家，工会权柄）"], "重要之人": ["父辈。（例如母亲，父亲，继母）",
                                                        "祖父辈。（例如外祖母，祖父）",
                                                        "兄弟。（例如妹妹，半血亲妹妹，无血缘妹妹）",
                                                        "孩子。（儿子或女儿）",
                                                        "另一半。（例如配偶，未婚夫，爱人）",
                                                        "那位指引你人生技能的人。指明该技能和该人。（例如学校教师，师傅，父亲）",
                                                        "青梅竹马。（例如同学，邻居，幼驯染）",
                                                        "名人。偶像或者英雄。当然也许你从未见过他。（例如电影明星，政治家，音乐家。）",
                                                        "游戏中的另一位调查员伙伴。随机或自选。",
                                                        "游戏中另一外ＮＰＣ。详情咨询你的守秘人。"],
    "原因": ["你欠了他们人情。他们帮助了你什么？（例如，经济上，困难时期的庇护，给你第一份工作）",
           "他们教会了你一些东西。（例如，技能，如何去爱，如何成为男子汉）",
           "他们给了你生命的意义。（例如，你渴望成为他们那样的人，你苦苦追寻着他们，你想让他们高兴）",
           "你曾害了他们，而现在寻求救赎。例如，偷窃了他们的钱财，向警方报告了他们的行踪，在他们绝望时拒绝救助）",
           "同甘共苦。（例如，你们共同经历过困难时期，你们携手成长，共同度过战争）",
           "你想向他们证明自己。（例如，自己找到工作，自己搞到老婆，自己考到学历）",
           "你崇拜他们。（例如，崇拜他们的名头，他们的魅力，他们的工作）",
           "后悔的感觉。（例如，你本应死在他们面前，你背弃了你的誓言，你在可以助人之时驻足不前）",
           "你试图证明你比他们更出色。他们的缺点是？（例如，懒惰，酗酒，冷漠）",
           "他们扰乱了你的人生，而你寻求复仇。发生了什么？（例如，射杀爱人之日，国破家亡之时，明镜两分之际）"], "意义非凡之地": ["你最爱的学府。（例如，中学，大学）",
                                                                           "你的故乡。（例如，乡下老家，小镇村，大都市）",
                                                                           "相识初恋之处。（例如，音乐会，度假村，核弹避难所）",
                                                                           "静思之地。（例如，图书馆，你的乡土别墅，钓鱼中）",
                                                                           "社交之地。（例如，绅士俱乐部，地方酒吧，叔叔的家）",
                                                                           "联系你思想/信念的场所。（例如，小教堂，麦加，巨石阵）",
                                                                           "重要之人的坟墓。（例如，另一半，孩子，爱人）",
                                                                           "家族所在。（例如，乡下小屋，租屋，幼年的孤儿院）",
                                                                           "生命中最高兴时的所在。（例如，初吻时坐着的公园长椅，你的大学）",
                                                                           "工作地点。（例如，办公室，图书馆，银行）"],
    "宝贵之物": ["与你得意技相关之物。（例如华服，假ＩＤ卡，青铜指虎）",
             "职业必需品。（例如医疗包，汽车，撬锁器）",
             "童年的遗留物。（例如漫画书，随身小刀，幸运币）",
             "逝者遗物。（例如烛堡，钱包里的遗照，信）",
             "重要之人给予之物。（例如戒指，日志，地图）",
             "收藏品。（例如撤票，标本，记录）",
             "你发掘而不知真相的东西。答案追寻中。（例如，橱柜里找到的未知语言信件，一根奇怪的从父亲出继承来的来源不明的风琴，花园里挖出来的奇妙的银球）",
             "体育用品。（例如，球棒，签名棒球，鱼竿）",
             "武器。（例如，半自动左轮，老旧的猎用来福，靴刃）",
             "宠物。（例如狗，猫，乌龟）"], "特点": ["慷慨大方。（例如，小费大手，及时雨，慈善家）",
                                      "善待动物。（例如，爱猫人士，农场出生，与马同舞）",
                                      "梦想家。（例如，惯常异想天开，预言家，创造者）",
                                      "享乐主义者。（例如，派对大师，酒吧醉汉，“放纵到死”）",
                                      "赌徒，冒险家。（例如，扑克脸，任何事都来一遍，活在生死边缘）",
                                      "好厨子，好吃货。（例如，烤得一手好蛋糕，无米之炊都能做好，优雅的食神）",
                                      "女人缘/万人迷。（例如，长袖善舞，甜言蜜语，电眼乱放）",
                                      "忠心在我。（例如，背负自己的朋友，从未破誓，为信念而死）",
                                      "好名头。（例如，村里最好的饭后聊天人士，虔信圣徒，不惧任何危险）",
                                      "雄心壮志。（例如，梦想远大，目标是成为BOSS，渴求一切）"]}

# timer计算
place = "某地"
weather = "晴"
time = datetime.now().strftime("%H:%M")
date = datetime.now().strftime("%Y/%m/%d %A")
# 自动Timer计算
_secondsTime = 0
# 角色语速（字/秒）
_speechspeed = 5

time_1s = ["语", "法律", "历史", "司法科学", "地质学", "估价", "人类学", "考古学", "天文学", "生物学", "植物学", "化学", "密码学", "克苏鲁神话", "数学", "气象学",
           "博物学", "神秘学", "药学", "物理", "读唇", "骑术", "生存", "动物学"]
time_3s = ["心理学", "聆听", "侦查", "斗殴", "闪避", "斧头", "连枷", "矛", "剑", "鞭子", "弓", "手枪", "机枪", "步枪", "霰弹枪", "步枪/霰弹枪", "冲锋枪",
           "急救",
           "困难跳跃", "跳跃", "攀爬", "困难攀爬", "妙手", "投掷", "困难投掷", "炮术", "爆破"]
time_1min = ["困难骑术", "困难法律", "驾驶", "会计", "困难侦查", "困难聆听", "困难心理学", "恐吓", "说服", "魅惑", "话术", "链锯", "困难急救", "极难跳跃", "极难攀爬",
             "困难妙手", "极难投掷", "困难潜行", "重武器", "火焰喷射器", "锁匠"]
time_5min = ["极难骑术", "重型机械", "极难法律", "潜水", "乔装", "医学", "极难急救", "困难锁匠", "领航", "伪造", "极难妙手", "极难潜行", "极难聆听", "极难心理学"]
time_10min = ["困难乔装", "表演", "美术", "写作", "书法", "舞蹈", "歌剧", "声乐", "摄影", "困难恐吓", "困难说服", "图书馆", "计算机", "电脑", "困难会计",
              "困难魅惑", "困难话术", "极难急救", "困难锁匠", "困难领航"]
time_30min = ["极难乔装", "极难话术", "困难医学", "极难领航", "精神分析", "困难追踪", "木匠", "厨艺", "雕塑", "陶艺", "极难侦查"]
time_1h = ["困难表演", "困难美术", "困难写作", "困难书法", "困难舞蹈", "困难歌剧", "困难声乐", "困难摄影", "困难电气维修", "困难电子学", "困难机械维修", "极难锁匠",
           "困难精神分析", "困难图书馆", "困难计算机", "困难电脑", "极难会计", "困难伪造"]
time_3h = ["极难表演", "极难书法", "极难舞蹈", "极难歌剧", "极难声乐", "极难摄影", "极难电子学", "极难电气维修", "极难医学", "极难精神分析", "极难追踪", "极难计算机", "极难电脑",
           "困难雕塑", "困难陶艺", "困难木匠", "困难厨艺", "极难伪造"]
time_12h = ["极难图书馆", "极难美术", "极难写作", "极难木匠", "极难厨艺", "极难雕塑", "极难陶艺"]
time_1d = []
time_1w = []
time_skill = {"time_1s": time_1s, "time_3s": time_3s, "time_1min": time_1min, "time_5min": time_5min,
              "time_10min": time_10min,
              "time_30min": time_30min,
              "time_1h": time_1h, "time_3h": time_3h, "time_12h": time_12h, "time_1d": time_1d,
              "time_1w": time_1w}

env = {"Place": place, "Weather": weather, "Time": time, "Date": date}

Fumble_SKill = 20  # 启用96以上大失败的技能水平
Critical_Success_SKill = 60  # 启用5以下大成功的技能水平

bot_personality_ = {"Critical_Success": string_list_Critical_Success, "Extreme_Success": string_list_Extreme_Success,
                    "Hard_Success": string_list_Hard_Success, "Success": string_list_Success,
                    "Failure": string_list_Failure, "Fumble": string_list_Fumble,
                    "Fumble_at_96_SKill_Level": Fumble_SKill, "Critical_at_5_SKill_Level": Critical_Success_SKill,
                    "妙语": mav_words, "reason_string_list": reason_string_list,
                    "reason_silent_string_list": reason_silent_string_list, "_encounter_prob":encounter_prob}
bot_personality = bot_personality_
bot_personality_by_name_ = {"卢骰": bot_personality_, "DiceBot": bot_personality_}


# 成功率: 61.85%/70%[60/97]  →eval(_success/_fail+_success)/均值(_luck_exp_value)[成功/成功+失败] →_luck/_luck_exp[_success/_fail+_success]
# 排名: 2[≥73.80%]      →遍历计算 _luck排名 →排名[≥高于百分比%]
# 大成功出现率: 2.06%(2) →大成功出现率 →出现率(出现数): 大成功/成功+失败eval(_critical/_fail+_success)[_critical/_fail+_success] →_critical_rate
# 大失败出现率: 8.24%(8) →大失败出现率 →出现率(出现数): 大失败/成功+失败eval(_fumble/_fail+_success)[_critical/_fail+_success] →
# 加权成功率: 61.85%  →eval(_luck*0.5 + (_critical_rate - _fumble_rate)*0.5) →_luck_weight
# 加权排名: 2[≥73.80%]      →遍历计算 _luck_weight排名:  →加权排名[≥高于百分比%]
# D100统计次数: 161     →掷骰总次数_d100
# 均值/期望[标准差]: 49.04/50.5[25.72%] →d100出目均值(_d100_value)/期望=50.5[标准差(_d100_value)]

def load_luck_by_name():
    try:
        # 尝试从JSON文件加载每个角色的luck(掷骰统计)
        with open('Bots/luck_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {
            'KP': {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0, "_fail": 0, "_fumble": 0,
                   "_fumble_rate": 0, "_critical": 0, "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []},
            'DiceBot': {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0, "_fail": 0,
                        "_fumble": 0, "_fumble_rate": 0, "_critical": 0, "_critical_rate": 0, "_d100_value": [],
                        "_luck_exp_value": []}}


def load_settings_status_icon():
    try:
        # 尝试从JSON文件加载状态的图标信息
        with open('AppSettings/status_icon_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[AppSettings/status_icon_settings.json]不存在，已重新创建json文件！")
        return {'状态名': {"_path": "", "des": ""}}


def load_settings_codename():
    try:
        # 尝试从JSON文件加载每个角色的codename
        with open('AppSettings/codename_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[AppSettings/codename_settings.json]不存在，已重新创建json文件！")
        with open('AppSettings/codename_settings.json', 'w', encoding='utf-8') as file:
            json.dump({'_status': False, 'KP': 'KP', 'DiceBot': 'DiceBot'}, file, indent=4, ensure_ascii=False)
        return {'_status': False, 'KP': 'KP', 'DiceBot': 'DiceBot', 'PL 1': 'PL 1'}


def load_settings_avatar():
    try:
        # 尝试从JSON文件加载头像路径
        with open('AppSettings/avatar_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': '', 'DiceBot': '',
                'PL 1': ''}

def load_san_loss():
    try:
        # 尝试从JSON文件加载物品，附于状态栏之后，标记为“===物品===”
        with open('GameSaves/san_loss.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[GameSaves/san_loss.json]不存在，已重新创建json文件！")
        return {'KP': 0, 'DiceBot': 0,
                'PL 1': 0}
def load_whisper_data():
    try:
        # 尝试从JSON文件加载小窗记录
        with open('GameSaves/whisper_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[GameSaves/whisper_data.json]不存在，已重新创建json文件！")
        return {'KP':{}, 'DiceBot':{}}

def load_items():
    try:
        # 尝试从JSON文件加载物品，附于状态栏之后，标记为“===物品===”
        with open('GameSaves/item_settings_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print(f"文件路径[GameSaves/item_settings_by_name.json]不存在，已重新创建json文件！")
        return {'KP': {"物品": [], "备注": [], "其他": []}, 'DiceBot': {"物品": [], "备注": [], "其他": []}}


def load_DiceBot_personality():
    try:
        # 尝试从JSON文件加载骰子性格路径
        with open('Bots/bot_personality_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return bot_personality_by_name_


def load_env():
    try:
        # 尝试从JSON文件加载
        with open('GameSaves/env_info.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return env


def load_settings_name():
    try:
        # 尝试加载姓名牌路径
        with open('AppSettings/name_settings.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': 'KP', 'DiceBot': 'DiceBot',
                'PL 1': 'PL 1'}


def load_health_data():
    try:
        # 尝试加载角色可变数值路径
        with open('GameSaves/health_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': {'HP': 0, 'MP': 0, '状态': "正常"}, 'DiceBot': {'HP': 0, 'MP': 0, '状态': "正常"},
                'PL 1': {'HP': 0, 'MP': 0, '状态': "正常"}}


def load_health_data_by_name():
    try:
        # 尝试加载角色可变数值路径
        with open('GameSaves/health_data_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {'KP': {'HP': 0, 'MP': 0, '状态': "正常"}, 'DiceBot': {'HP': 0, 'MP': 0, '状态': "正常"}}


def load_infoCanvas_data():
    try:
        # 尝试加载角色简卡图片路径
        with open('AppSettings/infoCanvas_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_CardDeck(name):
    try:
        # 尝试加载角色简卡图片路径
        with open(f'CardDecks/{name}.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_icon_data():
    try:
        # 尝试加载角色状态icon路径
        with open('GameSaves/icon_data.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_role_skill_menu():
    try:
        # 尝试加载角色状态icon路径
        with open('GameSaves/skill_menu_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        print("不存在GameSaves/skill_menu_by_name.json 无法使用快捷技能列表功能！")
        return {'KP': {'技能名[鉴定](要求)效果公式：描述': "skill", '法术名[效果公式](消费)：描述': "spell", '战技/特技名:效果[鉴定](要求)公式': "maneuver"}}


def undo(event, text_box):
    text_box.edit_undo()


def load_infoCanvas_data_by_name():
    try:
        # 尝试加载角色简卡图片路径
        with open('AppSettings/infoCanvas_data_by_name.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_dir_path():
    try:
        # 尝试加载角色差分目录路径
        with open('AppSettings/avatar_dir_path.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_PL_INFO():
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/pl_info.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {}


def load_role_count():
    # 从配置文件加载角色数量，默认为0
    config = configparser.ConfigParser()
    config.read('AppSettings/config.ini')
    return int(config.get('Settings', 'RoleCount', fallback=0))

def load_last_save():
    # 从配置文件加载上次QuickSave存档，默认为""
    config = configparser.ConfigParser()
    config.read('AppSettings/config.ini')
    return config.get('Path', 'SavePath', fallback=0)


role_Chart_detail_demo = {
    "EDU": 0,
    "APP": 0,
    "DEX": 0,
    "STR": 0,
    "INT": 0,
    "CON": 0,
    "POW": 0,
    "SIZ": 0,
    "LUCK": 0,
    "教育": "EDU",
    "外貌": "APP",
    "敏捷": "DEX",
    "力量": "STR",
    "智力": "INT",
    "体质": "CON",
    "灵感": "INT",
    "意志": "POW",
    "体型": "SIZ",
    "幸运": "LUCK",
    "MOV": 8,
    "HP": "(CON+SIZ)/10",
    "MP": "POW/5",
    "SAN": "POW",
    "理智": "POW",
    "克苏鲁神话": 0,
    "克苏鲁": 0,
    "cm": 0,
    "信用": 0,
    "信用评级": 0,
    "会计": 5,
    "表演": 5,
    "美术": 5,
    "写作": 5,
    "书法": 5,
    "木匠": 5,
    "厨艺": 5,
    "舞蹈": 5,
    "歌剧": 5,
    "声乐": 5,
    "摄影": 5,
    "雕塑": 5,
    "伪造": 5,
    "陶艺": 5,
    "人类学": 1,
    "估价": 5,
    "考古学": 1,
    "魅惑": 15,
    "攀爬": 20,
    "计算机": 5,
    "计算机使用": 5,
    "电脑": 5,
    "乔装": 5,
    "闪避": "DEX/2",
    "汽车驾驶": 20,
    "电气维修": 10,
    "电子学": 1,
    "话术": 5,
    "斗殴": 25,
    "链锯": 10,
    "斧头": 25,
    "连枷": 10,
    "矛": 20,
    "剑": 20,
    "鞭子": 5,
    "弓": 15,
    "手枪": 20,
    "重武器": 10,
    "火焰喷射器": 10,
    "机枪": 10,
    "步枪": 25,
    "霰弹枪": 25,
    "步枪/霰弹枪": 25,
    "冲锋枪": 15,
    "急救": 30,
    "历史": 5,
    "恐吓": 15,
    "跳跃": 20,
    "拉丁语": 1,
    "汉语": 1,
    "日语": 1,
    "英语": 1,
    "德语": 1,
    "法语": 1,
    "西班牙语": 1,
    "意大利语": 1,
    "丹麦语": 1,
    "土著语": 1,
    "格陵兰语": 1,
    "俄语": 1,
    "母语": "EDU",
    "法律": 5,
    "图书馆": 20,
    "聆听": 20,
    "锁匠": 1,
    "机械维修": 10,
    "医学": 1,
    "博物学": 10,
    "天文学": 1,
    "生物学": 1,
    "植物学": 1,
    "化学": 1,
    "数学": 1,
    "密码学": 1,
    "工程学": 1,
    "法学": 1,
    "司法科学": 1,
    "地质学": 1,
    "气象学": 1,
    "药学": 1,
    "物理学": 1,
    "动物学": 1,
    "领航": 10,
    "神秘学": 5,
    "重型机械": 1,
    "说服": 10,
    "精神分析": 1,
    "驾驶": 1,
    "飞行器驾驶": 1,
    "船驾驶": 1,
    "心理学": 10,
    "骑术": 5,
    "科学": 1,
    "妙手": 10,
    "侦查": 25,
    "潜行": 20,
    "生存": 10,
    "游泳": 20,
    "投掷": 20,
    "追踪": 10,
    "驯兽": 5,
    "潜水": 1,
    "爆破": 1,
    "读唇": 1,
    "催眠": 1,
    "炮术": 1,
    "DB": 1,
    "#斗殴": "1D3+DB",
    "#链锯": "2D8穿",
    "#斧头": "1D8+2+DB穿",
    "#连枷": "1D8+DB",
    "#矛": "1D8+1穿",
    "#剑": "1D6+DB穿",
    "#鞭子": "1D3+DB/2",
    "#弓": "1D6+DB/2",
    "#手枪": "1D8穿",
    "#重武器": "5D10穿",
    "#火焰喷射器": "2D6+烧穿",
    "#机枪": "2D6+4穿",
    "#步枪": "1D6+1穿",
    "#霰弹枪": "4D6/2D6/1D6",
    "#冲锋枪": "1D10穿",
    "#步枪/霰弹枪": "1D6+1穿",
}


def load_Chart():
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/pl_Chart.json', 'r', encoding='utf-8') as file:
            # print(f"Problematic data: {file.read()}")
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {"KP": {
            "EDU": 0,
            "APP": 0,
            "DEX": 0,
            "STR": 0,
            "INT": 0,
            "CON": 0,
            "POW": 0,
            "SIZ": 0,
            "LUCK": 0,
            "教育": "EDU",
            "外貌": "APP",
            "敏捷": "DEX",
            "力量": "STR",
            "智力": "INT",
            "体质": "CON",
            "灵感": "INT",
            "意志": "POW",
            "体型": "SIZ",
            "幸运": "LUCK",
            "MOV": 8,
            "HP": "(CON+SIZ)/10",
            "MP": "POW/5",
            "SAN": "POW",
            "克苏鲁神话": 0,
            "克苏鲁": 0,
            "cm": 0,
            "信用": 0,
            "信用评级": 0,
            "会计": 5,
            "表演": 5,
            "美术": 5,
            "写作": 5,
            "书法": 5,
            "木匠": 5,
            "厨艺": 5,
            "舞蹈": 5,
            "歌剧": 5,
            "声乐": 5,
            "摄影": 5,
            "雕塑": 5,
            "伪造": 5,
            "陶艺": 5,
            "人类学": 1,
            "估价": 5,
            "考古学": 1,
            "魅惑": 15,
            "攀爬": 20,
            "计算机": 5,
            "计算机使用": 5,
            "电脑": 5,
            "乔装": 5,
            "闪避": "DEX/2",
            "汽车驾驶": 20,
            "电气维修": 10,
            "电子学": 1,
            "话术": 5,
            "斗殴": 25,
            "链锯": 10,
            "斧头": 25,
            "连枷": 10,
            "矛": 20,
            "剑": 20,
            "鞭子": 5,
            "弓": 15,
            "手枪": 20,
            "重武器": 10,
            "火焰喷射器": 10,
            "机枪": 10,
            "步枪": 25,
            "霰弹枪": 25,
            "步枪/霰弹枪": 25,
            "冲锋枪": 15,
            "急救": 30,
            "历史": 5,
            "恐吓": 15,
            "跳跃": 20,
            "拉丁语": 1,
            "汉语": 1,
            "日语": 1,
            "英语": 1,
            "德语": 1,
            "法语": 1,
            "西班牙语": 1,
            "意大利语": 1,
            "丹麦语": 1,
            "土著语": 1,
            "格陵兰语": 1,
            "俄语": 1,
            "母语": "EDU",
            "法律": 5,
            "图书馆": 20,
            "聆听": 20,
            "锁匠": 1,
            "机械维修": 10,
            "医学": 1,
            "博物学": 10,
            "天文学": 1,
            "生物学": 1,
            "植物学": 1,
            "化学": 1,
            "数学": 1,
            "密码学": 1,
            "工程学": 1,
            "法学": 1,
            "司法科学": 1,
            "地质学": 1,
            "气象学": 1,
            "药学": 1,
            "物理学": 1,
            "动物学": 1,
            "领航": 10,
            "神秘学": 5,
            "重型机械": 1,
            "说服": 10,
            "精神分析": 1,
            "驾驶": 1,
            "飞行器驾驶": 1,
            "船驾驶": 1,
            "心理学": 10,
            "骑术": 5,
            "科学": 1,
            "妙手": 10,
            "侦查": 25,
            "潜行": 20,
            "生存": 10,
            "游泳": 20,
            "投掷": 20,
            "追踪": 10,
            "驯兽": 5,
            "潜水": 1,
            "爆破": 1,
            "读唇": 1,
            "催眠": 1,
            "炮术": 1,
            "DB": 1,
            "#斗殴": "1D3+DB",
            "#链锯": "2D8穿",
            "#斧头": "1D8+2+DB穿",
            "#连枷": "1D8+DB",
            "#矛": "1D8+1穿",
            "#剑": "1D6+DB穿",
            "#鞭子": "1D3+DB/2",
            "#弓": "1D6+DB/2",
            "#手枪": "1D8穿",
            "#重武器": "5D10穿",
            "#火焰喷射器": "2D6+烧穿",
            "#机枪": "2D6+4穿",
            "#步枪": "1D6+1穿",
            "#霰弹枪": "4D6/2D6/1D6",
            "#冲锋枪": "1D10穿",
            "#步枪/霰弹枪": "1D6+1穿"
        }
            , "DiceBot": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿"}
            , "PL 1": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿"
            }}
    except json.JSONDecodeError as e:
        print(f"Error in JSON decoding: {e}")
        print(f"Problematic data: {file.read()}")


def load_Chart_at_name():
    try:
        # 按姓名牌加载自定义角色数值信息
        with open('GameSaves/pl_Chart_at_name.json', 'r', encoding='utf-8') as file:
            # print(f"Problematic data: {file.read()}")
            return json.load(file)
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        return {"KP": {
            "EDU": 0,
            "APP": 0,
            "DEX": 0,
            "STR": 0,
            "INT": 0,
            "CON": 0,
            "POW": 0,
            "SIZ": 0,
            "LUCK": 0,
            "教育": "EDU",
            "外貌": "APP",
            "敏捷": "DEX",
            "力量": "STR",
            "智力": "INT",
            "体质": "CON",
            "灵感": "INT",
            "意志": "POW",
            "体型": "SIZ",
            "幸运": "LUCK",
            "MOV": 8,
            "HP": "(CON+SIZ)/10",
            "MP": "POW/5",
            "SAN": "POW",
            "克苏鲁神话": 0,
            "克苏鲁": 0,
            "cm": 0,
            "信用": 0,
            "信用评级": 0,
            "会计": 5,
            "表演": 5,
            "美术": 5,
            "写作": 5,
            "书法": 5,
            "木匠": 5,
            "厨艺": 5,
            "舞蹈": 5,
            "歌剧": 5,
            "声乐": 5,
            "摄影": 5,
            "雕塑": 5,
            "伪造": 5,
            "陶艺": 5,
            "人类学": 1,
            "估价": 5,
            "考古学": 1,
            "魅惑": 15,
            "攀爬": 20,
            "计算机": 5,
            "计算机使用": 5,
            "电脑": 5,
            "乔装": 5,
            "闪避": "DEX/2",
            "汽车驾驶": 20,
            "电气维修": 10,
            "电子学": 1,
            "话术": 5,
            "斗殴": 25,
            "链锯": 10,
            "斧头": 25,
            "连枷": 10,
            "矛": 20,
            "剑": 20,
            "鞭子": 5,
            "弓": 15,
            "手枪": 20,
            "重武器": 10,
            "火焰喷射器": 10,
            "机枪": 10,
            "步枪": 25,
            "霰弹枪": 25,
            "步枪/霰弹枪": 25,
            "冲锋枪": 15,
            "急救": 30,
            "历史": 5,
            "恐吓": 15,
            "跳跃": 20,
            "拉丁语": 1,
            "汉语": 1,
            "日语": 1,
            "英语": 1,
            "德语": 1,
            "法语": 1,
            "西班牙语": 1,
            "意大利语": 1,
            "丹麦语": 1,
            "土著语": 1,
            "格陵兰语": 1,
            "俄语": 1,
            "母语": "EDU",
            "法律": 5,
            "图书馆": 20,
            "聆听": 20,
            "锁匠": 1,
            "机械维修": 10,
            "医学": 1,
            "博物学": 10,
            "天文学": 1,
            "生物学": 1,
            "植物学": 1,
            "化学": 1,
            "数学": 1,
            "密码学": 1,
            "工程学": 1,
            "法学": 1,
            "司法科学": 1,
            "地质学": 1,
            "气象学": 1,
            "药学": 1,
            "物理学": 1,
            "动物学": 1,
            "领航": 10,
            "神秘学": 5,
            "重型机械": 1,
            "说服": 10,
            "精神分析": 1,
            "驾驶": 1,
            "飞行器驾驶": 1,
            "船驾驶": 1,
            "心理学": 10,
            "骑术": 5,
            "科学": 1,
            "妙手": 10,
            "侦查": 25,
            "潜行": 20,
            "生存": 10,
            "游泳": 20,
            "投掷": 20,
            "追踪": 10,
            "驯兽": 5,
            "潜水": 1,
            "爆破": 1,
            "读唇": 1,
            "催眠": 1,
            "炮术": 1,
            "DB": 1,
            "#斗殴": "1D3+DB",
            "#链锯": "2D8穿",
            "#斧头": "1D8+2+DB穿",
            "#连枷": "1D8+DB",
            "#矛": "1D8+1穿",
            "#剑": "1D6+DB穿",
            "#鞭子": "1D3+DB/2",
            "#弓": "1D6+DB/2",
            "#手枪": "1D8穿",
            "#重武器": "5D10穿",
            "#火焰喷射器": "2D6+烧穿",
            "#机枪": "2D6+4穿",
            "#步枪": "1D6+1穿",
            "#霰弹枪": "4D6/2D6/1D6",
            "#冲锋枪": "1D10穿",
            "#步枪/霰弹枪": "1D6+1穿",
            "_AvatarPath": ""
        }
            , "DiceBot": {
                "EDU": 0,
                "APP": 0,
                "DEX": 0,
                "STR": 0,
                "INT": 0,
                "CON": 0,
                "POW": 0,
                "SIZ": 0,
                "LUCK": 0,
                "教育": "EDU",
                "外貌": "APP",
                "敏捷": "DEX",
                "力量": "STR",
                "智力": "INT",
                "体质": "CON",
                "灵感": "INT",
                "意志": "POW",
                "体型": "SIZ",
                "幸运": "LUCK",
                "MOV": 8,
                "HP": "(CON+SIZ)/10",
                "MP": "POW/5",
                "SAN": "POW",
                "克苏鲁神话": 0,
                "克苏鲁": 0,
                "cm": 0,
                "信用": 0,
                "信用评级": 0,
                "会计": 5,
                "表演": 5,
                "美术": 5,
                "写作": 5,
                "书法": 5,
                "木匠": 5,
                "厨艺": 5,
                "舞蹈": 5,
                "歌剧": 5,
                "声乐": 5,
                "摄影": 5,
                "雕塑": 5,
                "伪造": 5,
                "陶艺": 5,
                "人类学": 1,
                "估价": 5,
                "考古学": 1,
                "魅惑": 15,
                "攀爬": 20,
                "计算机": 5,
                "计算机使用": 5,
                "电脑": 5,
                "乔装": 5,
                "闪避": "DEX/2",
                "汽车驾驶": 20,
                "电气维修": 10,
                "电子学": 1,
                "话术": 5,
                "斗殴": 25,
                "链锯": 10,
                "斧头": 25,
                "连枷": 10,
                "矛": 20,
                "剑": 20,
                "鞭子": 5,
                "弓": 15,
                "手枪": 20,
                "重武器": 10,
                "火焰喷射器": 10,
                "机枪": 10,
                "步枪": 25,
                "霰弹枪": 25,
                "步枪/霰弹枪": 25,
                "冲锋枪": 15,
                "急救": 30,
                "历史": 5,
                "恐吓": 15,
                "跳跃": 20,
                "拉丁语": 1,
                "汉语": 1,
                "日语": 1,
                "英语": 1,
                "德语": 1,
                "法语": 1,
                "西班牙语": 1,
                "意大利语": 1,
                "丹麦语": 1,
                "土著语": 1,
                "格陵兰语": 1,
                "俄语": 1,
                "母语": "EDU",
                "法律": 5,
                "图书馆": 20,
                "聆听": 20,
                "锁匠": 1,
                "机械维修": 10,
                "医学": 1,
                "博物学": 10,
                "天文学": 1,
                "生物学": 1,
                "植物学": 1,
                "化学": 1,
                "数学": 1,
                "密码学": 1,
                "工程学": 1,
                "法学": 1,
                "司法科学": 1,
                "地质学": 1,
                "气象学": 1,
                "药学": 1,
                "物理学": 1,
                "动物学": 1,
                "领航": 10,
                "神秘学": 5,
                "重型机械": 1,
                "说服": 10,
                "精神分析": 1,
                "驾驶": 1,
                "飞行器驾驶": 1,
                "船驾驶": 1,
                "心理学": 10,
                "骑术": 5,
                "科学": 1,
                "妙手": 10,
                "侦查": 25,
                "潜行": 20,
                "生存": 10,
                "游泳": 20,
                "投掷": 20,
                "追踪": 10,
                "驯兽": 5,
                "潜水": 1,
                "爆破": 1,
                "读唇": 1,
                "催眠": 1,
                "炮术": 1,
                "DB": 1,
                "#斗殴": "1D3+DB",
                "#链锯": "2D8穿",
                "#斧头": "1D8+2+DB穿",
                "#连枷": "1D8+DB",
                "#矛": "1D8+1穿",
                "#剑": "1D6+DB穿",
                "#鞭子": "1D3+DB/2",
                "#弓": "1D6+DB/2",
                "#手枪": "1D8穿",
                "#重武器": "5D10穿",
                "#火焰喷射器": "2D6+烧穿",
                "#机枪": "2D6+4穿",
                "#步枪": "1D6+1穿",
                "#霰弹枪": "4D6/2D6/1D6",
                "#冲锋枪": "1D10穿",
                "#步枪/霰弹枪": "1D6+1穿",
                "_AvatarPath": ""
            }
        }
    except json.JSONDecodeError as e:
        print(f"Error in JSON decoding: {e}")
        print(f"Problematic data: {file.read()}")


role_Chart = load_Chart().copy()
role_Chart_at_name = load_Chart_at_name().copy()
bot_personality_by_name = load_DiceBot_personality()
adv_comment = ""
Cards_list_by_role = {}


# logging.debug("Variable value: %s", role_Chart_at_name)


class ChatApp:
    def __init__(self, root):
        self.root = root
        self.autoSave_firstTime()
        # 一系列字符串
        string_list_encouragement = [" - Made by 咩碳@mebily & ChatGPT", " - 人品100！这就是全部的陛下庇护！", " - 陛下所言甚是/陶醉", " - "
                                                                                                               "你生而有翼，为何竟愿一生匍匐前进，形如虫蚁？",
                                     " - 好的国王千篇一律 坏的国王万里挑一", " - 变成卢学家后能看自己的头衔互相贴贴吗", " - 导演因染新冠七天没到片场发现剧组被新来的演员带去溜冰",
                                     " - 你的Bug我的Bug好像都一样", " - 新约是不是就像陛下一样可爱", " - 傻卢，罚你一天不见陛下",
                                     " - 送你默默饮泪的泪城纪念雨景球", " - 送你向着它告白就能获得陛下碎片的勇气流星", " - 陛下正在搭建他的绝对帝国", " - 一半的陛下庇护",
                                     " - 陛下那么肥干什么，没有陛下的气质",
                                     " - 陛下很便宜的", " - 情人眼里出陛下", " - 陛下很好养活的", " - 有王吗？", " - 只能说没有陛下漂亮",
                                     ' - "你们都没有我懂陛下！"', " - 就像陛下",
                                     ' - "我是真的对陛下没感觉"',
                                     " - 曾经有一只超可爱的陛下在我面前，我却没有珍惜", " - 感觉陛下有危险！", " - 这个陛下救不了我", " - 成为陛下",
                                     ' - "有毛的都被我干掉了"', " - 陛下，本命链顶端的男人", " - 王学家和卢卢跳舞被陛下追着打",
                                     " - 陛下笑着吃了这个蛋糕，他久违的微笑也让我开心了起来", " - 下午好，今天的小骑士是要油炸呢还是要清蒸呢",
                                     " - 我需要陛下来平息我胸中怒火/翻进白宫", " - 噢可爱的生灵，请告诉我陛下为什么这么美好", " - 咩碳睡了！咩碳希望能梦到陛下！/大声",
                                     " - 有时候，只需一个代名词就能拯救别人一天的好心情。—— 王学家咩碳",
                                     " - 沃姆是不能飞的，所以你一说飞天沃姆，我想到的是被打飞的沃姆你知道吗", " - INTJ可不会被绊倒 —— 会被ENTJ绊倒",
                                     " - 我不懂，我没有背叛过陛下", " - 陛下束紧了我的缰绳，让我无法发疯", " - 陛下，您离遍布生物圈又近了一步",
                                     " - 突然感受到了人类的可爱，我祝福人类（拿着橄榄枝洒圣水）", " - 我去带陛下做核酸", " - 白宫：警惕蛾族打旧日之光牌",
                                     " - 给我一个世设，我能适配整只陛下", " - 死了也是死在陛下怀里", " - 陛下一笑倾城，圣巢虫子都跳虚空自杀以保陛下周全",
                                     " - 太久不上供 就会被踢出白宫", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                                     "", "", "", "", ""]
        # 从列表中随机选择一个字符串
        encouragement = random.choice(string_list_encouragement)
        self.root.title("自嗨团 v1.92" + encouragement)

        # 设置图标
        self.root.iconbitmap("AppSettings/icon.ico")

        # 其他窗口内容
        # self.label = tk.Label(root, text="Hello, Tkinter!")

        # 绑定回车键和Alt+回车键
        root.bind("<Return>", lambda event: self.send_message(self.current_role.get()))
        root.bind("<Control-s>", lambda event: self.quickSave())
        root.bind("<Alt-Return>", lambda event: self.insert_newline())
        root.bind("<Control-Return>", lambda event: self.newline_on_ctrl_enter(event))

        # self.chat_log_huozi = ""
        self.new_combat_windows = {}
        self.luck_by_name = load_luck_by_name()
        self.babel_data = {}
        self.Iconcanvas = {}
        self.Icon_on_avatar = {}
        self.canvas_icon_animate = {}
        self.image_references_on_Avatar = {}
        self.frames_avatar = {}
        self.current_frame_avatar = {}
        self.frames_icon = {}
        self.current_frame_icon = {}
        self.frames_map = {}
        self.current_frame_map = {}
        self.frames_icon_on_canvas = {}
        self.current_frame_icon_on_canvas = {}
        self.role_entries_name_NPC = {}
        self.role_statusbar_health = {}
        self.role_statusbar_icon = {}
        self.ani_frame_icon = {}
        self.role_sstatusbar_mp = {}
        self.image_references_PC = []
        self.image_references_new_map = {}
        self.image_references_FX = {}
        self.infoCanvas_data = load_infoCanvas_data()
        self.infoCanvas_data_by_name = load_infoCanvas_data_by_name()
        self.canvas_animate_icon2 = None
        self.health_data = load_health_data()
        self.health_data_by_name = load_health_data_by_name()
        self.unify_time_log = []
        self.role_Icon_paths = load_icon_data()
        self.votes = {}
        self.role_skill_menu = load_role_skill_menu()
        self.role_items = load_items()
        self.whisper_data = load_whisper_data()
        self.status_icon = load_settings_status_icon()
        self.SAN_loss = {}
        self.SAN = load_san_loss()
        self.SAN_ = {}
        self.last_SAN = {}
        self.NowBGM = ["全部"]
        self.NowImage = []
        self.NowEffect = []
        self.NowDialogState = True
        self.NowCharacterEffect = []
        self.Weather_FX_setting(notjustload=False)
        self.new_window_weather_FX = None
        self.role_dir_path = load_dir_path()
        for role in self.role_dir_path:
            if "Images/AvatarImages" not in self.role_dir_path[role]:
                self.role_dir_path[role] = "Images/AvatarImages"

        # 初始化角色列表
        self.role_count = load_role_count()
        self.roles = ["KP", "DiceBot", "PL 1"]
        self.enemy_matches = {}
        self.codename_by_name = load_settings_codename()
        if "_status" not in self.codename_by_name:
            self.codename_by_name["_status"] = "True"

        # 初始化当前聚焦的头像和文本框
        self.current_role = tk.StringVar(value=self.roles[0])
        self.highlighted_role = self.current_role

        # 初始化TRPG模块
        self.trpg_module = TRPGModule(self, root)
        # self.COC_module = COCModule()
        # 添加按钮，用于展开或缩进掷骰按钮和信息面板
        toggle_button = tk.Button(self.root, text="展开/缩进\nTRPG模块", command=self.toggle_trpg)
        toggle_button.grid(row=2, column=1, padx=10, pady=10, sticky="nsew")
        self.trpg_toggle = "off"

        global date
        global time
        global place
        global weather
        global bot_personality
        global bot_personality_by_name
        global mav_prob
        global encounter_prob
        global log_file_last_name
        # 初始化时间、地点记录栏
        self.env = load_env()
        date = self.env["Date"]
        time = self.env["Time"]
        place = self.env["Place"]
        weather = self.env["Weather"]
        self.time_log = tk.Text(root, wrap=tk.WORD, width=10, height=0, undo=True)
        self.time_log.grid(row=3, column=2, padx=10, pady=10, rowspan=3, sticky="nsew")
        self.time_log.insert(tk.END, "【时间】" + time.upper() + "【地点】" + place + "【天气】" + weather + "【日期】" + date)
        self.time_log.bind("<Button-3>", lambda event, r="timelog": self.add_menu(event, r))
        self.time_log.bind("<Button-1>", lambda event: self.refreshTime(event))
        self.time_log.bind("<FocusIn>", lambda event: self.env_focus(event))

        # 初始化聊天LOG
        self.chat_log = scrolledtext.ScrolledText(root, wrap=tk.WORD, width=50, height=20, undo=True)
        self.chat_log.grid(row=0, column=0, padx=10, pady=10, rowspan=3, sticky="nsew")
        self.chat_log.bind("<Button-3>", lambda event, r="chatlog": self.add_menu(event, r))
        # 在 Text 组件中插入初始文本
        initial_text = "Updates/Todo：详情见readme" \
                       "\nTips:\n.st HP、MP时均修改的是上限，修改实时hp/mp需使用掷骰栏掷骰，或者直接修改\n使用 .st#斗殴@1D3+5 " \
                       "来载入武器伤害公式\n小地图可用于追逐、探索和战斗，更好的战斗体验可以结合CCF。小地图中的M是MOV，不是MP\nNPC活动也可以用程序多开+复制粘贴，但如此就无法无缝RP" \
                       "（而且战斗时无法触发PC的Armor显示、无法同步计算时间等），建议KP栏装载至少一个常用NPC，或者保证留有NPC栏位。\n一些复杂操作：\n[右键姓名牌] 选择简卡图片\n[" \
                       "左键头像栏] 选择头像\n[左键Icon栏] 选择状态Icon\n[右键头像栏/Icon栏] " \
                       "状态Icon叠加/撤销\n[左键@] 在Focus文本框插入@角色名\n[右键@] 插入活字命令\n如果没有头像和状态Icon，就会缩进到Frame内的左侧，左上是状态，左中是头像\n[Enter世界状态栏]发送游戏世界状态至Log\n右键各文本框有惊喜\n" \
                       "===以上可删除===\n\n"
        self.chat_log.insert(tk.END, initial_text)
        self.last_save_path = load_last_save()
        if self.last_save_path != "" and os.path.exists(self.last_save_path):
            #log_file_last_name = self.last_save_path.strip().replace('QuickSaves//', '').replace('QuickSaves/', '').split('.QuickSave')[0]
            log_file_last_name, dot = os.path.splitext(os.path.basename(self.last_save_path.strip().split('.QuickSave')[0]))
            log_filename, dot = os.path.splitext(os.path.basename(self.last_save_path.strip()))
            self.chat_log.insert(tk.END, f"已加载[{log_filename}]\n===以上可删除===\n\n")
            with open(self.last_save_path, 'r', encoding='utf-8') as file:
                content = file.read()
                content = content.replace(initial_text, "")
            if "正在输入..." in content and ">>>" in content:
                self.chat_log.insert(tk.END, content.strip() + "\n\n")
                self.search_and_delete_insert_symbol()
                # 获取最后一行的开始位置
                last_line_start = self.chat_log.index("end-2c linestart")
                # 获取最后一行的结束位置
                last_line_end = self.chat_log.index("end-1c lineend")
                # 删除最后一行
                self.chat_log.delete(last_line_start, last_line_end)
                # 删除行尾的换行符
                self.chat_log.delete(last_line_start)
            else:
                self.chat_log.insert(tk.END, content.strip() + "\n\n")

        # 创建按钮，点击按钮时调用 open_new_window 函数
        self.new_window_button = tk.Button(root, text="推理信息", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

        # 创建按钮，点击按钮时调用 add_NPC 函数
        load_NPC_button = tk.Button(root, text="装载NPC至栏位", command=self.Combat_NPC)
        load_NPC_button.grid(row=3, column=3, padx=10, pady=10, sticky="nsew")

        # 初始化输出聊天LOG按钮
        output_button = tk.Button(root, text="输出聊天LOG", command=self.output_chat_log)
        output_button.grid(row=3, column=0, padx=10, pady=10, sticky="nsew")

        # 初始化输出HTML按钮
        # output_html_button = tk.Button(root, text="输出HTML(施工中)", command=self.output_html_log)
        # output_html_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

        # 初始化角色对应的文字输入框、发送按钮和角色名编辑
        self.role_entries_frame = {}
        self.role_entries = {}
        self.role_entries_name = {}
        self.role_entries_roll = {}
        self.role_roll_button = {}
        self.role_values_tags = {}  # 新增保存数值的tag
        self.role_values_entry = {}
        self.role_values_tags_text = {}  # 新增保存的数值

        for role in self.roles:
            self.role_entries_name[role] = role
            self.image_references_on_Avatar[role] = []
            self.canvas_icon_animate[role] = tk.Canvas(self.root, width=20, height=20)
            self.frames_avatar[role] = []
            self.current_frame_avatar[role] = []
            self.frames_icon[role] = []
            self.current_frame_icon[role] = []
            self.frames_map[role] = []
            self.current_frame_map[role] = []
            self.frames_icon_on_canvas[role] = []
            self.current_frame_icon_on_canvas[role] = []
            if load_settings_name() != "":
                self.role_entries_name = load_settings_name()  # 从文件加载设置
            for r_, rolename_ in self.role_entries_name.items():
                if rolename_ not in self.role_items:
                    self.role_items[rolename_] = {"物品": [], "备注": [], "其他": []}
                if rolename_ not in self.luck_by_name:
                    self.luck_by_name[rolename_] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                    "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                    "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                    "_critical_rate": 0, "_d100_value": [],
                                                    "_luck_exp_value": []}
                if rolename_ not in self.role_skill_menu:
                    self.role_skill_menu[rolename_] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                       '法术名[效果公式](消费)：描述': "spell",
                                                       '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            for r_, rolename_ in load_Chart_at_name().copy().items():
                if r_ not in self.role_items:
                    self.role_items[r_] = {"物品": [], "备注": [], "其他": []}
                if r_ not in self.luck_by_name:
                    self.luck_by_name[r_] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                             "_luck_exp": 0, "_success": 0, "_fail": 0,
                                             "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                             "_critical_rate": 0, "_d100_value": [],
                                             "_luck_exp_value": []}
                if r_ not in self.role_skill_menu:
                    self.role_skill_menu[r_] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                '法术名[效果公式](消费)：描述': "spell",
                                                '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if role in self.role_entries_name:
                if self.role_entries_name[role] not in self.role_skill_menu:
                    self.role_skill_menu[self.role_entries_name[role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
                if self.role_entries_name[role] not in self.role_items:
                    self.role_items[self.role_entries_name[role]] = {"物品": [], "备注": [], "其他": []}
                if role not in self.codename_by_name:
                    if role in self.role_entries_name:
                        self.codename_by_name[role] = self.role_entries_name[role]
                    else:
                        self.codename_by_name[role] = role
            if role in self.role_entries_name:
                if self.role_entries_name[role] not in self.luck_by_name:
                    self.luck_by_name[self.role_entries_name[role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
            else:
                if role not in self.luck_by_name:
                    self.luck_by_name[role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        babel(self)

        self.create_role_frames()
        for i in range(self.role_count):
            self.add_role_init()

        # 为每个文本框绑定焦点变化事件
        self.chat_log.bind("<FocusIn>", lambda event3: self.reset_focus(event3))
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

        # 初始化删除角色按钮
        delete_role_button = tk.Button(root, text="删除角色", command=self.delete_role)
        delete_role_button.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        # 初始化添加角色按钮
        add_role_button = tk.Button(root, text="添加角色", command=self.add_role)
        add_role_button.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        for names in bot_personality_by_name:
            if "_encounter_prob" not in bot_personality_by_name[names]:
                bot_personality_by_name[names]["_encounter_prob"] = encounter_prob
            if names == self.role_entries_name["DiceBot"]:
                bot_personality = bot_personality_by_name[names]
                self.trpg_module.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                self.trpg_module.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                self.trpg_module.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                self.trpg_module.Success = random.choice(bot_personality["Success"]["通用"])
                self.trpg_module.Failure = random.choice(bot_personality["Failure"]["通用"])
                self.trpg_module.Fumble = random.choice(bot_personality["Fumble"]["通用"])
                self.trpg_module.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
                self.trpg_module.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]
                mav_prob = bot_personality["妙语"]["_mav_prob"]  # 妙语概率
                encounter_prob = bot_personality["_encounter_prob"]  # 遭遇事件概率
                print("妙语概率：" + str(mav_prob))
                print("遭遇事件概率：" + str(encounter_prob))
                self.role_entries["DiceBot"].insert("1.0", f"已录入[{names}]的性格！")
                break
            else:
                break

    def Weather_FX_setting(self, notjustload=True):
        file_path = "GameSaves/weather_FX_by_name.json"
        try:
            # 尝试从JSON文件加载天气FX
            with open(file_path, 'r', encoding='utf-8') as file:
                self.weather_FX_items = json.load(file)
        except FileNotFoundError:
            # 如果文件不存在，返回默认设置
            print(f"文件路径[{file_path}]不存在，已重新创建json文件！")
            self.weather_FX_items = {"天气": {}, "地点": {}, "日期": {"春":"", "夏":"", "秋":"", "冬":""}, "时间": {"㏂昼☀":"", "㏂夜◐":"", "㏘昼☀":"", "㏘夜◐":""}}

        if notjustload:
            self.current_path_FX = ""
            self.new_FX_edit_window = tk.Toplevel(root, takefocus=True)
            self.new_FX_edit_window.title(f"编辑天气（及其他）FX")
            # Create widgets
            self.FX_frame = tk.Frame(self.new_FX_edit_window)
            self.FX_frame.pack()

            self.FX_type_label = tk.Label(self.FX_frame, text="FX类型:") #下拉菜单
            self.FX_type_label.grid(row=0, column=0)

            self.FX_type_var = tk.StringVar()
            FX_type_list = []
            for type, content in self.weather_FX_items.items():
                FX_type_list.append(type)
            FX_type_list.append("[新FX列表...]")
            self.FX_type_new_items_entry = ttk.Combobox(self.FX_frame, textvariable=self.FX_type_var, values=FX_type_list)
            self.FX_type_new_items_entry.bind("<<ComboboxSelected>>",
                                           lambda event: self.FX_refresh())
            self.FX_type_new_items_entry.grid(row=0, column=1)

            self.FX_label = tk.Label(self.FX_frame, text="FX名称:") #下拉菜单，根据type变化
            self.FX_label.grid(row=0, column=2)

            self.FX_var = tk.StringVar()
            self.FX_list = []

            self.FX_new_items_entry = ttk.Combobox(self.FX_frame, textvariable=self.FX_var, values=self.FX_list)
            self.FX_new_items_entry.bind("<<ComboboxSelected>>", lambda event: self.FX_image_refresh())
            self.FX_new_items_entry.grid(row=0, column=3)

            self.FX_image_button = tk.Button(self.FX_frame, text="选择FX图片", command=self.select_image_for_FX_icon)
            self.FX_image_button.grid(row=0, column=4)

            self.FX_add_button = tk.Button(self.FX_frame, text="新FX...", command=self.add_entry_for_FX_icon)
            self.FX_add_button.grid(row=2, column=0)

            self.FX_save_button = tk.Button(self.FX_frame, text="保存", command=self.save_json_for_FX_icon)
            self.FX_save_button.grid(row=2, column=2)

    def FX_refresh(self):
        self.FX_list = []
        for type, content in self.weather_FX_items[self.FX_type_var.get()].items():
            self.FX_list.append(type)
        #self.FX_list.append("[新FX名称...]") #暂不支持新增FX种类
        self.FX_new_items_entry = ttk.Combobox(self.FX_frame, textvariable=self.FX_var, values=self.FX_list)
        self.FX_new_items_entry.bind("<<ComboboxSelected>>", lambda event: self.FX_image_refresh())
        self.FX_new_items_entry.grid(row=0, column=3)

    def FX_image_refresh(self):
        if self.FX_type_var.get() != "" and self.FX_var.get() != "":
            if self.FX_type_var.get() in self.weather_FX_items and self.FX_var.get() in self.weather_FX_items[self.FX_type_var.get()]:
                file_path = self.weather_FX_items[self.FX_type_var.get()][self.FX_var.get()]
                if file_path:
                    _, extension = os.path.splitext(file_path)
                    if extension == ".apng" or extension == ".APNG":
                        avatar_path = self.apng_to_gif(file_path, _ + ".gif")
                    elif extension == ".gif" or extension == ".GIF":
                        image = Image.open(file_path)
                        # 获取图像的宽和高
                        width, height = image.size
                        self.canvas_animate_weather_FX = tk.Canvas(self.FX_frame, width=width, height=height)
                        self.canvas_animate_weather_FX.grid(row=1, column=0, padx=0, pady=0, columnspan=4, sticky="nsew")
                        self.frames_weather_FX = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                                  ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        self.current_frame_weather_FX = self.canvas_animate_weather_FX.create_image(0, 0, anchor=tk.NW, image=
                        self.frames_weather_FX[0])
                        # 播放 GIF 动画
                        self.animate(0, self.canvas_animate_weather_FX, self.current_frame_weather_FX, self.frames_weather_FX)
                    else:
                        image = Image.open(file_path)  # 替换为你的图片路径
                        h, w = image.size
                        image = image.resize((int(h / 3), int(w / 3)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_FX[file_path] = photo
                        FX_preview = tk.Label(self.FX_frame, image=photo, relief=tk.FLAT)
                        FX_preview.grid(row=1, column=0, padx=0, pady=0, columnspan=4, sticky="nsew")
                else:
                    FX_preview = tk.Label(self.FX_frame, image="", relief=tk.FLAT)
                    FX_preview.grid(row=1, column=0, padx=0, pady=0, columnspan=4, sticky="nsew")


    def select_image_for_FX_icon(self):
        file_path = filedialog.askopenfilename(title="Select Image",
                                                   filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                   initialdir="ReplayResources/FX")
        if file_path:
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if os.path.exists(
                    'ReplayResources/FX/' + filename + extension):
                pass
            else:
                shutil.copyfile(file_path,
                                'ReplayResources/FX/' + filename + extension)
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                self.canvas_animate_weather_FX = tk.Canvas(self.FX_frame, width=width, height=height)
                self.canvas_animate_weather_FX.grid(row=1, column=0, padx=0, pady=0, columnspan = 4, sticky="nsew")
                self.frames_weather_FX = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                          ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_weather_FX = self.canvas_animate_weather_FX.create_image(0, 0, anchor=tk.NW, image=
                self.frames_weather_FX[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_weather_FX, self.current_frame_weather_FX, self.frames_weather_FX)
            else:
                image = Image.open(file_path)  # 替换为你的图片路径
                h, w = image.size
                image = image.resize((int(h / 3), int(w / 3)), Image.LANCZOS)
                photo = ImageTk.PhotoImage(image)
                self.image_references_FX[file_path] = photo
                FX_preview = tk.Label(self.FX_frame, image=photo, relief=tk.FLAT)
                FX_preview.grid(row=1, column=0, padx=0, pady=0, columnspan = 4, sticky="nsew")
            self.weather_FX_items[self.FX_type_var.get()][self.FX_var.get()] = file_path
            self.current_path_FX = file_path

    def add_entry_for_FX_icon(self):
        if self.FX_var.get() != "" and self.FX_type_var.get() != "":
            FX_preview = tk.Label(self.FX_frame, image="", relief=tk.FLAT)
            FX_preview.grid(row=1, column=0, padx=0, pady=0, columnspan = 4,sticky="nsew")
            if self.FX_type_var.get() not in self.weather_FX_items:
                self.weather_FX_items[self.FX_type_var.get()] = {}
            if self.FX_var.get() not in self.weather_FX_items[self.FX_type_var.get()]:
                self.weather_FX_items[self.FX_type_var.get()][self.FX_var.get()] = ""
            self.save_json_for_FX_icon()

    def save_json_for_FX_icon(self):
        with open("GameSaves/weather_FX_by_name.json", "w", encoding='utf-8') as file:
            json.dump(self.weather_FX_items, file, indent=4, ensure_ascii=False)

    def display_weather_FX(self, text):
        self.Weather_FX_setting(notjustload=False)
        self.NowWeather = []
        env_text = text
        # self.chat_log.insert(tk.END,
        # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text}\n\n')
        time_info = env_text.split("【时间】")[1].strip()
        date = time_info.split("【日期】")[1].split(" ")[0].strip()
        time = time_info.split("【地点】")[0].strip()
        time_info = time_info.split("【地点】")[1].strip()
        place = time_info.split("【天气】")[0].strip()
        time_info = time_info.split("【天气】")[1].strip()
        weather = time_info.split("【日期】")[0].strip()
        if date[0] in self.weather_FX_items["日期"]:#春✿ 夏♨ 秋♣ 冬♦
            self.on_display_weather_FX(self.weather_FX_items["日期"][date[0]], "日期："+date)
            self.NowWeather.append("日期#"+date[0])
        else:
            self.weather_FX_items["日期"][date]= ""
        if "㏂" in time and "昼☀" in time: #㏂昼☀ ㏂夜◐ ㏘昼☀ ㏘夜◐
            time_ = "㏂昼☀"
        elif "㏂" in time and "夜◐" in time:
            time_ = "㏂夜◐"
        elif "㏘" in time and "昼☀" in time:
            time_ = "㏘昼☀"
        elif "㏘" in time and "夜◐" in time:
            time_ = "㏘夜◐"
        else:
            time_ = "???"
        if time_ in self.weather_FX_items["时间"]:
            self.on_display_weather_FX(self.weather_FX_items["时间"][time_], "时间："+time)
            self.NowWeather.append("时间#"+time_)
        else:
            self.weather_FX_items["时间"][time]= ""
        if place in self.weather_FX_items["地点"]:
            self.on_display_weather_FX(self.weather_FX_items["地点"][place], "地点："+place)
            self.NowWeather.append("地点#"+place)
        else:
            self.weather_FX_items["地点"][place]= ""
        if weather in self.weather_FX_items["天气"]:
            self.on_display_weather_FX(self.weather_FX_items["天气"][weather], "天气："+weather)
            self.NowWeather.append("天气#"+weather)
        else:
            self.weather_FX_items["天气"][weather]= ""

    def on_display_weather_FX(self, file_path, text):
        # 如果是PNG，多个图片叠加在一起
        if file_path:
            row_index = 0
            col_index = 0
            if "天气" in text:
                row_index = 0
                col_index = 0
            elif "地点" in text:
                row_index = 2
                col_index = 0
            elif "日期" in text:
                row_index = 0
                col_index = 2
            elif "时间" in text:
                row_index = 2
                col_index = 2
            if self.new_window_weather_FX == None:
                self.new_window_weather_FX = tk.Toplevel(root)
            self.new_window_weather_FX.title("世界环境")
            # label = tk.Label(new_window_weather_FX, text=text)
            # label.pack()
            image_references = []  # Add this list attribute to store references to images
            # 创建 Canvas 组件
            image = Image.open(file_path)
            # 获取图像的宽和高
            width, height = image.size
            canvas_w = int(width / 3)
            canvas_h = int(height / 3)
            FX_title = tk.Label(self.new_window_weather_FX, text=text, relief=tk.FLAT)
            FX_title.grid(row=row_index, column=col_index, padx=0, pady=0, sticky="nsew")
            self.canvas_weather_FX = tk.Canvas(self.new_window_weather_FX, width=canvas_w, height=canvas_h, bg="white")
            self.canvas_weather_FX.grid(row=row_index+1, column=col_index, padx=0, pady=0,sticky="nsew")
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                self.canvas_animate_weather_FX = tk.Canvas(self.new_window_weather_FX, width=width, height=height)
                self.canvas_animate_weather_FX.grid(row=row_index+1, column=col_index, padx=0, pady=0,sticky="nsew")
                self.frames_weather_FX = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                  ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_weather_FX = self.canvas_animate_weather_FX.create_image(0, 0, anchor=tk.NW, image=self.frames_weather_FX[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_weather_FX, self.current_frame_weather_FX, self.frames_weather_FX)
            else:
                image = image.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
                tk_image = ImageTk.PhotoImage(image)
                self.canvas_weather_FX.create_image(canvas_w / 2, canvas_h / 2, image=tk_image, tags="image")
                self.canvas_weather_FX.image = tk_image
                # 监听窗口大小变化事件
                # canvas_weather_FX.bind("<Configure>", lambda event: self.resize_image(canvas_weather_FX, tk_image))
            self.new_window_weather_FX.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_image_FX())

    def display_image(self, file_path, text, name=None, seconds=-1):
        if file_path:
            new_window_HO = tk.Toplevel(root)
            new_window_HO.title("图片展示：" + text)
            # label = tk.Label(new_window_HO, text=text)
            # label.pack()
            image_references = []  # Add this list attribute to store references to images
            # 创建 Canvas 组件
            image = Image.open(file_path)
            # 获取图像的宽和高
            width, height = image.size
            canvas_w = int(width / 3)
            canvas_h = int(height / 3)
            canvas_HO = tk.Canvas(new_window_HO, width=canvas_w, height=canvas_h, bg="white")
            canvas_HO.pack(fill=tk.BOTH, expand=True)
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                self.canvas_animate_HO = tk.Canvas(new_window_HO, width=width, height=height)
                self.canvas_animate_HO.pack(fill=tk.BOTH, expand=True)
                self.frames_HO = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                  ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_HO = self.canvas_animate_HO.create_image(0, 0, anchor=tk.NW, image=self.frames_HO[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_HO, self.current_frame_HO, self.frames_HO)
            else:
                image = image.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
                tk_image = ImageTk.PhotoImage(image)
                canvas_HO.create_image(canvas_w / 2, canvas_h / 2, image=tk_image, tags="image")
                canvas_HO.image = tk_image
                # 监听窗口大小变化事件
                # canvas_HO.bind("<Configure>", lambda event: self.resize_image(canvas_HO, tk_image))
            new_window_HO.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_image(new_window_HO, text, name))

    def display_FX(self, file_path, text):
        if file_path:
            new_window_FX = tk.Toplevel(root)
            new_window_FX.title("FX展示：" + text)
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                self.canvas_animate_FX = tk.Canvas(new_window_FX, width=width, height=height)
                self.canvas_animate_FX.pack(fill=tk.BOTH, expand=True)
                self.frames_FX = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                  ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_FX = self.canvas_animate_FX.create_image(0, 0, anchor=tk.NW, image=self.frames_FX[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_FX, self.current_frame_FX, self.frames_FX)
            else:
                # 创建 Canvas 组件
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                canvas_w = int(width / 3)
                canvas_h = int(height / 3)
                canvas_FX = tk.Canvas(new_window_FX, width=canvas_w, height=canvas_h, bg="white")
                canvas_FX.pack(fill=tk.BOTH, expand=True)
                image = image.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
                tk_image = ImageTk.PhotoImage(image)
                canvas_FX.create_image(canvas_w / 2, canvas_h / 2, image=tk_image, tags="image")
                canvas_FX.image = tk_image
            new_window_FX.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_image(new_window_FX, "FX", text))

    def resize_image(self, canvas, tk_image):
        canvas.delete("image")  # 删除之前的图片
        width = canvas.winfo_width()  # 获取Canvas的新宽度
        height = canvas.winfo_height()  # 获取Canvas的新高度
        resized_image = tk_image.subsample(int(tk_image.width() / width), int(tk_image.height() / height))  # 缩放图片
        canvas.create_image(0, 0, anchor=tk.NW, image=resized_image, tags="image")  # 在Canvas上绘制调整后的图片
        canvas.image = resized_image  # 更新图片引用

    def on_kill_image_FX(self):
        #self.canvas_weather_FX.destroy()
        #if self.canvas_animate_weather_FX:
            #self.canvas_animate_weather_FX.destroy()
        self.new_window_weather_FX.destroy()
        self.new_window_weather_FX = None

    def on_kill_image(self, window, type, name):
        if type == "FX":
            if name in self.NowEffect:
                self.NowEffect.remove(name)
                content = f"【高级特效】结束{name}"
                self.search_and_delete_insert_symbol()
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【等待】0.2\n\n')
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
                # self.chat_log_huozi = self.chat_log_huozi + f"{content}\n\n"
                self.chat_log.yview(tk.END)
        elif type == "HandOut":
            if name in self.NowImage:
                self.NowImage.remove(name)
                content = f"【撤除图片】{name}"

                self.search_and_delete_insert_symbol()
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【等待】1\n\n')
                self.chat_log.insert(tk.END,
                                     f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
                # self.chat_log_huozi = self.chat_log_huozi + f"{content}\n\n"
                self.chat_log.yview(tk.END)
        window.destroy()

    def refreshTime(self, event):
        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>{log}\n"
        self.save_settings()

    def create_role_frames(self):
        num_cols = 3
        for idx, role in enumerate(self.roles):
            row = idx % num_cols
            col = idx // num_cols
            self.create_role_frame(role, row, col)

        # 自动调整列宽
        for i in range(num_cols + 2):
            self.root.columnconfigure(i, weight=1)

    def create_role_frame(self, role, row, col):

        if role not in role_Chart:
            role_Chart[role] = role_Chart_detail_demo.copy()

        frame = tk.LabelFrame(self.root, text=role, relief=tk.GROOVE)
        frame.grid(row=row, column=col + 2, padx=10, pady=10, sticky="nsew")
        self.role_entries_frame[role] = frame
        # 初始化头像路径
        self.role_avatar_paths = {}
        self.last_SAN[role] = 0
        if load_settings_avatar() != "":
            self.role_avatar_paths = load_settings_avatar()  # 从文件加载设置
        # 头像点击事件
        # self.avatar_click_event = None

        # 每个角色的消息框
        entry = tk.Text(frame, wrap=tk.WORD, width=30, height=3, undo=True)
        entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")
        entry.bind("<Button-3>", lambda event, r=role: self.add_menu(event, r))
        self.role_entries[role] = entry
        # 加载并显示头像
        self.load_and_display_avatar(role, frame)
        self.load_and_display_icon(role, frame)

        if role == "DiceBot":
            # 在 Text 组件中插入初始文本
            initial_text = "复制Bot消息至此并发送，或：\n【掷骰】点击每个角色的掷骰按钮进行掷骰，公式栏填写公式或技能，留空默认1d100" \
                           "\n【优劣势】命令头部的+/-表示优劣势（++意志30）" \
                           "\n【补正骰】命令后部的+/-表示补正（意志+30）" \
                           "\n【联合骰】技能1+技能2+技能3..." \
                           "\n【对抗骰】在角色消息栏@其他对抗人 并点击掷骰" \
                           "\n【全体掷骰】保持焦点在Bot消息框，点击Bot的掷骰按钮" \
                           "\n【多轮掷骰】命令头部的*表示轮数（3*意志）" \
                           "\n【暗骰】保持焦点在暗骰角色的消息框，点击Bot的掷骰按钮（公式取自暗骰角色，是否显示技能名取决于Bot公式栏）" \
                           "\n【掷骰原因】消息栏填写掷骰原因，可以包括技能文字点掷骰按钮来触发检定（例如“我使用r斗殴击晕敌人”）" \
                           "\n【HP/MP+-】在公式栏填写（例如“HP+1d3”）" \
                           "\n【.st draw who[+理由] whoabcd[+理由] yesno[+理由]】输入后点击发送按钮或回车（而不是掷骰按钮）" \
                           "\n===以上可删除===\n\n"
            self.role_entries[role].insert(tk.END, initial_text)
        if role == "KP":
            initial_text = "如何创建NPC模板：" \
                           "\n0.如果巴别塔报错，先关闭巴别塔（把文件名改一下就行）" \
                           "\n1.创建新角色，更名为模板名（比如“基本怪物”、“基本人类”、“基本邪教徒”、“Muffin Stinger”（姓名也可以在创建 / 导入模板后再改））" \
                           "\n2. 。st录入数值" \
                           "\n3.重启程序（关闭程序时会自动保存）" \
                           "\n4.在KP栏把自己的名字改成模板名，会自动录入数值(即时数值例如HP、MP变化不会录入)。如果不想更改KP，新建一个NPC栏来用也行，最好不用骰子栏，会出奇怪BUG" \
                           "。或者多开程序也行，但注意一定要分开保存程序数据文件，被覆盖就会哭哭。" \
                           "\n5.如果要重新启用巴别塔，删除新创建的角色，改回第0步的文件名（除非把新添加的角色也加入巴别塔）" \
                           "\n===以上可删除===\n\n"
            self.role_entries[role].insert(tk.END, initial_text)

            # 创建数值tag，显示数值
        role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
        SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        POW = role_Chart_detail.get("POW")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        DB = role_Chart_detail.get("DB")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
        if "#SAN" in role_Chart_detail:
            _SAN = role_Chart_detail.get("#SAN")
        else:
            _SAN = 100
        entry2 = tk.Text(frame, wrap=tk.WORD, width=10, height=6, undo=True)
        entry2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
        entry2.bind("<Button-3>", lambda event, r="statuslog" + role: self.add_menu(event, r))
        # entry2.bind("<Button-1>", lambda event, r="statuslog" + role: self.add_menu(event, r))
        value_tag = f"{role}_values_tag"
        self.role_values_tags[role] = value_tag
        entry2.tag_config(value_tag, justify=tk.LEFT)
        self.role_values_tags_text = load_PL_INFO()
        if role not in self.role_values_tags_text:
            entry2.insert(tk.END, f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB',
                          value_tag)
        else:
            entry2.insert(tk.END, self.role_values_tags_text[role], value_tag)
        if f"===状态===" not in entry2.get("1.0", tk.END).strip():
            entry2.insert(tk.END, f"\n===状态===\n无(永久)\n")
        if role in self.role_entries_name:
            if self.role_entries_name[role] in self.role_items:
                for key, value in self.role_items[self.role_entries_name[role]].items():
                    if value != "":
                        for value_ in value:
                            if value_ != "":
                                if f"==={key}===" not in entry2.get("1.0", tk.END).strip():
                                    entry2.insert(tk.END, f"\n==={key}===\n" + "\n".join(value),
                                                  value_tag)
            else:
                self.role_items[self.role_entries_name[role]] = {"物品": [], "备注": [], "其他": []}
        # 为每个文本框绑定焦点变化事件
        entry2.bind("<FocusOut>", lambda event, r=role, t=entry2: self.save_info(event, r))
        entry2.bind("<FocusIn>", lambda event, r=role: self.update_health_bar(r))
        self.role_values_entry[role] = entry2
        if HP == "(CON+SIZ)/10":
            HP = "0"
        if MP == "POW/5":
            MP = "0"
        if SAN == "POW":
            SAN = "0"
        if self.role_values_entry[role].get("1.0", "2.0").split("/")[0] != "POW" and \
                self.role_values_entry[role].get("2.0", "3.0").split("/")[0] != "(CON+SIZ)/10" and \
                self.role_values_entry[role].get("3.0", "4.0").split("/")[0] != "POW/5":
            __SAN = int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0])
            _HP = int(self.role_values_entry[role].get("2.0", "3.0").split("/")[0])
            _MP = int(self.role_values_entry[role].get("3.0", "4.0").split("/")[0])
            # 状态条（hp血量）→san
            statusbar_health = tk.Label(frame, text=self.draw_health_bar(__SAN, int(_SAN), bar_length=18), relief=tk.FLAT)
            statusbar_health.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
            statusbar_health.bind("<Button-1>", lambda event, r=role: self.hide_health_bar(r))
            statusbar_health.bind("<Enter>", lambda event, r=role: self.update_health_bar(r))
            self.role_statusbar_health[role] = statusbar_health
            # 状态条（状态图标）
            statusbar_icon = tk.Label(frame, image="", relief=tk.FLAT)
            statusbar_icon.grid(row=3, column=2, padx=0, pady=0, sticky="nsew")
            statusbar_icon.bind("<Button-1>", lambda event: self.update_status_icon(event))
            statusbar_icon.bind("<Enter>", lambda event, r=role: self.draw_status_icon_canvas(event, r))
            statusbar_icon.bind("<Leave>", lambda event, r=role: self.destroy_status_icon_canvas(r))
            self.role_statusbar_icon[role] = statusbar_icon
            self.ani_frame_icon[role] = frame
            # 状态条（mp+san量）→mp+hp  _HP, int(HP)
            statusbar_mp = tk.Label(frame, text="HP " + self.draw_health_bar(_HP, int(HP), bar_length=5, show_text=False) + "\nMP " + self.draw_health_bar(
                _MP, int(MP), bar_length=5, show_text=False), relief=tk.FLAT, font=("Times New Roman", 7))
            statusbar_mp.grid(row=3, column=0, padx=0, pady=0, sticky="nsew")
            statusbar_mp.bind("<Button-1>", lambda event, r=role: self.hide_health_bar(r))
            statusbar_mp.bind("<Enter>", lambda event, r=role: self.update_health_bar(r))
            self.role_sstatusbar_mp[role] = statusbar_mp

        send_button = tk.Button(frame, text="发送", command=lambda role=role: self.send_message(role))
        send_button.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        label = tk.Label(frame, text=role, relief=tk.FLAT,
                         font=("Times New Roman", 16, "bold"))  # flat, groove, raised, ridge, solid, or sunken
        label.grid(row=0, column=1, pady=0, sticky="nsew")
        label.bind("<Button-1>", lambda event, role=role, label=label: self.edit_role_name(event, role, label))
        label.bind("<Button-3>", lambda event, role=role: self.on_avatar_click(role))
        label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
        label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

        if self.role_entries_name[role] != role:
            label.configure(text=self.role_entries_name[role])
            # print(self.role_entries_name[role])

        label = tk.Label(frame, text="@", relief=tk.FLAT)
        label.grid(row=2, column=0, pady=0, sticky="nsew")
        # label点击事件绑定
        label.bind("<Button-1>", lambda event, role=role: self.on_at_click(role))
        label.bind("<Button-3>", lambda event, role=role: self.on_at_right_click(role))

        # 添加选择头像按钮
        # choose_avatar_button = tk.Button(frame, text="选择简卡", command=lambda role=role: self.on_avatar_click(role))
        # choose_avatar_button.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        # 添加保存名牌按钮
        # choose_avatar_button = tk.Button(frame, text="保存", command=lambda role=role: self.choose_avatar(role))
        # choose_avatar_button.grid(row=2, column=3, padx=5, pady=5, sticky="nsew")

        # 添加掷骰按钮和面数输入框
        entry_roll = tk.Text(frame, wrap=tk.WORD, width=3, height=1, undo=True)
        entry_roll.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")
        entry_roll.bind("<Button-3>", lambda event, r=role: self.add_menu_skills(event, role))
        self.role_entries_roll[role] = entry_roll
        roll_button = tk.Button(frame, text="掷骰", command=lambda r=role: self.get_and_roll(r))
        roll_button.grid(row=2, column=2, padx=5, pady=5)
        self.role_roll_button[role] = roll_button
        # 在 Text 组件中插入初始文本
        initial_text = "1d100"
        self.role_entries_roll[role].insert(tk.END, initial_text)

    def hide_health_bar(self, role):
        global is_hiding_health_bar
        if is_hiding_health_bar:
            self.role_statusbar_health[role].config(font=None)
            # self.role_statusbar_icon[role].config(font=None)
            self.role_sstatusbar_mp[role].config(font=None)
            is_hiding_health_bar = False
        else:
            # self.role_statusbar_health[role].config(font=("Times New Roman", 1))
            # self.role_statusbar_icon[role].config(font=("Times New Roman", 1))
            self.role_sstatusbar_mp[role].config(font=("Times New Roman", 1))
            is_hiding_health_bar = True

    def apng_to_gif(self, apng_file, gif_file):
        # 使用 apng2gif 工具将 APNG 转换成 GIF
        subprocess.run(["apng2gif", apng_file, gif_file])
        return gif_file

    def save_info(self, event, role):
        self.update_health_bar(role)
        self.role_values_tags_text[role] = self.role_values_entry[role].get("1.0", tk.END).strip()
        # print(self.role_values_entry[role].get("1.0", tk.END).strip())

    def show_menu(self, event, menu):
        menu.post(event.x_root, event.y_root)

    def insert_text_to_Bot(self, text, send=None):
        self.role_entries["DiceBot"].insert("1.0", text)
        if send:
            self.send_message("DiceBot")
            if self.role_entries["DiceBot"].get("1.0", tk.END).strip() == text:
                self.role_entries["DiceBot"].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries["DiceBot"].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries["DiceBot"].delete("1.0", tk.END)
                self.role_entries["DiceBot"].insert("1.0", temp_)
        else:
            pass

    def insert_text_to_PC(self, text, role, send=None):
        self.role_entries[role].insert("1.0", text)
        if send:
            self.send_message(role)
            if self.role_entries[role].get("1.0", tk.END).strip() == text:
                self.role_entries[role].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries[role].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", temp_)
        else:
            pass

    def insert_roll_to_PC(self, text, role, send=False):
        self.role_entries_roll[role].delete("1.0", tk.END)
        self.role_entries_roll[role].insert("1.0", text)
        if send and self.role_entries_roll[role].get("1.0", tk.END).strip() != "":
            if "NPC_name" not in role:
                self.role_entries[role].delete("1.0", tk.END)
            self.get_and_roll(role)
            if self.role_entries_roll[role].get("1.0", tk.END).strip() == text:
                self.role_entries_roll[role].delete("1.0", tk.END)
            else:
                temp_ = self.role_entries_roll[role].get("1.0", tk.END).strip().replace(text, "")
                self.role_entries_roll[role].delete("1.0", tk.END)
                self.role_entries_roll[role].insert("1.0", temp_)
        else:
            pass

    def clearAll(self, role):
        if role == "chatlog":
            self.chat_log.delete("1.0", tk.END)
        else:
            self.role_entries[role].delete("1.0", tk.END)

    def list_carddecks(self, event, role, command=None, chooseSelf=True):
        #是否个人牌堆
        menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的[{command}]牌堆列表")
        if chooseSelf:
            isSelf = simpledialog.askstring("个人牌堆？", "是否为个人牌堆（y/n）:", initialvalue="n")
            if isSelf == "y":
                command = command.replace("draw", "drawself")
        files = os.listdir("CardDecks")
        # 输出文件名
        if not command:
            command = ""
        if "*" in command:
            for file in files:
                if role == "Dicebot":
                    menu.add_command(label=os.path.splitext(file)[0], command=lambda
                        text=command.replace("*", "") + " " + os.path.splitext(file)[0] + "*": self.insert_text_to_Bot(text))
                else:
                    menu.add_command(label=os.path.splitext(file)[0],
                                     command=lambda
                                         text=command.replace("*", "") + " " + os.path.splitext(file)[0] + "*",
                                         role=role: self.insert_text_to_PC(text, role))
        else:
            for file in files:
                if role == "Dicebot":
                    menu.add_command(label=os.path.splitext(file)[0], command=lambda
                        text=command + " " + os.path.splitext(file)[0]: self.insert_text_to_Bot(text, send=True))
                else:
                    menu.add_command(label=os.path.splitext(file)[0],
                                     command=lambda text=command + " " + os.path.splitext(file)[0],
                                                    role=role: self.insert_text_to_PC(text, role, send=True))
        self.show_menu(event, menu)

    def add_new_items(self, role):
        self.new_window_for_new_items = tk.Toplevel(root, takefocus=True)
        if "NPC_name" in role:
            self.new_window_for_new_items.title(f"为[NPC]{role.split('NPC_name')[1]}增加新物品（或其他）")
            if role.split("NPC_name")[1] not in self.role_items:
                if role.split("NPC_name")[0] in self.role_items:
                    self.role_items[role.split("NPC_name")[1]] = self.role_items[role.split("NPC_name")[0]]
                else:
                    self.role_items[role.split("NPC_name")[1]] = {"物品": [], "备注": [], "其他": []}
            _dict = self.role_items[role.split("NPC_name")[1]]
        else:
            self.new_window_for_new_items.title(f"为[{role}]{self.role_entries_name[role]}增加新物品（或其他）")
            _dict = self.role_items[self.role_entries_name[role]]

        # Create widgets
        self.new_items_frame = tk.Frame(self.new_window_for_new_items)
        self.new_items_frame.pack()

        self.type_new_items_label = tk.Label(self.new_items_frame, text="列表种类:")
        self.type_new_items_label.grid(row=0, column=0)

        self.type_new_items_var = tk.StringVar()
        type_list = []
        for type, content in _dict.items():
            type_list.append(type)
        type_list.append("[新列表种类...]")
        self.type_new_items_entry = ttk.Combobox(self.new_items_frame, textvariable=self.type_new_items_var, values=type_list)
        self.type_new_items_entry.bind("<<ComboboxSelected>>", lambda event, r=role: self.edit_entry_for_new_items(r))
        self.type_new_items_entry.grid(row=0, column=1, columnspan=2)

        self.list_new_items_label = tk.Label(self.new_items_frame, text="列表内容:")
        self.list_new_items_label.grid(row=1, column=0)

        self.list_new_items_text = tk.Text(self.new_items_frame, height=4, width=30, undo=True)
        self.list_new_items_text.grid(row=2, column=0, columnspan=3)

        self.add_new_items_button = tk.Button(self.new_items_frame, text="新列表...", command= lambda r=role: self.add_entry_for_new_items(role))
        self.add_new_items_button.grid(row=3, column=0)

        self.edit_new_items_button = tk.Button(self.new_items_frame, text="修正旧列表?", command= lambda r=role: self.edit_entry_for_new_items(role))
        self.edit_new_items_button.grid(row=3, column=1)

        self.save_new_items_button = tk.Button(self.new_items_frame, text="保存", command= lambda r=role: self.save_json_for_new_items(role))
        self.save_new_items_button.grid(row=3, column=2)

    def add_entry_for_new_items(self, role):
        if self.type_new_items_entry.get() != "":
            self.save_json_for_new_items(role)
            self.type_new_items_entry.delete(0, tk.END)
            self.list_new_items_text.delete("1.0", tk.END)

    def edit_entry_for_new_items(self, role):
        if self.type_new_items_var.get() != "":
            self.list_new_items_text.delete("1.0", tk.END)
            if "NPC_name" in role:
                if role.split("NPC_name")[1] not in self.role_items:
                    self.role_items[role.split("NPC_name")[1]] = {"物品": [], "备注": [], "其他": []}
                    if self.type_new_items_var.get() in self.role_items[role.split("NPC_name")[0]]:
                        self.list_new_items_text.insert(tk.END,
                                                    "\n".join(self.role_items[role.split("NPC_name")[0]][self.type_new_items_var.get()]))
                elif self.type_new_items_var.get() in self.role_items[role.split("NPC_name")[1]]:
                    self.list_new_items_text.insert(tk.END, "\n".join(self.role_items[role.split("NPC_name")[1]][self.type_new_items_var.get()]))
                else:
                    self.list_new_items_text.insert(tk.END, "未查找到此条目！")
            else:
                if self.type_new_items_var.get() in self.role_items[self.role_entries_name[role]]:
                    self.list_new_items_text.insert(tk.END, "\n".join(self.role_items[self.role_entries_name[role]][self.type_new_items_var.get()]))
                else:
                    self.list_new_items_text.insert(tk.END, "未查找到此条目！")

    def save_json_for_new_items(self, role):
        if self.type_new_items_entry.get() != "":
            content = self.list_new_items_text.get("1.0", tk.END).split("\n")
            _type = self.type_new_items_entry.get()
            if "NPC_name" in role:
                if role.split("NPC_name")[1] not in self.role_items:
                    self.role_items[role.split("NPC_name")[1]] = {"物品": [], "备注": [], "其他": []}
                self.role_items[role.split("NPC_name")[1]][_type] = []
                for _content in content:
                    if _content.strip() != "":
                        self.role_items[role.split("NPC_name")[1]][_type].append(_content.strip())
            else:
                self.role_items[self.role_entries_name[role]][_type] = []
                for _content in content:
                    if _content.strip() != "":
                        self.role_items[self.role_entries_name[role]][_type].append(_content)

            type_list = []
            if "NPC_name" in role:
                if role.split("NPC_name")[1] not in self.role_items:
                    if role.split("NPC_name")[0] in self.role_items:
                        self.role_items[role.split("NPC_name")[1]] = self.role_items[role.split("NPC_name")[0]]
                    else:
                        self.role_items[role.split("NPC_name")[1]] = {"物品": [], "备注": [], "其他": []}
                _dict = self.role_items[role.split("NPC_name")[1]]
            else:
                _dict = self.role_items[self.role_entries_name[role]]
            for t, c in _dict.items():
                type_list.append(t)
            type_list.append("[新列表种类...]")
            self.type_new_items_entry.config(value=type_list)
            #在self.role_values_entry[role]里添加更新
            for t2 in type_list:
                if t2 == "[新列表种类...]":
                    pass
                else:
                    current_text = self.role_values_entry[role].get("1.0", tk.END).split("\n")
                    if f"==={t2}===" not in current_text:
                        self.role_values_entry[role].insert(tk.END, f"\n==={t2}===\n" + '\n'.join(_dict[t2]))
                    else:
                        for index, line in enumerate(current_text):
                            if line == f"==={t2}===":
                                insert_index = index + 2
                                _current_text = self.role_values_entry[role].get(f"{insert_index}.0", tk.END).split("===")[0].split("\n")
                                for itm in _dict[t2]:
                                    if itm not in _current_text:
                                        self.role_values_entry[role].insert(f"{insert_index}.0", f"{itm}\n")
                                break

            file_path = "GameSaves/item_settings_by_name.json"
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(self.role_items, file, indent=4, ensure_ascii=False)

    def generate_garbled_text(self, input_str, chaos_level=1.0):
        """
        根据输入字符串生成独一无二的乱码，可以调整混乱度。

        参数:
        input_str (str): 输入的字符串
        chaos_level (float): 混乱度，范围从 0.0 到 1.0

        返回:
        str: 生成的乱码字符串
        """
        # 将输入字符串转换为列表以便操作
        str_list = list(input_str)

        # 随机打乱字符顺序
        random.shuffle(str_list)
        # 根据混乱度替换一些字符
        num_replacements = int(len(str_list) * chaos_level)
        for _ in range(num_replacements):
            index = random.randint(0, len(str_list) - 1)
            random_char = chr(random.randint(33, 126))  # 生成随机字符 (ASCII 范围内的可见字符)
            str_list[index] = random_char

        # 如果字符数少于一定数量（例如 5），增加额外的随机字符
        min_length = 5
        while len(str_list) < min_length:
            str_list.append(chr(random.randint(33, 126)))  # 生成并添加随机字符

        # 将列表转换回字符串并返回
        return ''.join(str_list)

    def whisper_system(self, role, whisper=True):
        global role_Chart
        content = self.role_entries[role].get("1.0", tk.END).strip()
        for whispered_roles, whispered_content in self.whisper_data.items():
            for receive_roles, receive_content in whispered_content.items():
                for receive_roles_, receive_content_ in receive_content.items():
                    if receive_roles_ == content and (whispered_roles == self.role_entries_name[role] or receive_roles == self.role_entries_name[role]):
                        self.role_entries[role].delete("1.0", tk.END)
                        self.role_entries[role].insert("1.0", f"{whispered_roles}曾悄悄对{receive_roles}说...\n" + receive_content_)
                        return True
        if whisper:
            if "@" in content:
                init_name = content.split("@")[1].split(" ")[0]
                content = content.replace(f"@{init_name} ", "")
            else:
                init_name = f"{self.role_entries_name[role]}"
            whisper_name = simpledialog.askstring("小窗", "Whisper to（仅1人）:", initialvalue=init_name)
            garbled_text = self.generate_garbled_text(content)
            if role in self.role_entries_name:
                if self.role_entries_name[role] not in self.whisper_data:
                    self.whisper_data[self.role_entries_name[role]] = {whisper_name:{garbled_text:content}}
                else:
                    self.whisper_data[self.role_entries_name[role]][whisper_name][garbled_text] = content
            else:
                if role not in self.whisper_data:
                    self.whisper_data[role] = {whisper_name:{garbled_text:content}}
                self.whisper_data[role][whisper_name][garbled_text] = content
            for roles in self.roles:
                if roles != role and self.role_entries_name[roles] != whisper_name and roles != "DiceBot":
                    listen = role_Chart[roles].get("聆听")
                    garbled_text2 = self.generate_garbled_text(content, chaos_level=round((1 - listen/20), 1))
                    self.role_entries[roles].insert(tk.END, f"【{self.role_entries_name[role]}】和【{whisper_name}】在说悄悄话，你偷听到了...\n{garbled_text2}")
                elif self.role_entries_name[roles] == whisper_name:
                    self.role_entries[roles].insert(tk.END, f"【{self.role_entries_name[role]}】在对你说悄悄话...\n{content}")
                else:
                    pass
            self.search_and_delete_insert_symbol()
            self.chat_log.insert(tk.END,
                                 f'{self.role_entries_name[role]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n[悄悄话]{self.role_entries_name[role]} → {whisper_name}\n【{self.role_entries_name[role]}】和【{whisper_name}】在{random.choice(["说悄悄话", "互传纸条", "密谋着什么", "低语", "低声耳语"])}...{garbled_text}\n\n')
            self.chat_log.yview(tk.END)

    def voting_system(self, role):
        if len(self.votes) == 0:
            self.vote_theme = simpledialog.askstring("投票", "投票主题:", initialvalue=f"{self.role_entries_name[role]}发起")
            self.search_and_delete_insert_symbol()
            if self.vote_theme is None:
                return
            self.haveName = simpledialog.askstring("记名？", "是否记名（是/否）:", initialvalue=f"是")
            if self.haveName == "是":
                haveName_ = ""
            else:
                haveName_ = "不"
            self.chat_log.insert(tk.END,
                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】开始了{self.vote_theme}的{haveName_}记名投票！\n\n')
            self.chat_log.yview(tk.END)
        count = 0
        if self.role_entries[role].get("1.0", "2.0").strip() == "" and len(self.votes) != 0:
            self.role_entries[role].insert("1.0", "弃权")
        elif self.role_entries[role].get("1.0", "2.0").strip() == "" and len(self.votes) == 0:
            self.role_entries[role].insert("1.0", "弃权")
            self.role_entries[role].insert("2.0", "\n(发起者请提前写出内容再发起投票，否则记为弃权。再次投票可修改。)")
        #print(self.role_entries[role].get("1.0", "2.0").strip())
        self.search_and_delete_insert_symbol()
        self.votes[role] = self.role_entries[role].get("1.0", "2.0").strip()
        self.chat_log.insert(tk.END,
                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】已完成{self.vote_theme}的投票！\n\n')
        self.chat_log.yview(tk.END)
        for r in self.roles:
            if r in self.votes and self.votes[r] != "":
                count += 1
        if count >= len(self.roles) - 1:
            vote_result = {}
            for role, vote in self.votes.items():
                if vote not in vote_result:
                    vote_result[vote] = [self.role_entries_name[role]]
                else:
                    vote_result[vote].append(self.role_entries_name[role])
            content_ = {}
            for con ,list in vote_result.items():
                if self.haveName == "是":
                    content_[f"{con}：{len(list)}票（{'，'.join(list)}）"] = len(list)
                else:
                    content_[f"{con}：{len(list)}票"] = len(list)
            # 按值从大到小排序字典
            sorted_dict_items = sorted(content_.items(), key=lambda item: item[1], reverse=True)
            # 将排序后的键值对重新放入字典
            sorted_dict = dict(sorted_dict_items)
            sorted_dict_list = []
            for key, value in sorted_dict.items():
                sorted_dict_list.append(key)
            content = "\n".join(sorted_dict_list)
            self.search_and_delete_insert_symbol()
            self.chat_log.insert(tk.END, f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{self.vote_theme}的投票表决结果：\n{content}\n\n')
            self.chat_log.yview(tk.END)
            self.votes.clear()


    def add_menu(self, event, role):
        menu = tk.Menu(root, tearoff=0)
        menu.delete(0, tk.END)  # 清空菜单
        if "statuslog" in role:
            role = role.replace("statuslog", "")
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                menu = tk.Menu(root, tearoff=1, title=f"NPC【{name_}】的物品列表")
                menu.delete(0, tk.END)  # 清空菜单
                textlist = self.role_values_entry[role].get("6.0", tk.END).split("\n")
                for t in textlist:
                    t = t.strip()
                    menu.add_command(label=t, command=lambda text=t, role=role: self.insert_text_to_PC(text, role))
                menu.add_command(label="新的...", command=lambda role=role: self.add_new_items(role))
            else:
                menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的物品列表)")
                menu.delete(0, tk.END)  # 清空菜单
                textlist = self.role_values_entry[role].get("6.0", tk.END).split("\n")
                for t in textlist:
                    t = t.strip()
                    menu.add_command(label=t, command=lambda text=t, role=role: self.insert_text_to_PC(text, role))
                menu.add_command(label="新的...", command=lambda role=role: self.add_new_items(role))
        elif role == "timelog":

            menu.add_command(label="游戏结束(重置SAN损失计算)",
                             command=lambda: self.reset_san_cal_status("all"))
            menu.add_command(label="暂存当前(开始分流)",
                             command=lambda: self.save_current_time())
            menu.add_command(label="恢复先前(开始下一流)",
                             command=lambda: self.reverse_current_time())
            menu.add_command(label="收敛时间(结束流, 收敛至汇合点)",
                             command=lambda: self.unify_times(auto=True))
            menu.add_command(label="快进1秒钟",
                             command=lambda timer="time_1s": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进3秒钟",
                             command=lambda timer="time_3s": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进1分钟",
                             command=lambda timer="time_1min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                            auto=False))
            menu.add_command(label="快进5分钟",
                             command=lambda timer="time_5min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                            auto=False))
            menu.add_command(label="快进10分钟",
                             command=lambda timer="time_10min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                             auto=False))
            menu.add_command(label="快进30分钟",
                             command=lambda timer="time_30min": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                             auto=False))
            menu.add_command(label="快进1小时",
                             command=lambda timer="time_1h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进3小时",
                             command=lambda timer="time_3h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进12小时",
                             command=lambda timer="time_12h": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                           auto=False))
            menu.add_command(label="快进1天",
                             command=lambda timer="time_1d": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="快进7天",
                             command=lambda timer="time_1w": TRPGModule.move_time_forward(self.trpg_module, timer,
                                                                                          auto=False))
            menu.add_command(label="天气FX引用设置...",
                             command=lambda: self.Weather_FX_setting())

        elif role == "DiceBot":
            menu.add_command(label="活字命令", command=lambda text="text": self.insert_text_to_Bot(text))
            menu.add_command(label="全体【明】抽牌堆",
                             command=lambda text=".alldraw", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【明】抽牌堆(不放回)",
                             command=lambda text=".alldraw?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【明】抽牌堆(多次)",
                             command=lambda text=".alldraw*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【明】抽牌堆(多次，不放回)",
                             command=lambda text=".alldraw?*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【暗】抽牌堆",
                             command=lambda text=".alldraw_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【暗】抽牌堆(不放回)",
                             command=lambda text=".alldraw_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【暗】抽牌堆(多次)",
                             command=lambda text=".alldraw_*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="全体【暗】抽牌堆(多次，不放回)",
                             command=lambda text=".alldraw_?*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="抽取幸运儿",
                             command=lambda text=".who", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="抽取幸运顺序",
                             command=lambda text=".whoabcd", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="全体今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
        elif role == "chatlog":
            menu.add_command(label="快速保存", command=lambda: self.quickSave())
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
            menu.add_command(label="活字命令", command=lambda role=role: self.on_at_right_click(role))
            menu.add_command(label="抽取幸运儿",
                             command=lambda text=".who", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="抽取幸运顺序",
                             command=lambda text=".whoabcd", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="是与否",
                             command=lambda text=".yesno", role=role: self.insert_text_to_Bot(text, send=True))
            menu.add_command(label="全体今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_Bot(text, send=True))
        elif "NPC_name" in role:
            return
        else:
            menu.add_command(label="小窗...", command=lambda role=role: self.whisper_system(role))
            menu.add_command(label="投票表决", command=lambda role=role: self.voting_system(role))
            menu.add_command(label="活字命令", command=lambda role=role: self.on_at_right_click(role))
            menu.add_command(label="【明】抽牌堆",
                             command=lambda text=".draw", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【明】抽牌堆(多次)",
                             command=lambda text=".draw*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【明】抽牌堆(不放回)",
                             command=lambda text=".draw?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【明】抽牌堆(多次，不放回)",
                             command=lambda text=".draw?*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【暗】抽牌堆",
                             command=lambda text=".draw_", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【暗】抽牌堆(多次)",
                             command=lambda text=".draw_*", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【暗】抽牌堆(不放回)",
                             command=lambda text=".draw_?", role=role: self.list_carddecks(event, role, text))
            menu.add_command(label="【暗】抽牌堆(多次，不放回)",
                             command=lambda text=".draw_?*", role=role: self.list_carddecks(event, role, text))
            if role == "KP":
                menu.add_command(label="抽取幸运儿", command=lambda text=".who", role=role: self.insert_text_to_PC(text, role))
                menu.add_command(label="抽取幸运顺序", command=lambda text=".whoabcd", role=role: self.insert_text_to_PC(text, role))
            menu.add_command(label="是与否", command=lambda text=".yesno", role=role: self.insert_text_to_PC(text, role))
            menu.add_command(label="今日人品",
                             command=lambda text=".jrrp", role=role: self.insert_text_to_PC(text, role, send=True))
            menu.add_command(label="清空", command=lambda role=role: self.clearAll(role), background="red")
        self.show_menu(event, menu)

    def unify_times(self, auto=False):
        self.unify_time_log.append(self.time_log.get("1.0", tk.END))
        if auto:
            time = []
            unified_time_log = ""
            for t in self.unify_time_log:
                if "?" not in t.split("【地点】")[0].split("【时间】")[1] and "?" not in t.split("【日期】")[1].split(" ")[0]:
                    time.append(t.split("【日期】")[1].split(" ")[0].replace("/", "-") + " " + t.split("【地点】")[0].split("【时间】")[1])
            unified_time_ = max(time)
            for t in self.unify_time_log:
                if unified_time_.split(" ")[1] == t.split("【地点】")[0].split("【时间】")[1] and unified_time_.split(" ")[0] == t.split("【日期】")[1].split(" ")[0].replace("/", "-"):
                    unified_time_log = t
            if unified_time_log != "":
                self.time_log.delete("1.0", tk.END)
                self.time_log.insert("1.0", unified_time_log)
            self.send_env_text_to_log()

    def save_current_time(self):
        self.current_time_log = self.time_log.get("1.0", tk.END)
        self.send_env_text_to_log()

    def reverse_current_time(self):
        self.unify_times()
        if self.current_time_log and self.current_time_log != "":
            self.time_log.delete("1.0", tk.END)
            self.time_log.insert("1.0", self.current_time_log)
        self.send_env_text_to_log()

    def add_menu_skills(self, event, role):
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            menu = tk.Menu(root, tearoff=1, title=f"NPC【{name_}】的技能列表")
        else:
            menu = tk.Menu(root, tearoff=1, title=f"【{self.role_entries_name[role]}】的技能列表")
        menu.delete(0, tk.END)  # 清空菜单
        # 创建一个值为列表的字典
        sorted_dict = defaultdict(list)
        # 遍历原始字典，将具有相同值的键添加到相应的列表中
        if "NPC_name" in role:
            name_ = role.split("NPC_name")[0]
            for key, value in self.role_skill_menu[name_].items():
                sorted_dict[value].append(key)
        else:
            for key, value in self.role_skill_menu[self.role_entries_name[role]].items():
                sorted_dict[value].append(key)
        # 根据字典的键的顺序构建一个新的字典
        result_dict = {}
        for value, keys in sorted(sorted_dict.items()):
            for key in keys:
                result_dict[key] = value
        if "NPC_name" in role:
            name_ = role.split("NPC_name")[0]
            self.role_skill_menu[name_] = result_dict.copy()

            for skill_, type_ in self.role_skill_menu[name_].items():
                menu.add_command(label=skill_,
                                 command=lambda skill=skill_, role=role,
                                                type=type_: self.parse_menu_skills(role, skill, type))
        else:
            self.role_skill_menu[self.role_entries_name[role]] = result_dict.copy()

            for skill_, type_ in self.role_skill_menu[self.role_entries_name[role]].items():
                menu.add_command(label=skill_,
                                 command=lambda skill=skill_, role=role,
                                                type=type_: self.parse_menu_skills(role, skill, type))
        # menu.bind("<Motion>", lambda event=event, menu=menu:self.on_hover_menu_skills(event, menu))
        menu.add_command(label="新的技能...", command=lambda event=event, role=role: self.update_roles_skills(event, role))
        self.show_menu(event, menu)

    def parse_menu_skills(self, role, skill, type):
        target = ""
        if "NPC_name" in role:
            target_list = []
            for _role in self.roles:
                if _role != "DiceBot":
                    target_list.append(self.role_entries_name[_role])
            for _role in self.role_entries_name_NPC:
                target_list.append(self.role_entries_name_NPC[_role])
            target_index = "PL " + str(random.randint(1, len(self.roles) - 2))
            target = simpledialog.askstring("选择目标PL", "选择行动目标PL(留空或0为自己，接受序号):",
                                            initialvalue=self.role_entries_name[target_index])
            if target.isdigit():
                target_index = "PL " + target
            else:
                if target == "":
                    target_index = "PL 0"
                    target = "自己"
                else:
                    # 先检索敌人，再检索队友
                    for _namein, _name in self.role_entries_name.items():
                        if target in _name:
                            target_index = _namein
                            break
                    if target_index == "":
                        for _namein, _name in self.role_entries_name_NPC.items():
                            if target in _name:
                                target_index = _namein
                                break

        else:
            target_list = []
            for _role in self.role_entries_name_NPC:
                target_list.append(self.role_entries_name_NPC[_role])
            for _role in self.roles:
                if _role != "DiceBot":
                    target_list.append(self.role_entries_name[_role])
            target_index = ""
            target = simpledialog.askstring("选择目标", "选择行动目标(留空或0为自己，接受序号):", initialvalue=self.role_entries_name[role])
            if target.isdigit():
                target_index = "PL " + target
                if target == "0":
                    target_index = role
                target = self.role_entries_name[target_index]
            else:
                if target == "":
                    target_index = role
                    target = self.role_entries_name[role]
                else:
                    # 先检索敌人，再检索队友
                    for _namein, _name in self.role_entries_name_NPC.items():
                        if target in _name:
                            target_index = _namein
                            break
                    if target_index == "":
                        for _namein, _name in self.role_entries_name.items():
                            if target in _name:
                                target_index = _namein
                                break
        print("攻击目标：" + f"[{target_index}]{target}")

        if type == "skill":  # 技能名[鉴定](要求)效果公式：描述 →要求r鉴定→鉴定技能   小刀穿刺[斗殴](小刀)1D3：针对一个敌人穿刺
            require = ""
            expression = ""
            des = skill.split("：")[1]
            skill = skill.split("：")[0]
            name = skill.split("[")[0]
            check = skill.split("[")[1].split("]")[0]
            if "(" in skill:
                require = skill.split("(")[1].split(")")[0]
                if len(skill.split("(")[1].split(")")) > 1:
                    expression = skill.split(")")[1].replace(")", "")
            weapon_list = {}
            if "NPC_name" in role:
                role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
            else:
                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
            for skill, value in role_Chart_detail.items():
                if "#" in skill:
                    weapon_list[skill.replace("#", "")] = value
            DB_ = role_Chart_detail["DB"]
            DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
            if ("D" not in DB_) and ("-" not in DB_):
                DB_ = "+" + DB_
            expression = expression.replace('+DB', DB_)
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
            else:
                name_ = self.role_entries_name[role]
            if target != "" and target_index != "PL 0":
                text = check
                self.insert_roll_to_PC(text, role, send=True)
                text = f"[{name_}→{target}]" + name_ + "对" + target + "以" + require + "使用" + name
                self.insert_text_to_PC(text, role)
                text = des
                self.insert_text_to_PC(text, role)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, target_index)
            else:
                text = f"[{name_}→{name_}]" + name_ + "以" + require + "使用" + name + "，" + des
                self.insert_text_to_PC(text, role)
                text = check
                self.insert_roll_to_PC(text, role, send=True)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, role)

        elif type == "spell":  # 法术名[效果公式](消费)：描述  →计算消费  →作用 ：描述   →描述  御风术[HP-1D3](M1 S1D3+1)：扬起飞沙  恢复术[HP+1D3](M3)：绿色光晕，吟唱1回合，1天仅一次  魅惑术[心理学-20](M1+? S?) ←输入?：目标心理学-20%*M  高级魅惑术(M? S?)  ←输入?：目标心理学默然，持续M回合
            cost = ""
            expression = ""
            des = skill.split("：")[1]
            skill = skill.split("：")[0]
            name = skill.split("[")[0]
            expression = skill.split("[")[1].split("]")[0]
            mp_cost = 0
            hp_cost = 0
            san_cost = 0
            other_cost = {}
            if "(" in skill:
                cost = skill.split("(")[1].split(")")[0].replace("P", "").replace("AN", "")
            if " " in skill:
                cost = cost.split(" ")
                for c in cost:
                    if "M" in c:
                        mp_cost = int(self.cost_parse(c, "M"))
                    elif "S" in c:
                        san_cost = int(self.cost_parse(c, "S"))
                    elif "H" in c:
                        hp_cost = int(self.cost_parse(c, "H"))
            else:
                if "M" in cost:
                    mp_cost = int(self.cost_parse(cost, "M"))
                elif "S" in cost:
                    san_cost = int(self.cost_parse(cost, "S"))
                elif "H" in cost:
                    hp_cost = int(self.cost_parse(cost, "H"))
                else:
                    for char in cost:
                        if char.isalpha() and char != "D":
                            # other_cost[char] += 1
                            pass
            _SAN = int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip())
            _HP = int(self.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip())
            _MP = int(self.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip())
            _OtherDic = role_Chart.get(role, {}).copy()
            for key, value in other_cost.items():
                if key in _OtherDic:
                    if _OtherDic[key] >= value:
                        role_Chart[role][key] -= value
                        pass
                    else:
                        pass
            if mp_cost != 0 or hp_cost != 0 or san_cost != 0:
                if mp_cost != 0:
                    if mp_cost <= _MP:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"MP-{mp_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"MP-{mp_cost}", role, send=True)
                    else:
                        self.insert_text_to_PC("MP不足!", role)
                if hp_cost != 0:
                    if hp_cost <= _HP:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"HP-{hp_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"HP-{hp_cost}", role, send=True)
                        # self.role_entries[role].delete("1.0", tk.END)
                        # text = self.role_entries_name[role] + "使用了" + name + "，" + des
                        # self.insert_text_to_PC(text, role)
                        # text = expression
                        # self.insert_roll_to_PC(text, role)
                        # if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        # self.insert_roll_to_PC(expression, role)
                    else:
                        self.insert_text_to_PC("HP不足!", role)
                if san_cost != 0:
                    if san_cost <= _SAN:
                        if "NPC_name" in role:
                            self.insert_roll_to_PC(f"SAN-{san_cost}", role)
                        else:
                            self.insert_roll_to_PC(f"SAN-{san_cost}", role, send=True)
                        # self.role_entries[role].delete("1.0", tk.END)
                        # text = self.role_entries_name[role] + "使用了" + name + "，" + des
                        # self.insert_text_to_PC(text, role)
                        # text = expression
                        # self.insert_roll_to_PC(text, role)
                        # if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        # self.insert_roll_to_PC(expression, role)
                    else:
                        self.insert_text_to_PC("SAN不足!", role)
                self.role_entries[role].delete("1.0", tk.END)
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    if target != "" and target_index != "PL 0":
                        pass
                        text = f"[{name_}→{target}]" + name_ + "对" + target + "使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, target_index)
                        if self.role_entries_roll[target_index].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, target_index)
                    else:
                        pass
                        text = f"[{name_}→{name_}]" + name_ + "对自己使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, role)
                        if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, role)
                else:
                    pass
                    text = self.role_entries_name[role] + "使用了" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = expression
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)
            else:
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    if target != "" and target_index != "PL 0":
                        text = f"[{name_}→{target}]" + name_ + "对" + target + "使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, target_index)
                        if self.role_entries_roll[target_index].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, target_index)
                    else:
                        text = f"[{name_}→{name_}]" + name_ + "对自己使用了" + name + "，" + des
                        self.insert_text_to_PC(text, role)
                        text = expression
                        self.insert_roll_to_PC(text, role)
                        if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                            self.insert_roll_to_PC(expression, role)
                else:
                    text = self.role_entries_name[role] + "使用了" + name + "，" + des
                    self.role_entries[role].delete("1.0", tk.END)
                    self.insert_text_to_PC(text, role)
                    text = expression
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)

        elif type == "maneuver":  # 战技/特技名:效果[鉴定](要求)公式  →鉴定  →要求 使 效果  义肢护甲:ARMOR+2(声明左臂格挡)：  擒抱:缴械2回合[斗殴](体格大于等于1)：
            require = ""
            expression = ""
            check = ""
            if "：" in skill:
                des = skill.split("：")[1]
            else:
                des = ""
            skill = skill.split("：")[0]
            name = skill.split(":")[0]
            skill = skill.split(":")[1]
            effect = skill
            if "[" in skill:
                effect = skill.split("[")[0]
                check = skill.split("[")[1].split("]")[0]
            if "(" in skill:
                require = skill.split("(")[1].split(")")[0]
                if len(skill.split("(")[1].split(")")) > 1:
                    expression = skill.split(")")[1].replace(")", "")
                if "[" not in skill:
                    effect = skill.split("(")[0]
                if "NPC_name" in role:
                    if role.split("NPC_name")[1]:
                        name_ = role.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                else:
                    name_ = self.role_entries_name[role]
                if target != "" and target_index != "PL 0":
                    text = f"[{name_}→{target}]" + name_ + "对" + target + "以" + require + "声明" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = check
                    self.insert_roll_to_PC(text, role)
                    text = effect + f"({name_} → {target})"
                    self.insert_text_to_PC(text, target_index)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, target_index)
                else:
                    text = f"[{name_}→{name_}]" + name_ + "对自己" + "以" + require + "声明" + name + "，" + des
                    self.insert_text_to_PC(text, role)
                    text = check
                    self.insert_roll_to_PC(text, role)
                    if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                        self.insert_roll_to_PC(expression, role)
            else:
                text = self.role_entries_name[role] + "以" + require + "声明" + name + "，" + des + "，" + effect
                self.insert_text_to_PC(text, role)
                text = check
                self.insert_roll_to_PC(text, role)
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "" and expression != "":
                    self.insert_roll_to_PC(expression, role)
        else:  # other
            pass

    def cost_parse(self, cost, type):
        cost = cost.replace(type, "")
        if "D" in cost:
            result = 0
            matches = re.findall(r'\b\dD\d\b', cost)
            for m in matches:
                count = int(m.split("D")[0])
                dice = int(m.split("D")[1])
                result += count * random.randint(1, dice)
                cost = cost.replace(m, "")
            cost += "+" + str(result)
        if "?" in cost or "？" in cost:
            __c = ""
            for char in cost:
                if char == "？" or char == "?":
                    if type == "S":
                        _c = str(simpledialog.askinteger(f"SAN消费", f"输入消费的SAN:", initialvalue=1))
                    else:
                        _c = str(simpledialog.askinteger(f"{type}P消费", f"输入消费的{type}P:", initialvalue=1))
                    __c += "+" + _c
                else:
                    __c += char
            cost = __c
        cost = eval(cost)
        return cost

    def on_hover_menu_skills(self, event, menu):
        label = tk.Toplevel(root)
        hovered_item = menu.index(tk.CURRENT)
        label.config(text=f"Hovering over {menu.entrycget(hovered_item, 'label')}")
        label.geometry(f"+{event.x_root}+{event.y_root}")
        menu.bind("<Leave>", lambda label=label: self.hide_hover_menu_skills(label))

    def hide_hover_menu_skills(self, label):
        label.destory()

    def toggle_trpg(self):
        # 展开或缩进掷骰按钮和信息面板
        if self.trpg_toggle == "off":
            for role in self.roles:
                self.role_entries_roll[role].grid_forget()  # 缩进
                self.role_roll_button[role].grid_forget()
                self.role_values_entry[role].grid_forget()
            self.trpg_toggle = "on"
        else:
            for role in self.roles:
                self.role_entries_roll[role].grid(row=0, column=2, padx=5, pady=5, sticky="nsew")  # 展开
                self.role_roll_button[role].grid(row=2, column=2, padx=5, pady=5)
                self.role_values_entry[role].grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
            self.trpg_toggle = "off"

    def send_message(self, role):
        global role_Chart_at_name
        global _speechspeed
        global bot_personality

        if "NPC_name" in role:
            role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
        else:
            role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
        self.search_and_delete_insert_symbol()

        message = self.role_entries[role].get("1.0", tk.END).strip()
        message = message.replace(self.trpg_module.Critical_Success, "")
        message = message.replace(self.trpg_module.Extreme_Success, "")
        message = message.replace(self.trpg_module.Success, "")
        message = message.replace(self.trpg_module.Hard_Success, "")
        message = message.replace(self.trpg_module.Failure, "")
        message = message.replace(self.trpg_module.Fumble, "")
        if message == "":
            return
        if self.whisper_system(role, whisper=False):
            return
        if role == "DiceBot":
            if ".draw" in message or "。draw" in message:
                num = 1
                if "*" in message:
                    num = int(message.split("*")[1])
                    message = message.split("*")[0]
                cardname = message.replace(".draw_", "").replace("。draw_", "").replace(".draw", "").replace("。draw", "")
                cardname = cardname.replace("?", "").replace("？", "").strip()
                Cards_now = load_CardDeck(cardname)
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", message)
                if Cards_now:
                    result_ = ""
                    while num > 0:
                        if "?" in message or "？" in message:
                            if cardname not in Cards_list:
                                Cards_list[cardname] = Cards_now
                            elif len(Cards_list[cardname]) == 0:
                                Cards_list[cardname] = Cards_now
                            if isinstance(Cards_now, list):
                                result = random.choice(Cards_list[cardname])
                                Cards_list[cardname].remove(result)
                                if num == 1:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'\n公有不放回牌堆[{cardname}]还余{len(Cards_list[cardname])}张卡。\n')
                            elif isinstance(Cards_now, dict):
                                result = random.choice(Cards_list[cardname][cardname])
                                if len(Cards_list[cardname][cardname]) != 1:
                                    Cards_list[cardname][cardname].remove(result)
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                while "{%" in result:
                                    result = result.replace("%}", "}")
                                    result = result.replace("}", "%}")
                                    matches = re.findall(r'\{%([^%]+)%\}', result)
                                    for m in matches:
                                        result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if num <= 1:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'\n公有不放回牌堆[{cardname}]还余{len(Cards_list[cardname][cardname])}张卡。\n')
                                    if len(Cards_list[cardname][cardname]) == 0:
                                        self.role_entries[role].insert(tk.END,
                                                                       f'已自动补充牌堆。\n')
                                        Cards_list[cardname] = load_CardDeck(cardname)[cardname]
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if "{" in result or "%" in result:
                                    result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                            else:
                                print("my_var 不是列表也不是字典")
                                result = "ERR:请检查JSON牌堆格式！"
                            cardname = cardname + "(不放回)"
                        else:
                            if isinstance(Cards_now, list):
                                result = random.choice(Cards_now)
                            elif isinstance(Cards_now, dict):
                                result = random.choice(Cards_now[cardname])
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                while "{%" in result:
                                    result = result.replace("%}", "}")
                                    result = result.replace("}", "%}")
                                    matches = re.findall(r'\{%([^%]+)%\}', result)
                                    for m in matches:
                                        result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                                if "{" in result or "%" in result:
                                    result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                            else:
                                print("my_var 不是列表也不是字典")
                                result = "ERR:请检查JSON牌堆格式！"

                        if ".draw_" in message or "。draw_" in message:
                            if num == 1:
                                if result_ != "":
                                    result_ = result_ + f"[{num}]" + result
                                    result = result_
                                result = f"\n{result}".replace("\n\n", "\n")
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次公有牌堆[{cardname}]的暗抽。\n\n')
                                self.role_entries[role].insert(tk.END,
                                                               f'\n公有的牌堆[{cardname}]的抽取结果：{result}\n')
                                self.chat_log.yview(tk.END)
                            else:
                                result_ = result_ + f"[{num}]" + result + "\n"
                        else:
                            if num == 1:
                                if result_ != "":
                                    result_ = result_ + f"[{num}]" + result
                                    result = result_
                                result = f"\n{result}".replace("\n\n\n", "\n")
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                                self.chat_log.yview(tk.END)
                            else:
                                result_ = result_ + f"[{num}]" + result + "\n"
                        num -= 1
                else:
                    print("未找到牌堆或牌堆为空！")
                    os.startfile("CardDecks")
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif "。alldraw" in message or ".alldraw" in message or ".drawall" in message or "。drawall" in message:
                message = message.replace("all", "")
                for role in self.roles:
                    if role != "DiceBot":
                        self.drawcard(message, role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".jrrp" in message or "。jrrp" in message:
                message = ""
                for role in self.roles:
                    if role != "DiceBot":
                        self.jrrp(role)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            if ".whoabcd" in message.lower() or "。whoabcd" in message.lower() or "。who abcd" in message.lower() or ".whoabcd" in message.lower():
                rolelist = []
                result = ""
                if message.lower().replace(".who", "").replace("。who", "").replace("abcd", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").replace("abcd",
                                                                                                    "").strip() + "]"
                else:
                    reason = ""
                for role in self.roles:
                    if role != "DiceBot":
                        rolelist.append(role)
                random.shuffle(rolelist)
                for r in rolelist:
                    result = result + " > " + self.role_entries_name[r]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason}抽取幸运顺序：{result}\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".who" in message or "。who" in message:
                rolelist = []
                if message.lower().replace(".who", "").replace("。who", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").strip() + "]"
                else:
                    reason = ""
                for role in self.roles:
                    if role != "DiceBot" and role != "KP":
                        rolelist.append(role)
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason}抽取幸运儿：【{self.role_entries_name[random.choice(rolelist)]}】\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".no" in message.lower() or "。no" in message.lower() or "。yes" in message.lower() or ".yes" in message.lower():
                message = message.lower().replace(".no", "").replace(".yes", "").replace("。no", "").replace("。yes",
                                                                                                            "").replace(
                    "。yesno", "").replace(".yesno", "").strip()
                if message != "":
                    reason_ = "[" + message + "]的"
                else:
                    reason_ = ""
                list_ = ["是", "否"]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{reason_}是或否：【{random.choice(list_)}】\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".draw" == message.lower() or "。draw" == message.lower() or "。全牌堆列表" == message.lower() or ".全牌堆列表" == message.lower():
                os.startfile("CardDecks")
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
        else:
            if ".jrrp" in message or "。jrrp" in message:
                self.jrrp(role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".draw" in message or "。draw" in message or "。selfdraw" in message or ".selfdraw" in message or "。drawself" in message or ".drawself" in message:
                self.drawcard(message, role)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".no" in message.lower() or "。no" in message.lower() or "。yes" in message.lower() or ".yes" in message.lower():
                message = message.lower().replace("。yesno", "").replace(".yesno", "").replace(".no", "").replace(".yes",
                                                                                                                 "").replace(
                    "。no", "").replace("。yes", "").strip()
                if message != "":
                    reason_ = "由于[" + message + "]的"
                else:
                    reason_ = ""
                list_ = ["是", "否"]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{self.role_entries_name[role]}{reason_}是或否：【{random.choice(list_)}】\n\n')
                self.chat_log.yview(tk.END)
                message = ""
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".whoabcd" in message.lower() or "。whoabcd" in message.lower() or "。who abcd" in message.lower() or ".whoabcd" in message.lower():
                rolelist = []
                result = ""
                if message.lower().replace(".who", "").replace("。who", "").replace("abcd", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").replace("abcd",
                                                                                                    "").strip() + "]"
                else:
                    reason = ""
                for role3 in self.roles:
                    if role3 != "DiceBot":
                        rolelist.append(role3)
                random.shuffle(rolelist)
                for r in rolelist:
                    result = result + " > " + self.role_entries_name[r]
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{self.role_entries_name[role]}{reason}抽取幸运顺序：{result}\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
            elif ".who" in message or "。who" in message:
                rolelist = []
                if message.lower().replace(".who", "").replace("。who", "").strip() != "":
                    reason = "因[" + message.lower().replace(".who", "").replace("。who", "").strip() + "]"
                else:
                    reason = ""
                for role3 in self.roles:
                    if role3 != "DiceBot" and role3 != "KP":
                        rolelist.append(role3)
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{self.role_entries_name[role]}{reason}抽取幸运儿：【{self.role_entries_name[random.choice(rolelist)]}】\n\n')
                self.chat_log.yview(tk.END)
                _role_entry = self.role_entries[role].get("1.0", tk.END).strip()
                self.role_entries[role].delete("1.0", tk.END)
                self.role_entries[role].insert("1.0", _role_entry)
                return
        if message:
            timestamp = datetime.now().strftime("%Y/%m/%d %H:%M:%S")
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                log = f"{name_} {timestamp}\n{message}\n\n"  # 不加引号
                self.chat_log.insert(tk.END, log)
                # 滚动到最底部
                self.chat_log.yview(tk.END)
                self.role_entries[role].delete("1.0", tk.END)
                return
            log = f"{self.role_entries_name[role]} {timestamp}\n{message}\n\n"  # 不加引号
            if message.startswith(".st") or message.startswith("。st"):
                message = message[len("st") + 1:].strip()

                parts_skill = re.findall(r'([\u4e00-\u9fa5a-zA-Z\s]+)(\d+)', message)
                if ("+" or "-" or "*" or "/") in message and "#" not in message:
                    parts = re.findall(r'([#+]?[\u4e00-\u9fa5a-zA-Z\s]+)([-+*/^])(\d+)', message)
                    print(parts)
                    # print(str(parts[0][0]).upper())
                    if parts and len(parts) > 0 and len(parts[0]) > 0:
                        role_Chart[role][str(parts[0][0]).upper()] = eval(
                            str(role_Chart_detail[str(parts[0][0]).upper()]) + parts[0][1] + parts[0][2])
                    # print(str(parts[0][0]).upper()+":"+str(role_Chart[role][str(parts[0][0]).upper()]))
                    self.chat_log.insert(tk.END,
                                         f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的【{str(parts[0][0]).upper()}】变更为{str(role_Chart[role][str(parts[0][0]).upper()])}\n\n')
                    # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的【{str(parts[0][0]).upper()}】变更为{str(role_Chart[role][str(parts[0][0]).upper()])}\n"
                    # 滚动到最底部
                    self.chat_log.yview(tk.END)
                else:
                    new_chart = self.parse_input_skill(message.upper()).copy()
                    print(new_chart)

                    self.update_skills(role_Chart[role], new_chart)
                    if "NPC_name" in role:
                        role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                    else:
                        role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                    # if self.role_entries_name[role] in role_Chart_at_name:
                    role_Chart_at_name[self.role_entries_name[role]] = role_Chart[role].copy()
                    if role in self.role_avatar_paths:
                        role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = self.role_avatar_paths[role]
                    self.save_role_skill_at_name()
                    # print(role_Chart_at_name[self.role_entries_name[role]])
                SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                POW = role_Chart_detail.get("POW")
                DB = role_Chart_detail.get("DB")
                if "#SAN" in role_Chart_detail:
                    _SAN = role_Chart_detail.get("#SAN")
                else:
                    _SAN = 100
                if "HP" in message.upper():
                    HP_ = self.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("2.0", "3.0")
                    self.role_values_entry[role].insert("2.0",
                                                        f'{HP_}/{HP}:HP\n')
                if "MP" in message.upper():
                    MP_ = self.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("3.0", "4.0")
                    self.role_values_entry[role].insert("3.0",
                                                        f'{MP_}/{MP}:MP\n')
                if "SAN" in message.upper():
                    SAN_ = self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                    # if SAN_ == 0 or SAN_ == "":
                    # SAN_ = POW
                    self.role_values_entry[role].delete("1.0", "2.0")
                    self.role_values_entry[role].insert("1.0",
                                                        f'{SAN_}/{_SAN}:SAN\n')
                if "MOV" in message.upper():
                    MOV_ = self.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                    self.role_values_entry[role].delete("4.0", "5.0")
                    self.role_values_entry[role].insert("4.0",
                                                        f'{MOV_}/{MOV}:MOV\n')
                if "DB" in message.upper():
                    self.role_values_entry[role].delete("5.0", "6.0")
                    self.role_values_entry[role].insert("5.0",
                                                        f'\n{DB}:DB\n')
                else:
                    self.role_values_entry[role].insert("1.0",
                                                        f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                self.role_entries[role].delete("1.0", tk.END)
                # self.chat_log.insert(tk.END, f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime(
                # "%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\nSAN:{SAN}\nHP:{HP}\nMP:{MP}\nMOV:{
                # MOV}\n\n\n')
                if parts_skill and len(parts_skill) > 0 and len(parts_skill[0]) > 0:
                    self.role_entries[role].insert(tk.END, "已录入！")
                    if "HP" in str(parts_skill[0][0]).upper() or "MP" in str(parts_skill[0][0]).upper() or "SAN" in str(
                            parts_skill[0][0]).upper() or "MOV" in str(parts_skill[0][0]).upper():
                        self.chat_log.insert(tk.END,
                                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get("1.0", "5.0").strip()}\n\n')
                        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get('1.0', '5.0').strip()}\n"
                        self.chat_log.yview(tk.END)
                    else:
                        if len(parts_skill) == 1 and "#" not in message:
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的【{str(parts_skill[0][0]).upper()}】成长为{str(role_Chart[role][str(parts_skill[0][0]).upper()])}！\n\n')
                        # self.chat_log_huozi = self.chat_log_huozi + f"<{self.role_entries_name['DiceBot']}>【{self.role_entries_name[role]}】的【{str(parts_skill[0][0]).upper()}】成长为{str(role_Chart[role][str(parts_skill[0][0]).upper()])}！\n"
                        self.chat_log.yview(tk.END)
                else:
                    self.role_entries[role].insert(tk.END, "已刷新！")
                self.update_health_bar(role)
            else:
                fire_babel(self, role)
                self.chat_log.insert(tk.END, log)
                # 滚动到最底部
                self.chat_log.yview(tk.END)
                self.role_entries[role].delete("1.0", tk.END)

                # 计算字数加至时间，不计括号内的文字
                matches = re.findall(r'\(([^)]*)\)', message)
                if matches:
                    for m in matches:
                        message = message.replace(f"({m})", "")
                matches = re.findall(r'（([^）]*)）', message)
                if matches:
                    for m in matches:
                        message = message.replace(f"（{m}）", "")
                if 0 < len(message) < _speechspeed:
                    seconds = 1
                else:
                    seconds = int(len(message) / _speechspeed)
                if seconds > 0:
                    global _secondsTime
                    _secondsTime += seconds
                    while _secondsTime >= 60:
                        self.trpg_module.add_time_1min()
                        _secondsTime -= 60
                    print(f"秒表：{_secondsTime}秒")
        # 妙语
        if role != "DiceBot" and "NPC_name" not in role:
            global mav_prob
            rand_num = random.random()  # 生成0到1之间的随机数
            if rand_num >= 1 - mav_prob:
                if self.role_entries_name[role] in bot_personality["妙语"]:
                    _mav_list = []
                    _mav_list = bot_personality["妙语"][self.role_entries_name[role]] + bot_personality["妙语"]["通用"]
                    mav_words_ = random.choice(_mav_list)
                else:
                    mav_words_ = random.choice(bot_personality["妙语"]["通用"])
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                self.chat_log.yview(tk.END)

    def san_cal_status(self, role):
        fear_list = ["洗澡恐惧症(Ablutophobia)：对于洗涤或洗澡的恐惧。",
                     "恐高症(Acrophobia)：对于身处高处的恐惧。“别往下看！”你害怕高处。让你身处高处会令你恐慌。通常的反应包括心悸、颤抖、焦虑等。当你身处高处时，你将激动过度以致无法自行安全降落，可能需要别人帮助。甚至仅仅对高处的预想，如想象自己将登上高楼，都会令你变成语无伦次的废人。身处高处将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，正常应对眼下的情况。",
                     "飞行恐惧症(Aerophobia)：对飞行的恐惧。",
                     "广场恐惧症(Agoraphobia)：对于开放的(拥挤)公共场所的恐惧。",
                     "恐鸡症(Alektorophobia)：对鸡的恐惧。",
                     "大蒜恐惧症(Alliumphobia)：对大蒜的恐惧。",
                     "乘车恐惧症(Amaxophobia)：对于乘坐地面载具的恐惧。",
                     "恐风症(Ancraophobia)：对风的恐惧。",
                     "男性恐惧症(Androphobia)：对于成年男性的恐惧。",
                     "恐英症(Anglophobia)：对英格兰或英格兰文化的恐惧。",
                     "恐花症(Anthophobia)：对花的恐惧。",
                     "截肢者恐惧症(Apotemnophobia)：对截肢者的恐惧。",
                     "蜘蛛恐惧症(Arachnophobia)：对蜘蛛的恐惧。“蜘蛛网……！到处都是蜘蛛网！”你会无端地对蜘蛛产生恐惧。这种八条腿噩梦的藏身之处会令你非常不安。仅仅看见蜘蛛网都会让你冷汗直流、心跳加速。如果有蜘蛛突然碰到了你或者离你过近，你可能惊慌大叫，呼吸困难，害怕蜘蛛会杀死你。极端的时候，甚至看到蜘蛛的图片都会吓到你。附近有蜘蛛或蜘蛛存在的迹象将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能够在蜘蛛（或蜘蛛存在的迹象）附近停留一段时间。",
                     "闪电恐惧症(Astraphobia)：对闪电的恐惧。",
                     "废墟恐惧症(Atephobia)：对遗迹或残址的恐惧。",
                     "长笛恐惧症(Aulophobia)：对长笛的恐惧。",
                     "细菌恐惧症(Bacteriophobia)：对细菌的恐惧。",
                     "导弹/子弹恐惧症(Ballistophobia)：对导弹或子弹的恐惧。",
                     "跌落恐惧症(Basophobia)：对于跌倒或摔落的恐惧。",
                     "书籍恐惧症(Bibliophobia)：对书籍的恐惧。“把它从我眼前拿开！”你害怕书籍。强迫你拿着或阅读书籍会令你发抖、出汗、大哭。你最害怕的可能是书籍本身（发脆的纸张、皮革封面）或者它们的内容。也可能是阅读本身、学习新事物、令人恐惧的知识，让你精神崩溃。你会避免阅读，图书馆变成了你的禁区。虽然你能够进入有书架的房间（你马上就会离开！），但你一想到别人要你拿起一本书甚至去阅读，就会心跳加速，内心充满恐惧。附近有书籍将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能浏览书籍、阅读其中的一篇短文，或者将这本书交给他人。",
                     "植物恐惧症(Botanophobia)：对植物的恐惧。",
                     "美女恐惧症(Caligynephobia)：对美貌女性的恐惧。",
                     "寒冷恐惧症(Cheimaphobia)：对寒冷的恐惧。",
                     "恐钟表症(Chronomentrophobia)：对于钟表的恐惧。",
                     "幽闭恐惧症(Claustrophobia)：对于处在封闭的空间中的恐惧。“求你了，我不要进到那种可怕的地窖里……”你害怕封闭空间。这可能是想象自己被关进狭小空间，逃生希望渺茫；也可能是想象自己有可能落入陷阱——也许你会窒息，或者被什么黑暗可怕的东西当作美餐？你会拒绝进入地窖、洞穴或电梯等狭小空间。如果你发现自己身处封闭空间，比如一间没有窗户的小屋或者上锁的车厢，你会开始恐慌、出汗，感觉有什么东西让你透不过气。严重的时候，你甚至会强迫性地脱衣服以求得一点虚假的自由感。身处封闭空间将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能穿过这一地区或者平静下来走出去。",
                     "小丑恐惧症(Coulrophobia)：对小丑的恐惧。",
                     "恐犬症(Cynophobia)：对狗的恐惧。",
                     "恶魔恐惧症(Demonophobia)：对邪灵或恶魔的恐惧。",
                     "人群恐惧症(Demophobia)：对人群的恐惧。“他们全都在看着我……”你害怕人群。你会躲避大群的人，不论这些人是在举办运动会、在热闹的大街穿行还是在教堂集会。你可能是害怕被困住，或者你觉得所有人都是你的敌人，等着你自投罗网——他们知晓你的秘密，有一点点机会就会群起而攻之。你仅仅想到自己会进入充满人的热闹场所，就会动弹不得。转过一个街角进入人群的话，你会出汗、颤抖，嘴唇发干。你身上的每一个细胞都在告诉你要逃离，如果你不逃的话，你会崩溃倒地，剧烈地抖动。身处人群中将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能快速穿越人群。",
                     "牙科恐惧症①(Dentophobia)：对牙医的恐惧。",
                     "丢弃恐惧症(Disposophobia)：对于丢弃物件的恐惧(贮藏癖)。",
                     "皮毛恐惧症(Doraphobia)：对动物皮毛的恐惧。",
                     "过马路恐惧症(Dromophobia)：对于过马路的恐惧。",
                     "教堂恐惧症(Ecclesiophobia)：对教堂的恐惧。",
                     "镜子恐惧症(Eisoptrophobia)：对镜子的恐惧。“不要照镜子！你的灵魂会被偷走的！”你异常害怕镜子。也许是银白的镜面里隐藏着残忍的恶魔，它知道你的秘密，唆使你去做坏事？也许是看到你在镜子里的影像会让你想起你做过的种种恐怖事件？又或者是镜子里潜藏着什么东西在等着你……镜子常常和厄运联系在一起——如果你接近镜子，你可以打破镜子并将所有厄运归到自己头上。如果你走过镜子附近，你会注意到有什么东西在看着你。你会避免携带镜子，还会尽最大努力不去看任何镜子。但如果你被强迫照了镜子，你会被纯粹的恐惧侵袭，心率增加，身体颤抖，直到你突然昏厥并倒地。附近有镜子将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能携带镜子或者快速向镜子里瞥一眼。",
                     "针尖恐惧症(Enetophobia)：对针或大头针的恐惧。",
                     "昆虫恐惧症(Entomophobia)：对昆虫的恐惧。",
                     "恐猫症(Felinophobia)：对猫的恐惧。",
                     "过桥恐惧症(Gephyrophobia)：对于过桥的恐惧。",
                     "恐老症(Gerontophobia)：对于老年人或变老的恐惧。",
                     "恐女症(Gynophobia)：对女性的恐惧。",
                     "恐血症(Haemaphobia)：对血的恐惧。“血！到处都是血！”你害怕血。看到血会令你心跳加速、血压升高。你的嘴唇发干，头晕目眩。如果血很多（事故、搏斗或目睹手术等），你很可能恶心反胃甚至昏厥。你会对你或他人的小伤口过度反应，难以帮助别人而可能会逃跑。你会抗拒观察手术、进入灾难现场；如果可能看见血，你会拒绝进入医院。附近有血将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能正视血、采集带血的样本或者施行急救。",
                     "宗教罪行恐惧症(Hamartophobia)：对宗教罪行的恐惧。",
                     "触摸恐惧症(Haphophobia)：对于被触摸的恐惧。",
                     "爬虫恐惧症(Herpetophobia)：对爬行动物的恐惧。",
                     "迷雾恐惧症(Homichlophobia)：对雾的恐惧。“关上窗帘！雾里的东西会看见你的！”你异常害怕雾气和潮气。雾气是世间最凶恶歹徒的最佳掩护（想想开膛手杰克），它掩盖了一切，哪怕有人离你不过几寸远，正打算攻击你，你却无法察觉他是谁。你恐怕会永远迷失在雾里，找不到回家的路；或者什么潮湿怪异的手会无端出现，偷走你的生命。呆在充满光线的室内比出门走进迷雾要好得多。如果强迫你走出去，你会变得焦虑、气短、恶心、流汗。如果独自或强迫呆在有雾的地方一很长一段时间，你很可能会颤抖、吐字不清，甚至可能昏厥。身处雾气或潮气当中将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能快速通过一团雾气。",
                     "火器恐惧症(Hoplophobia)：对火器的恐惧。",
                     "恐水症(Hydrophobia)：对水的恐惧。“让我从这个水地狱解脱吧！”你异常害怕水。不论是海洋、河流，甚至是一浴缸的水，只是想一想沉没在这种光滑、冒泡又不断流动的液体里，都会让你充满恐惧。你会抗拒游泳，如果被突然推进水里，你会经历强烈的身体反应——颤抖、战栗、乱扑腾。你越恐慌，越可能溺水，无法游到安全地带；必须有人帮助。在极端情况下，甚至喝水都成为了令你惊恐的行为，你会出汗、心跳增加。附近有水将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能快速通过一片水域、洗澡等等。",
                     "催眠恐惧症(Hypnophobia)：对于睡眠或被催眠的恐惧。",
                     "白袍恐惧症(Iatrophobia)：对医生的恐惧。",
                     "鱼类恐惧症(Ichthyophobia)：对鱼的恐惧。",
                     "蟑螂恐惧症(Katsaridaphobia)：对蟑螂的恐惧。",
                     "雷鸣恐惧症(Keraunophobia)：对雷声的恐惧。",
                     "蔬菜恐惧症(Lachanophobia)：对蔬菜的恐惧。",
                     "噪音恐惧症(Ligyrophobia)：对刺耳噪音的恐惧。“天！你听见那个了吗？” 你害怕巨大的声响。警报声、火警笛声、爆炸声之类急遽的巨响会让你紧张失色。其他症状还包括：换气过度、肌肉痉挛、口干舌燥、头晕目眩、心悸震颤等。你会十分小心乐器，特别是鼓；也会躲避游行、嘉年华和焰火表演。你会尽量让收音机、音乐播放器和电视的音量调到最低。看到别人吹气球会让你十分恐惧，感觉自己失去控制，你无法集中精力到噪音源以外的任何东西上。身处噪音之中将导致你无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。注意如果你身边有枪声，惩罚仍要生效。成功使用精神分析技能可以让你暂时缓解紧张，能平静下来克服严重不良反应。",
                     "恐湖症(Limnophobia)：对湖泊的恐惧。",
                     "机械恐惧症(Mechanophobia)：对机器或机械的恐惧。",
                     "巨物恐惧症(Megalophobia)：对于庞大物件的恐惧。",
                     "捆绑恐惧症(Merinthophobia)：对于被捆绑或紧缚的恐惧。",
                     "流星恐惧症(Meteorophobia)：对流星或陨石的恐惧。",
                     "孤独恐惧症(Monophobia)：对于一人独处的恐惧。“不要离开我！” 你极其害怕独处。如果你独处一地，周围又没有朋友，你会开始恐惧。你会因独处的想法而紧张，即使独处时间并不长。症状包括：失去斗志、极度自卑、恐慌等。你的心率会增加，吐字不清，情绪剧烈波动。只要落单，你就只能乞求陌生人的怜悯了。你可能会难以完成某些事，如穿越人群（你可能会落单）、进入电梯或者黑暗的地方、乘坐公共交通工具等。独处将导致你无法抗拒的恐惧反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。注意如果你身边有枪声，惩罚仍要生效。成功使用精神分析技能可以让你暂时缓解紧张，能平静下来克服严重不良反应。和朋友通电话也能让你缓解症状。",
                     "不洁恐惧症(Mysophobia)：对污垢或污染的恐惧。",
                     "黏液恐惧症(Myxophobia)：对黏液(史莱姆)的恐惧。",
                     "尸体恐惧症(Necrophobia)：对尸体的恐惧。",
                     "数字8恐惧症(Octophobia)：对数字8的恐惧。",
                     "恐牙症(Odontophobia)：对牙齿的恐惧。“啊啊啊！牙！” 你害怕牙齿，尤其害怕那种磨得格格响、咬得喀喀响、嚼得嘎吱响的尖牙利齿。狗、猫或者更可怕的动物，舔着牙齿，盯着你看。你知道它们在想什么。它们想吃你！即使是人类，如果他们露出了或白或黄的牙齿，他们也可能是食人族——他们唯一的想法就是用你的肉大快朵颐，把你的骨头咬碎磨烂。你对陌生人十分紧张，对长着尖牙的动物十分恐惧。当诱捕动物、其他的打招呼露出牙齿、甚至面对怪物时，你会产生无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能平静下来克服严重不良反应。",
                     "恐梦症(Oneirophobia)：对梦境的恐惧。",
                     "称呼恐惧症(Onomatophobia)：对于特定词语的恐惧。",
                     "恐蛇症(Ophidiophobia)：对蛇的恐惧。",
                     "恐鸟症(Ornithophobia)：对鸟的恐惧。",
                     "寄生虫恐惧症(Parasitophobia)：对寄生虫的恐惧。",
                     "人偶恐惧症(Pediophobia)：对人偶的恐惧。",
                     "吞咽恐惧症(Phagophobia)：对于吞咽或被吞咽的恐惧。",
                     "药物恐惧症(Pharmacophobia)：对药物的恐惧。",
                     "幽灵恐惧症(Phasmophobia)：对鬼魂的恐惧。",
                     "日光恐惧症(Phenogophobia)：对日光的恐惧。",
                     "胡须恐惧症(Pogonophobia)：对胡须的恐惧。",
                     "河流恐惧症(Potamophobia)：对河流的恐惧。",
                     "酒精恐惧症(Potophobia)：对酒或酒精的恐惧。",
                     "恐火症(Pyrophobia)：对火的恐惧。",
                     "魔法恐惧症(Rhabdophobia)：对魔法的恐惧。“啊啊啊！他要把我们变成蛤蟆了！” 你害怕魔术。任何和魔术有关的东西，包括卡片戏法、舞台魔术到声称拥有真正魔力的远古典籍，都可能把你变成抖成一团的废人。魔术会改变物体，也能改变你。它是神秘学，是通向黑暗邪恶世界的大门。小心魔术师。你知道他们的真相和他们造成的危险。当你身处魔术表演、魔术道具和魔术师附近时，你会紧张、极度恐惧、汗流不止、恶心、口齿不清。如果你发现自己成为了神话魔法的目标，你的反应会极其严重，会暂时产生紧张症（理智检定成功可以回避此效果）。周围有魔术时，你会产生无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能平静下来克服严重不良反应。",
                     "黑暗恐惧症(Scotophobia)：对黑暗或夜晚的恐惧。“灯呢？光呢？！” 你大致上极其害怕黑暗或夜晚，症状顽固。黑暗隐藏了很多东西，它们意图伤害你。如果你走进黑暗，你会被它们带走。黑暗中发生着各种各样的恶行——谋杀、偷盗、甚至更糟。你会躲避一切黑暗的地点：空房间、黑暗的地窖、茂密的森林；夜晚出门会让你产生深深的恐惧。如果你身处黑暗当中，你会呼吸困难、虚汗直冒、浑身发抖、充满恐惧。如果在黑暗中停留时间过久，你会经历强烈的焦虑发作，无法清楚地说话，更可能暂时产生紧张症（理智检定成功可以回避此效果）。身处黑暗之中将导致你产生无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能短时间维持自己的精神不致崩溃。",
                     "恐月症(Selenophobia)：对月亮的恐惧。",
                     "火车恐惧症(Siderodromophobia)：对于乘坐火车出行的恐惧。",
                     "恐星症(Siderophobia)：对星星的恐惧。",
                     "狭室恐惧症(Stenophobia)：对狭小物件或地点的恐惧，密闭恐惧。",
                     "对称恐惧症(Symmetrophobia)：对对称的恐惧。",
                     "活埋恐惧症(Taphephobia)：对于被活埋或墓地的恐惧。“到处都是死人！” 你害怕被活埋，也害怕墓地。你可能是害怕自己被宣布死亡，醒来时已经被深埋地下，无从逃脱，只能慢慢窒息。也可能是害怕坟地的死人，生者不应惊扰死者。墓地是坏地方。死者可以感受到生者，对生命产生嫉妒。有时对生命的渴求过于强烈，会让它们化作捕食生者的僵尸。附近有任何能让你联想到死亡的物品（葬礼、太平间、棺材等）将导致你产生无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能短时间维持自己的精神不致崩溃。",
                     "公牛恐惧症(Taurophobia)：对公牛的恐惧。",
                     "电话恐惧症(Telephonophobia)：对电话的恐惧。",
                     "怪物恐惧症(Teratophobia)：对怪物的恐惧。",
                     "深海恐惧症(Thalassophobia)：对海洋的恐惧。",
                     "手术恐惧症(Tomophobia)：对外科手术的恐惧。",
                     "十三恐惧症(Triskadekaphobia)：对数字13的恐惧症。",
                     "衣物恐惧症(Vestiphobia)：对衣物的恐惧。",
                     "女巫恐惧症(Wiccaphobia)：对女巫与巫术的恐惧。",
                     "黄色恐惧症(Xanthophobia)：对黄色或“黄”字的恐惧。",
                     "外语恐惧症(Xenoglossophobia)：对外语的恐惧。",
                     "异域恐惧症(Xenophobia)：对陌生人或外国人的恐惧。“他们想抓我！” 你害怕陌生人和外国人。任何你认为不同（异）或不熟悉（怪）的人都是潜在的威胁，会让你的心脏恐惧地加快速度。陌生人不可相信，他们的动机和目标完全是不可知的。怪人隐藏着不可告人的秘密，他们可能是杀人犯，也可能是想偷走你的个人信息，好收走你的身家性命。你在面对不同于你的人时，会经历极端的情绪波动，愤怒、挑衅、纯粹的恐怖都有可能。如果你身处异国他乡或者周围全是陌生人、异族人的时候，任何环境都会让你紧张或愤怒。附近有这些人将导致你产生无法抗拒的应激反应，在恐惧状态下，除了逃跑和格斗（若战斗中）以外的所有技能检定都要受到一个惩罚骰。成功使用精神分析技能可以让你暂时缓解紧张，能短时间维持自己的精神不致崩溃。",
                     "动物恐惧症(Zoophobia)：对动物的恐惧。",
                     "密集恐惧症(补充)"]
        mad_list = ["沐浴癖(Ablutomania)：执着于清洗自己。",
                    "犹豫癖(Aboulomania)：病态地犹豫不定。“做这个无济于事，而做那个还不如这个！”你变得犹豫不决，无法制定决策，或者同意明确的行动计划。你的精神备受煎熬，害怕你会选择所有坏的选项——可能会对你和朋友造成可怕的后果。这种决策瘫痪会造成你不论什么事情都会过度分析。你会经常变得易怒或走神，影响你正常进行社交的能力。更令人担忧的是，在战斗中你的犹豫不决会让局势变得更加致命。当你面临必须做出决断的情况时，你将无法抗拒躁狂反应，所有技能检定受到一个惩罚骰，直到情况解决或你远离刺激为止。KP 也可能根据情形改变技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "喜暗狂(Achluomania)：对黑暗的过度热爱。",
                    "喜高狂(Acromaniaheights)：狂热迷恋高处。",
                    "亲切癖(Agathomania)：病态地对他人友好。“嘿，我来帮你做这个吧。”你的症状是病态的友好行为。这种躁狂症表现为对进行亲切行为的需要，对象可能是朋友、陌生人甚至是敌人。你会强迫性地进行利他行为，表面上显示为需求别人的接受和承认。你的内心感到因为对别人做得不够而自责，或者在别人得到关注、而你的努力无人过问时产生嫉妒。这种利他行为会导致不健康的极端行为。对别人做太多会让你筋疲力尽，因为你为他人想太多却想不到自己。如果你不能为其他人做出善意行为，你的所有技能检定会受到一个惩罚骰，直到躁狂缓解或你远离刺激为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "喜旷症(Agromania)：强烈地倾向于待在开阔空间中。",
                    "喜尖狂(Aichmomania)：痴迷于尖锐或锋利的物体。“你要给我打针吗？太棒了！”你痴迷于尖锐锋利的物体。既可能是对尖锐物体的病态喜爱，也可能是恐惧。尖锐物体包括小刀、叉子、针头、钉子、别针、图钉等等。你可能会强迫性地收集尖锐物体，为了充实自己的收藏甚至会盗窃。或者你在看见尖锐物体时，可能会产生被它刺穿的病态欲望。如果你恐惧尖锐物体，你会千方百计远离它们。你吃饭的时候会用钝头筷子，而不用刀叉。甚至被人用手指戳都会引发你的过度反应。当附近有尖锐物体时，你将无法抗拒强迫反应，所有技能检定受到一个惩罚骰，直到躁狂缓解或你远离刺激为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "恋猫狂(Ailuromania)：近乎病态地对猫友善。",
                    "疼痛癖(Algomania)：痴迷于疼痛。",
                    "喜蒜狂(Alliomania)：痴迷于大蒜。",
                    "乘车癖(Amaxomania)：痴迷于乘坐车辆。",
                    "欣快癖(Amenomania)：不正常地感到喜悦。“我们都要被吃掉了吗？唉呀，别那么难过！凡事要往好处想！”你的症状是非理性的愉悦。不管你的身边发生了什么，你都只会感到高兴、乐观、兴高采烈。即使是面对必死无疑、极端骇人的情况，或者从外界虚空出现无法想象的怪物，你也会欺骗自己，只能看见好的一面。这种欣喜的幻觉会让你对危险视若无物，草率鲁莽，让你身边的人胆战心惊。如果有任何人或事阻止你的愉悦行为，你会极度焦虑，所有技能检定受到一个惩罚骰，直到你远离刺激为止（战斗中不生效）。你若想抵抗幻觉，看到真实的情况，必须通过困难难度的现实检定（困难理智检定）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "喜花狂(Anthomania)：痴迷于花朵。",
                    "计算癖(Arithmomania)：狂热地痴迷于数字。“数字！到处都是数字！”你对数字有痴迷般的执着。你紧张时会强迫性地计数。这可能是特定的动作（掰手指），或者周围的事物（飞机、楼梯、键盘上的按键）。你可能会在阅读时强迫性地先清点出字数再开始理解文意。你也可能会记录自己到目的地到底走了多少步。你经常会觉得为了防止臆想的灾难，必须按一定的次数进行特定的步骤，比如在使用武器之前必须反复清洁它三次等等。如果有任何人或事阻止你的计数行为，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解或你远离刺激为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "消费癖(Asoticamania)：鲁莽冲动地消费。",
                    "隐居癖*(Automania)：过度地热爱独自隐居。(存疑，Automania实际上是恋车癖)",
                    "芭蕾癖(Balletmania)：痴迷于芭蕾舞。",
                    "窃书癖(Biliokleptomania)：无法克制偷窃书籍的冲动。",
                    "恋书狂(Bibliomania)：痴迷于书籍和/或阅读。“小书书真可爱。我全都要！”你对书籍有着病态的痴迷：表现为强迫行为，你会尽一切可能收集书籍。你可能只痴迷于一本书，也可能会收集任何书。有种冲动让你对它们产生强烈的欲望。你收集书籍的行为包括超出财力的购置行为和盗窃等。你在紧张时想要被你的书包围，狂乱地阅读或者强迫性地清点你藏书的数量。你的躁狂会影响你同世界和他人的关系。如果有任何人或事阻止你收集书籍，或者取走了你的藏书，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "磨牙癖(Bruxomania)：无法克制磨牙的冲动。",
                    "灵臆症(Cacodemomania)：病态地坚信自己已被一个邪恶的灵体占据。",
                    "美貌狂(Callomania)：痴迷于自身的美貌。",
                    "地图狂(Cartacoethes)：在何时何处都无法控制查阅地图的冲动。",
                    "跳跃狂(Catapedamania)：痴迷于从高处跳下。",
                    "喜冷症(Cheimatomania)：对寒冷或寒冷的物体的反常喜爱。",
                    "舞蹈狂(Choreomania)：无法控制地起舞或发颤。",
                    "恋床癖(Clinomania)：过度地热爱待在床上。",
                    "恋墓狂(Coimetormania)：痴迷于墓地。",
                    "色彩狂(Coloromania)：痴迷于某种颜色。“黄色！到处都是黄色！”你对某一种颜色产生病态痴迷。你可以决定自己对它是病态喜爱还是恐惧。人们知道颜色会影响心理状态，比如绿色会使人平静，而红色会让人兴奋。这种症状会让你产生异常的想法和冲动，根据你恐惧或偏爱颜色种类的不同让你激动或平静。你会和身穿这种颜色的人时产生交流困难，也会躲避有（或没有）这种颜色的地点。当你遇到自己恐惧的颜色、或附近没有你偏爱的颜色时，你会极度焦虑，所有技能检定受到一个惩罚骰，直到你远离刺激或你（用比如全身涂满颜料等方式）满足了自己为止。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "小丑狂(Coulromania)：痴迷于小丑。",
                    "恐惧狂(Countermania)：执着于经历恐怖的场面。",
                    "杀戮癖(Dacnomania)：痴迷于杀戮。",
                    "魔臆症(Demonomania)：病态地坚信自己已被恶魔附身。",
                    "抓挠癖(Dermatillomania)：执着于抓挠自己的皮肤。",
                    "正义狂(Dikemania)：痴迷于目睹正义被伸张。",
                    "嗜酒狂(Dipsomania)：反常地渴求酒精。",
                    "毛皮狂(Doramania)：痴迷于拥有毛皮。(存疑)",
                    "赠物癖(Doromania)：痴迷于赠送礼物。",
                    "漂泊症(Drapetomania)：执着于逃离。",
                    "漫游癖(Ecdemiomania)：执着于四处漫游。",
                    "自恋狂(Egomania)：近乎病态地以自我为中心或自我崇拜。",
                    "职业狂(Empleomania)：对于工作的无尽病态渴求。",
                    "臆罪症(Enosimania)：病态地坚信自己带有罪孽。",
                    "学识狂(Epistemomania)：痴迷于获取学识。“我必须学到一切知识！”你会产生异常的强迫学习行为。这可能有多种表现形式：废寝忘食地阅读书籍、检查你笔记本里的统计数据、对博学的人无休止地提问等等。你如果不能学习就会十分悔恨或愤怒。你在找不到重要信息时会激越或抑郁。你会用出格的方式获取知识；偷盗、涉险，只有这样才能满足你的欲望。你在紧张时会沉迷于某些知识；你会不停重复某些词语，或者凭记忆写下潦草的笔记才能行动。如果有任何人或事阻止你依躁狂症行事，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解或你远离刺激为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "静止癖(Eremiomania)：执着于保持安静。",
                    "乙醚上瘾(Etheromania)：渴求乙醚。",
                    "求婚狂(Gamomania)：痴迷于进行奇特的求婚。",
                    "狂笑癖(Geliomania)：无法自制地,强迫性的大笑。",
                    "巫术狂(Goetomania)：痴迷于女巫与巫术。",
                    "写作癖(Graphomania)：痴迷于将每一件事写下来。",
                    "裸体狂(Gymnomania)：执着于裸露身体。暴露狂", "妄想狂(Habromania)：近乎病态地充满愉快的妄想(而不顾现实状况如何)。",
                    "蠕虫狂(Helminthomania)：过度地喜爱蠕虫。",
                    "枪械狂(Hoplomania)：痴迷于火器。",
                    "饮水狂(Hydromania)：反常地渴求水分。",
                    "喜鱼癖(Ichthyomania)：痴迷于鱼类。",
                    "图标狂(Iconomania)：痴迷于图标与肖像。",
                    "偶像狂(Idolomania)：痴迷于甚至愿献身于某个偶像。",
                    "信息狂(Infomania)：痴迷于积累各种信息与资讯。",
                    "射击狂(Klazomania)：反常地执着于射击。",
                    "偷窃癖(Kleptomania)：反常地执着于偷窃。“我非得到它不可。”你的症状是荒谬的强迫性盗窃行为。这种强迫症意味着你无法克制自己想要东西的冲动，偷盗东西也不为了个人使用或者获利你的强迫行为可能体现在某一类物品上，也可能体现在任何东西上；包括曲别针、笔、花、勺、铅笔甚至烟灰缸。你在偷盗之前很可能会产生紧张症状，如不安和焦虑等，偷窃之后压力就能得到释放。但是，接踵而来的是负罪感，你可能会向他人坦白自己的罪行。如果有任何人或事阻止你偷盗，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "噪音癖(Ligyromania)：无法自制地执着于制造响亮或刺耳的噪音。“乓！” 你的症状是无法控制的制造噪音的行为，特别是在不合适的场合，如在大家都保持安静的剧院里，或者潜伏在邪教巢穴里的时候。你很可能会偏爱一两种特殊的噪音，也可能会在紧张的时候发出种种奇怪的声响。见到气球时，你会自然产生弄破它的想法。你在噪音环境下，比如用最大音量播放音乐的地方，症状可能会减轻很多。这可能来自对安静的恐惧，使你只能在吵闹的地方才能保持正常思考。如果有任何人或事阻止你制造噪音，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "喜线癖(Linonomania)：痴迷于线绳。",
                    "彩票狂(Lotterymania)：极端地执着于购买彩票。",
                    "抑郁症(Lypemania)：近乎病态的重度抑郁倾向。",
                    "巨石狂(Megalithomania)：当站在石环中或立起的巨石旁时,就会近乎病态地写出各种奇怪的创意。",
                    "旋律狂(Melomania)：痴迷于音乐或一段特定的旋律。",
                    "作诗癖(Metromania)：无法抑制地想要不停作诗。",
                    "憎恨癖(Misomania)：憎恨一切事物,痴迷于憎恨某个事物或团体。",
                    "偏执狂(Monomania)：近乎病态地痴迷与专注某个特定的想法或创意。",
                    "夸大癖(Mythomania)：以一种近乎病态的程度说谎或夸大事物。“不是我。” 你会强迫性地说谎，或是说话时异常夸张。即便你的话会决定自己的生死，你也无法讲出真话。谎言如同铠甲，保护你不受伤害。夸大隐藏了真实的情况，助长了你的自私倾向。你用精妙的谎言把事情讲得天花乱坠，好让人觉得自己非常重要。随着你症状的加重，你的谎言越来越多。你必须记得自己说过的一切谎言，将它抄录下来帮助记忆。你越紧张，谎言和夸大就越荒诞无稽。如果你的谎言被人怀疑对质，你会极度焦虑，所有技能检定受到一个惩罚骰，直到你逃脱或者编造出让人信服的新谎言为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果，可能让你暂时承认事情的真相。",
                    "臆想症(Nosomania)：妄想自己正在被某种臆想出的疾病折磨。“不净！不净！” 你产生了严重的幻觉，认为自己患上了臆想的疾病，或者健康状况极差。你可能在头脑里放大自己已有的症状，也可以臆想出一种疾病。你会证明自己的病情：一瘸一拐地走路、全身缠满绷带等等。你可能相信自己的腿已经瘸了，要让别人用轮椅推着你走；你也可能对自己进行小手术。你会纠缠医生治疗自己；如果医生不听你的话，你甚至会强迫性地盗取药物。如果别人怀疑你的身体状况，你会十分激动且不友善，所有技能检定受到一个惩罚骰，直到离开此地为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "记录癖(Notomania)：执着于记录一切事物(例如摄影)。",
                    "恋名狂(Onomamania)：痴迷于名字(人物的､地点的､事物的)。",
                    "称名癖(Onomatomania)：无法抑制地不断重复某个词语的冲动。“F'tagn! F'tagn! F'tagn!”你无法抗拒自己反复说出某个词的欲望。这个词可能是让你精神崩溃的事件当中最有代表性的一个词。另外，这个词可能没有什么意义，甚至是胡言乱语。你也可能会强迫性地重复别人最近对你说过的话。你只有重复说这些词才能感到安心，也可能会强迫性地重复写这个词。对不理解你、或无意中说了你说的词的人，你会感到非常沮丧或恼怒。如果不能说出这个词，你会极度焦虑，所有技能检定受到一个惩罚骰，直到躁狂缓解为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "剔指癖(Onychotillomania)：执着于剔指甲。",
                    "恋食癖(Opsomania)：对某种食物的病态热爱。",
                    "抱怨癖(Paramania)：一种在抱怨时产生的近乎病态的愉悦感。",
                    "面具狂(Personamania)：执着于佩戴面具。",
                    "幽灵狂(Phasmomania)：痴迷于幽灵。",
                    "谋杀癖(Phonomania)：病态的谋杀倾向。",
                    "渴光癖(Photomania)：对光的病态渴求。",
                    "背德癖(Planomania)：病态地渴求违背社会道德。",
                    "求财癖(Plutomania)：对财富的强迫性的渴望。",
                    "欺骗狂(Pseudomania)：无法抑制的执着于撒谎。",
                    "纵火狂(Pyromania)：执着于纵火。“烧光它！”你对火焰特别着迷，还会强迫性地点火。火焰会净化一切，而你是它的工具，净化这个黑暗的世界。你的能力是用救赎和赦免的赤红火舌，改变这个世界。你的着迷可能来源于地狱之火的信仰——火焰会将原罪焚烧成灰。或者你可能认为混沌才是万物的主宰，你放出火焰会令混沌得以自由。只要附近有火焰你就会被吸引，你盯着它燃烧的焰心，忘记时间的流逝。如果可能的话，你会随身携带生火工具。你紧张的时候会想点燃物品，如果做不到，你会极度焦虑，所有技能检定受到一个惩罚骰，直到强迫行为得到满足或你离开为止（战斗中不生效）。你可以通过一次困难难度的理智检定抑制自己的冲动。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "提问狂(Question-Asking Mania)：执着于提问。“这是什么？”你有强迫自己提问的冲动。不论何时何地，你都无法控制自己问问题。大多数问题都是直接对别人发问；不过有时你也会自问自答。你见到权威会发问，见到店主会发问，见到教团首脑也会发问，不一而足。你会对重要的事情特别关心，更可能对毫无疑问的显明事实一遍遍地发问。如果没有人回答出你想要的答案，你会大哭或发怒。如果有人或事阻止你提问，你会极度焦虑，所有技能检定受到一个惩罚骰，直到你满足欲望为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "挖鼻癖(Rhinotillexomania)：执着于挖鼻子。",
                    "涂鸦癖(Scribbleomania)：沉迷于涂鸦。",
                    "列车狂(Siderodromomania)：认为火车或类似的依靠轨道交通的旅行方式充满魅力。",
                    "臆智症(Sophomania)：臆想自己拥有难以置信的智慧。",
                    "科技狂(Technomania)：痴迷于新的科技。",
                    "臆咒狂(Thanatomania)：坚信自己已被某种死亡魔法所诅咒。",
                    "臆神狂(Theomania)：坚信自己是一位神灵。",
                    "抓挠癖(Titillomaniac)：抓挠自己的强迫倾向。“该死的疹子，出去！出去！” 你的症状是病态的搔痒行为。你感觉必须反复抓挠自己的皮肤，甚至会因此受到伤害。你最可能感觉你的皮肤上有什么东西或者得了什么奇怪的病。在紧张时或你独处思考时，情绪会突然爆发。虽然全身上下的皮肤都可能成为你抓挠的目标，但最常见的目标是面部（根据 KP 裁定，长期抓搔会降低你角色的 APP）。如果有人或事阻止你搔痒，你会极度焦虑，所有技能检定受到一个惩罚骰，直到你满足欲望为止（战斗中不生效）。KP 也可能根据情形或角色的状况改变某些技能检定的难度等级。成功使用精神分析技能可以让你暂时克服躁狂和它的严重不良效果。",
                    "手术狂(Tomomania)：对进行手术的不正常爱好。",
                    "拔毛癖(Trichotillomania)：执着于拔下自己的头发。",
                    "臆盲症(Typhlomania)：病理性的失明。",
                    "嗜外狂(Xenomania)：痴迷于异国的事物。",
                    "喜兽癖(Zoomania)：对待动物的态度近乎疯狂地友好｡"]
        hysteria_list = [
    f"竭嘶底里：调查员表现出大笑，哭泣，嘶吼，害怕等的极端情绪表现，持续{random.randint(1, 10)}轮。你看到、听到、理解到的东西，人类有限的头脑实在无法承受。你立刻进入癔症状态，除了屈服于疯狂以外什么也做不了。",
    f"竭嘶底里-真有趣：真有趣——仿佛被开了一个大玩笑，你会狂笑不止。调查员表现出大笑，哭泣，嘶吼，害怕等的极端情绪表现，持续{random.randint(1,10)}轮。你看到、听到、理解到的东西，人类有限的头脑实在无法承受。你立刻进入癔症状态，除了屈服于疯狂以外什么也做不了。",
    f"竭嘶底里-真失败：真失败——一切都化作泡影，你会痛哭不止调查员表现出大笑，哭泣，嘶吼，害怕等的极端情绪表现，持续{random.randint(1,10)}轮。你看到、听到、理解到的东西，人类有限的头脑实在无法承受。你立刻进入癔症状态，除了屈服于疯狂以外什么也做不了。",
    f"竭嘶底里-真可怕：真可怕——没有一点点防备，你会尖叫不止调查员表现出大笑，哭泣，嘶吼，害怕等的极端情绪表现，持续{random.randint(1,10)}轮。你看到、听到、理解到的东西，人类有限的头脑实在无法承受。你立刻进入癔症状态，除了屈服于疯狂以外什么也做不了。",
    f"竭嘶底里-它进去了！：它进去了！——有“东西”寄生了你，你必须把它从身体里弄出来（切掉有毛病的肢体、立即进行手术、酗酒、漂白，任何能用来清洁你身体内部的方法）调查员表现出大笑，哭泣，嘶吼，害怕等的极端情绪表现，持续{random.randint(1,10)}轮。你看到、听到、理解到的东西，人类有限的头脑实在无法承受。你立刻进入癔症状态，除了屈服于疯狂以外什么也做不了。"]
        disable_list = [f"假性残疾-目盲：目盲——你的眼前突然一黑，什么也看不见了！调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。",f"假性残疾-耳聋：耳聋——你听不到声音了，你只能辨认出低语和呻吟。调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。", f"假性残疾-失声：失声——你张开嘴，却什么也说不出！调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。", f"假性残疾-失触：触觉失灵——你没有任何触觉，包括痛觉（你受到的伤害全部由KP秘密投掷）。调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。", f"假性残疾-手指失灵：手指失灵——你手拿的东西掉到地上，你的手不受控制，不能再拿取任何东西。调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。", f"假性残疾-手指失灵：手指失灵——你摔倒在地。你不能站立，只能用手支撑身体，在地上拖行（MOV下降到1）调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。",f"假性残疾：调查员陷入了心理性的失明，失聪或躯体缺失感中，持续{random.randint(1,10)}轮。"]
        madness_temp_list = [f"失忆：遗忘一条个人推理信息。调查员会发现自己只记得最后身处的安全地点，却没有任何来到这里的记忆。你无法解释自己为何来这里，要做什么。例如，调查员前一刻还在家中吃着早饭，下一刻就已经直面着不知名的怪物。这将会持续{random.randint(1,10)}轮。",
    f"{random.choice(disable_list)}",
    f"极端信念驱使：刚刚发生的事情有如晴天霹雳，你突然顿悟了，你的信仰或者信念得到了极大的加强。这次顿悟会将你的思想信念或信仰变得极端、狂热，达到远超正常水准的疯狂状态。立即根据背景进行相应的扮演。KP 应当查看调查员背景当中的思想信念条目。调查员痴迷于其中最恰当的一项，会表现得非常乖张。如果这个条目里什么都没写，KP可以选取任何适合的内容。你在{random.randint(1,10)}轮以后恢复理性并平静下来。",
    f"暴力倾向：调查员陷入了六亲不认的暴力行为中，对周围的敌人与友方进行着无差别的攻击，持续{random.randint(1,10)}轮。每轮你要投掷1D6决定谁会成为你疯狂进攻的目标：1 ～ 2：你周围的实物（墙、门、物体等）。3 ～ 4：离你最近的敌人（人或非人）。5 ～ 6：离你最近的朋友。",
    f"{random.choice(hysteria_list)}",
    f"偏执：调查员陷入了严重的偏执妄想之中，持续{random.randint(1,10)}轮。所有人都想要伤害他们；没有人可以信任；他们正在被监视；有人背叛了他们；他们见到的都是诡计。每个人都试图逮住你——即便是所谓那些盟友伙伴也不例外！你会强迫性地同你的朋友和盟友，“真正的敌人”，变得敌对。",
    f"人际依赖：调查员认错了人。守秘人适当参考调查员的背景中重要之人的条目，调查员因为一些原因而将他人误认为了他重要的人，考虑他们的关系性质，调查员会据此行动，持续{random.randint(1,10)}轮。你突然发现，有个对你来说很重要的人出现在了这里——他为什么会在这里并不重要，重要的是他已经来了。不论别人怎么说、怎么做，你都不会相信这个人其实并非你的重要之人。",
    f"昏厥：调查员当场昏倒，并需要{random.randint(1,10)}轮才能苏醒，没有任何人或事可以唤醒你。事情超出了常人的承受能力，你的头脑过载，晕倒在地，坠入遗忘和无知的黑暗之中。你立刻倒地并失去意识。",
    f"逃避行为：调查员会用任何的手段试图逃离现在所处的位置，即使这意味着开走唯一一辆交通工具并将其它人抛诸脑后，调查员会试图逃离{random.randint(1,10)}轮。",
    f"仓皇逃窜：你会强迫性地远离当前位置。你可以不择手段，即使要推倒前面的人、甩下后面的人，你也会做。你会持续逃窜{random.randint(1,10)}轮，然后累倒在地。进行一次困难难度的CON检定，失败表示你昏过去了。",
    f"{random.choice(fear_list)}：恐惧：调查员患上此恐惧症，或者由守秘人选择，来从恐惧症状表中选择一个恐惧源，就算这一恐惧源并不存在，调查员也会在接下来的{random.randint(1,10)}轮内想象它存在。",
    f"{random.choice(mad_list)}：躁狂：调查员患上此躁狂症，或者由守秘人选择，来从躁狂症状表中选择一个躁狂的诱因，在接下来的{random.randint(1,10)}轮内，调查员会渴望沉溺于他新的躁狂症中。"]
        madness_sum_list = [f"失忆：遗忘一条个人推理信息。回过神来，调查员们发现自己身处一个陌生的地方，你却不记得过去的{random.randint(5,10)}小时发生了什么，忘记了自己是谁，而且无法回忆起自己是怎样来到这里的。{random.randint(1,10)}小时之后（或KP认为合适的时间）后，记忆会随时间缓缓恢复。你只知道你现在身上满是伤痕和瘀青，衣服上还有干涸的血迹。",
      f"被窃：调查员在{random.randint(1,10)}小时后恢复清醒，发觉自己被盗，身体毫发无损。如果调查员携带着宝贵之物（见调查员背景），做幸运检定来决定其是否被盗。其他所有贵重品无需检定自动消失。",
      f"遍体鳞伤：调查员在{random.randint(1,10)}小时后恢复清醒，发现自己身上满是拳痕和瘀伤。生命值减少到疯狂前的一半，但这不会造成重伤。调查员没有被窃。这种伤害从何而来由守秘人决定。",
      f"暴力倾向：调查员陷入强烈的暴力与破坏欲之中。当调查员回过神来时，他们做过什么可能很明显，可能被他们记住，也可能并不。调查员对谁或何物施以暴力，他们是杀人还是仅仅造成了伤害，由守秘人决定。可减少{random.randint(1,6)}HP。",
      "极端信念：查看调查员背景中的思想信念，调查员会采取极端和疯狂的表现手段展示他们的思想信念之一。比如一个信教者可能之后被发现正在地铁上高声布道。",
      f"寻找重要之人：考虑调查员背景中的重要之人，及其重要的原因。在{random.randint(1,10)}小时或更久的时间中，调查员将调不择手段去寻找这个人，并不顾一切地接近那个人，按照他们之间的关系做出行动。",
      "被收容：调查员在精神病院病房或警察局牢房中回过神来，他们可能会慢慢回想起导致自己被关在这里的事情。你醒来时发现自己手腕上戴着镣铐。你看起来是独自被关在一间屋子里了。屋子里没有窗户。门上有个带结实铁栅栏的小窗口。这时响起了门打开的声音，有人说道：“现在我们能正常说话了吗？”根据调查员疯狂发作的诱因，KP应当决定调查员醒来时身处位置是拘留所、医院病房还是疯人院看护室。",
      "逃避行为：调查员恢复清醒时发现自己在很远的地方，也许迷失在荒郊野岭，或是在驶向远方的列车或长途汽车上。",
      f"{random.choice(fear_list)}：恐惧：调查员患上此恐惧症，或由守秘人选择一个。调查员在{random.randint(1,10)}小时后回过神来，并开始为避开恐惧源而采取任何措施。",
      f"{random.choice(mad_list)}：躁狂：调查员患上此躁狂症，或由守秘人选择一个。调查员会在{random.randint(1,10)}小时后恢复理智。在这次疯狂发作中，调查员将完全沉浸于其新的躁狂症状。这对旁人来说是否明显取决于守秘人和玩家。"]
        madness_change = ["形象描述：适用的条目包括：“目光凶暴”，“眼神涣散”，“厌世”或者“不修边幅”.",
    "思想与信念：一项中性的标签例如“信仰”可能会变化的更加极端与异常，就像是“不信者必将遭受苦难”，也可以增加一条新的符合情景的条目，例如“痴迷于击溃克苏鲁信徒”。",
    "重要之人：一个新的名字也许会与理由一起作为标签加入，例如：“追逐杜尔伯特·斯密史，至死方休”或者“自在天的化身——罗宾·普尔”。",
    "意义非凡之地：目前所在地点变的具有重大意义，或调查员因为理性或非理性的理由对某地过分固着。前者可能是雨林中邪教徒的寺庙；后者可能是无法抵挡地想要前往雅园（著名流行音乐歌手“猫王”埃尔维斯的故居）。",
    "宝贵之物：当心智被疯狂破坏时，调查员很可能遗失财产、任何财产都可以被抹去，或记做已遗失。调查员也可能取得新的财产，并赋予它重要意义。",
    "特质：特质可以被抹去，或修改为更合适的一项，比如：“混混”，“瘾君子”，“心浮气躁”，“大嗓门”，“百无禁忌”。",
    "创伤&疤痕：这通常作为重伤的后果被修改。",
    "恐惧症和躁狂症：这部分通常是疯狂发作的骰点结果。",
    "神话典籍、法术和魔法物品：这些道具可能在一气之下遗失或被摧毁。调查员可能不由自主地咏唱他们所知的法术，激活魔法道具，或者研读之前避之不及的神话典籍。",
    f"第三类接触：调查员的克苏鲁神话技能增加{random.randint(1,5)}点。调查员所遭遇到的怪物与神灵都应该被记录，不论它们是否造成了疯狂。这里也可以用来记录各种神话存在所造成的理智值损失（见习惯恐惧）。"]
        if "NPC_name" in role:
            role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
        else:
            role_Chart_detail = role_Chart.get(role, {}).copy()
        current_SAN = role_Chart_detail.get("SAN")
        start_SAN = role_Chart_detail.get("意志")
        max_SAN = role_Chart_detail.get("#SAN")
        if role not in self.SAN_:
            self.SAN_[role] = 0
        if role not in self.SAN:
            #self.SAN[role] = int(start_SAN)
            self.SAN[role] = 0
        #self.SAN_loss[role] = self.SAN[role] - int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip())
        self.SAN_loss[role] = self.SAN[role]
        if self.SAN_loss[role] < 0:
            #self.SAN[role] -= self.SAN_loss[role]
            self.SAN[role] = 0
            self.SAN_loss[role] = self.SAN[role]
        if self.SAN_loss[role] >= int(round(max_SAN * 0.2, 0)) and "不定性疯狂：" not in self.role_values_entry[role].get("1.0", tk.END):
            madness_temp = random.choice(madness_temp_list)
            madness_sum = random.choice(madness_sum_list)
            change = random.choice(madness_change)
            madness_temp_ = madness_temp.split("：")[0]
            madness_sum_ = madness_sum.split("：")[0]
            change_ = change.split("：")[0]
            if "===异变===" not in self.role_values_entry[role].get("1.0", tk.END):
                self.role_values_entry[role].insert(tk.END, f"\n===异变===\n")
            else:
                pass
            for index, line in enumerate(self.role_values_entry[role].get("1.0", tk.END).split("\n")):
                if line == "===状态===":
                    self.role_values_entry[role].insert(f"{index+2}.0", f"不定性疯狂：{madness_temp_}(即时)/{madness_sum_}(总结)\n")
                    self.search_and_delete_insert_symbol()
                    self.chat_log.insert(tk.END,
                                         f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n[陷入疯狂]【{self.role_entries_name[role]}】陷入了【不定性疯狂】：{madness_temp_}(即时)/{madness_sum_}(总结)！！！【{self.role_entries_name[role]}】的[{change_}]发生了变化！\n\n')
                    self.chat_log.yview(tk.END)
                    self.role_entries[role].insert(tk.END, f'【即时症状】{madness_temp}\n【总结症状】{madness_sum}\n【异变】{change}\n\n')
                if line == "===异变===":
                    self.role_values_entry[role].insert(f"{index+3}.0", f"{change_}\n")
                    break
            self.reset_san_cal_status(role)
            #print("不定性疯狂：")
        elif self.SAN_[role] >= 5 and "临时疯狂(" not in self.role_values_entry[role].get("1.0", tk.END):
            INT = role_Chart_detail.get("智力")
            ran = random.randint(1, 100)
            if ran > INT:
                self.jrrp_record(role, f"D100={ran}/{INT}：失败", tag="san_cal_status")
                self.search_and_delete_insert_symbol()
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的[智力]检定失败(D100={ran}/{INT})，没有陷入【临时疯狂】！\n\n')
                self.chat_log.yview(tk.END)
                return
            else:
                self.jrrp_record(role, f"D100={ran}/{INT}：成功", tag="san_cal_status")
                madness_temp = random.choice(madness_temp_list)
                madness_sum = random.choice(madness_sum_list)
                change = random.choice(madness_change)
                madness_temp_ = madness_temp.split("：")[0]
                madness_sum_ = madness_sum.split("：")[0]
                change_ = change.split("：")[0]
                hours = random.randint(1, 10)
                if "===异变===" not in self.role_values_entry[role].get("1.0", tk.END):
                    self.role_values_entry[role].insert(tk.END, f"\n===异变===\n")
                else:
                    pass
                for index, line in enumerate(self.role_values_entry[role].get("1.0", tk.END).split("\n")):
                    if line == "===状态===":
                        self.role_values_entry[role].insert(f"{index+2}.0", f"临时疯狂({hours}/{hours}h)：{madness_temp_}(即时)/{madness_sum_}(总结)\n")
                        self.search_and_delete_insert_symbol()
                        self.chat_log.insert(tk.END,
                                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n[陷入疯狂]【{self.role_entries_name[role]}】的[智力]检定成功(D100={ran}/{INT})，陷入了【临时疯狂】：{madness_temp_}(即时)/{madness_sum_}(总结)，潜在期{hours}小时！！！【{self.role_entries_name[role]}】的[{change_}]发生了变化！\n\n')
                        self.chat_log.yview(tk.END)
                        self.role_entries[role].insert(tk.END, f'【即时症状】{madness_temp}\n【总结症状】{madness_sum}\n【异变】{change}\n\n')
                    if line == "===异变===":
                        self.role_values_entry[role].insert(f"{index + 3}.0", f"{change_}\n")
                        break
            #print("临时疯狂：")
        elif role in self.last_SAN:
            diff = self.SAN[role] - self.last_SAN[role]
            self.last_SAN[role] = self.SAN[role]
            if self.SAN[role] != 0 and diff > 0 and ("不定性疯狂：" in self.role_values_entry[role].get("1.0", tk.END) or "临时疯狂(" in self.role_values_entry[role].get("1.0", tk.END)):
                self.search_and_delete_insert_symbol()
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n[陷入疯狂]【{self.role_entries_name[role]}】的疯狂再次发作！\n\n')
        #print(self.SAN[role])

    def reset_san_cal_status(self, role):
        if role == "all":
            for roles in self.roles:
                self.SAN[roles] = 0
        else:
            #self.SAN[role] = int(self.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip())
            self.SAN[role] = 0

    def update_jrrp(self, role):
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
        else:
            luck_dic = self.luck_by_name[role].copy()
        if luck_dic["_success"] + luck_dic["_fail"] > 0:
            luck_dic["_luck"] = luck_dic["_success"] / (luck_dic["_success"] + luck_dic["_fail"])
            luck_dic["_fumble_rate"] = luck_dic["_fumble"] / (luck_dic["_success"] + luck_dic["_fail"])
            luck_dic["_critical_rate"] = luck_dic["_critical"] / (luck_dic["_success"] + luck_dic["_fail"])
        luck_dic["_luck_exp"] = np.mean(luck_dic["_luck_exp_value"]) / 100
        if luck_dic["_critical"] > 0 or luck_dic["_fumble"] > 0:
            luck_dic["_luck_weight"] = luck_dic["_luck"] + ((luck_dic["_critical"] - luck_dic["_fumble"]) / (
                    luck_dic["_critical"] + luck_dic["_fumble"])) * 0.1
        else:
            luck_dic["_luck_weight"] = luck_dic["_luck"]
        for key, item in luck_dic.items():
            if "_value" not in key:
                luck_dic[key] = round(item, 4)
        if luck_dic:
            if role in self.role_entries_name:
                self.luck_by_name[self.role_entries_name[role]] = luck_dic
            else:
                self.luck_by_name[role] = luck_dic

    def jrrp(self, role):
        self.update_jrrp(role)
        self.search_and_delete_insert_symbol()
        name = ""
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
            name = self.role_entries_name[role]
        else:
            luck_dic = self.luck_by_name[role].copy()
            name = role
        # print(luck_dic)
        rank = 0
        rank_all = 0
        rank_weight = 0
        rank_jrrp = 0
        for role_, dic in self.luck_by_name.items():
            if dic["_d100"] > 0 and (dic["_success"] > 0 or dic["_fail"] > 0):
                rank_all += 1
                rank += 1
                rank_weight += 1
                if role_ != name and luck_dic["_luck"] > dic["_luck"]:
                    rank -= 1
                if role_ != name and luck_dic["_luck_weight"] > dic["_luck_weight"]:
                    rank_weight -= 1
        rank_percentage = round(rank / rank_all * 100, 2)
        rank_weight_percentage = round(rank_weight / rank_all * 100, 2)
        d100_mean = round(np.mean(luck_dic["_d100_value"]), 2)
        d100_standard = round(np.std(luck_dic["_d100_value"]), 2)
        self.jrrp_value = {}
        value_list = []
        for r, dict in self.luck_by_name.items():
            if dict["_luck_exp"] != 0:
                self.jrrp_value[r] = int(round(dict["_luck"] / dict["_luck_exp"] * 100, 0)) - 100
        for r, value in self.jrrp_value.items():
            value_list.append(value)
        min_value = min(value_list)  # 0
        max_value = max(value_list)  # 100

        def map_to_range(value):
            return int(round(((value - min_value) / (max_value - min_value)) * 100, 0))

        self.jrrp_value = {key: map_to_range(self.jrrp_value[key]) for key in self.jrrp_value.keys()}
        for r, value in self.jrrp_value.items():
            rank_jrrp += 1
            if r != name and self.jrrp_value[name] > value:
                rank_jrrp -= 1
        rank_jrrp_percentage = round(rank_jrrp / rank_all * 100, 2)

        self.chat_log.insert(tk.END,
                             f'掷骰统计 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{name}】今日人品: {self.jrrp_value[name]} ')
        self.role_entries[role].delete("1.0", tk.END)
        self.role_entries[role].insert(tk.END, f'今日人品: {self.jrrp_value[name]}')
        if rank_all == 1:
            content_string = f'人品排名: 独孤求败...\n'
        else:
            content_string = f'人品排名: {rank_jrrp}/{rank_all}[{rank_jrrp_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'成功率: {round(luck_dic["_luck"] * 100, 2)}%→{round(luck_dic["_luck_exp"] * 100, 2)}%[{luck_dic["_success"]}/{luck_dic["_success"] + luck_dic["_fail"]}]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        if rank_all == 1:
            content_string = f'排名: 独孤求败...\n'
        else:
            content_string = f'排名: {rank}/{rank_all}[{rank_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'大成功率: {round(luck_dic["_critical_rate"] * 100, 2)}%({luck_dic["_critical"]})\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'大失败率: {round(luck_dic["_fumble_rate"] * 100, 2)}%({luck_dic["_fumble"]})\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'加权成功率: {round(luck_dic["_luck_weight"] * 100, 2)}%\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        if rank_all == 1:
            content_string = f'加权排名: 独孤求败...\n'
        else:
            content_string = f'加权排名: {rank_weight}/{rank_all}[{rank_weight_percentage}%]\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'D100掷骰次数: {luck_dic["_d100"]}\n'
        self.chat_log.insert(tk.END, f'{content_string}')
        content_string = f'D100掷骰统计: {d100_mean}→50.50[{abs(round(d100_standard - 28.58, 2))}]\n'
        self.chat_log.insert(tk.END, f'{content_string}\n')
        self.chat_log.yview(tk.END)

    def jrrp_record(self, role, content, tag):
        #print(content)
        if "###" in content and "1d100" in content.lower():
            print(content)
            conexpress = content.split("###")[1]
            content = content.split("###")[0]
        else:
            conexpress = ""
        if "\n\n[成长检定]" in content:
            self.jrrp_record(role, content.split("\n\n[成长检定]")[1], "growth")
            content = content.split("\n\n[成长检定]")[0]
        if role in self.role_entries_name:
            luck_dic = self.luck_by_name[self.role_entries_name[role]].copy()
        else:
            if "NPC_name" in role:
                return
            luck_dic = self.luck_by_name[role].copy()
        if tag == "silent":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        if len(content) > 0:
                            luck_dic["_d100"] += 1
                            luck_dic["_d100_value"].append(int(content))
                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "all":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        luck_dic["_d100"] += 1
                        luck_dic["_d100_value"].append(int(content))
                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        if "=" in exp_number:
                            exp_number = exp_number.split("=")[0]
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "solo":
            if "成功" in content or "失败" in content or "d100" in conexpress or "D100" in conexpress or "San Check" in content:
                if "成功" not in content and "失败" not in content:
                    if "=" in content:
                        _split = content.split("=")[0]
                        if "+" in _split:
                            _split = _split.split("+")
                        elif "-" in _split:
                            _split = _split.split("-")
                        elif "*" in _split:
                            _split = _split.split("*")
                        else:
                            _split = _split.split("/")
                        for n in _split:
                            luck_dic["_d100_value"].append(int(n))
                            luck_dic["_d100"] += 1
                    else:
                        luck_dic["_d100"] += 1
                        print(content)
                        luck_dic["_d100_value"].append(int(content))

                else:
                    luck_dic["_d100"] += 1
                    if ":" in content:
                        _split = content.split(":")
                    elif "：" in content:
                        _split = content.split("：")
                    number = _split[0]
                    exp_number = number.split("/")[1]  # 可能有多个
                    if ", " in exp_number:
                        exp_number = exp_number.replace("[", "").replace("]", "")
                        exp_number = exp_number.split(", ")
                        for n in exp_number:
                            if ":" in n:
                                luck_dic["_luck_exp_value"].append(int(n.split(":")[0]))
                            else:
                                luck_dic["_luck_exp_value"].append(int(n))
                    else:
                        if "=" in exp_number:
                            exp_number = exp_number.split("=")[0]
                        luck_dic["_luck_exp_value"].append(int(exp_number))
                    number = number.split("/")[0]  # 只有一个
                    luck_dic["_d100_value"].append(int(number))
                    comment = _split[1]  # 只有一个
                    if "成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_success"] += comment.count("成功")
                        else:
                            luck_dic["_success"] += 1
                    else:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fail"] += comment.count("失败")
                        else:
                            luck_dic["_fail"] += 1
                    if "大成功" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_critical"] += comment.count("大成功")
                        else:
                            luck_dic["_critical"] += 1
                    elif "大失败" in comment:
                        if isinstance(exp_number, list) and len(exp_number) > 1:
                            luck_dic["_fumble"] += comment.count("大失败")
                        else:
                            luck_dic["_fumble"] += 1
        elif tag == "growth":
            content = content.split("1D100=")[1]
            comment = content.split(")")[1]
            content = content.split(")")[0]
            number = content.split("/")[0]  # 只有一个
            luck_dic["_d100_value"].append(int(number))
            exp_number = content.split("/")[1]  # 只有一个
            luck_dic["_luck_exp_value"].append(int(100 - int(exp_number)))
            if "败北" in comment:
                luck_dic["_fail"] += 1
            else:
                luck_dic["_success"] += 1
        elif tag == "san_cal_status":
            luck_dic["_d100"] += 1
            number = content.split("：")[0].split("=")[1]
            exp_number = number.split("/")[1]  # 可能有多个
            luck_dic["_luck_exp_value"].append(int(exp_number))
            number = number.split("/")[0]  # 只有一个
            luck_dic["_d100_value"].append(int(number))
            comment = content.split("：")[1]  # 只有一个
            if "成功" in comment:
                if isinstance(exp_number, list) and len(exp_number) > 1:
                    luck_dic["_success"] += comment.count("成功")
                else:
                    luck_dic["_success"] += 1
            else:
                if isinstance(exp_number, list) and len(exp_number) > 1:
                    luck_dic["_fail"] += comment.count("失败")
                else:
                    luck_dic["_fail"] += 1
        else:
            print(content)
        self.update_jrrp(role)
        if luck_dic:
            if role in self.role_entries_name:
                self.luck_by_name[self.role_entries_name[role]] = luck_dic
            else:
                self.luck_by_name[role] = luck_dic

    def drawcard(self, message, role):
        self.search_and_delete_insert_symbol()
        message = message.replace("alldraw", "draw").replace("drawall", "draw")
        if "drawself" in message or "selfdraw" in message:
            message = message.replace("self", "")
            num = 1
            if "*" in message:
                num = int(message.split("*")[1])
                message = message.split("*")[0]
            cardname = message.replace("drawself", "draw").replace("selfdraw", "draw").replace(".draw_", "").replace(
                "。draw_", "").replace(".draw", "").replace("。draw", "")
            cardname = cardname.replace("?", "").replace("？", "").strip()
            Cards_now = load_CardDeck(cardname)
            # self.role_entries[role].delete("1.0", tk.END)
            if Cards_now:
                result_ = ""
                while num > 0:
                    if "?" in message or "？" in message:
                        if role not in Cards_list_by_role:
                            Cards_list_by_role[role] = {}
                        if cardname not in Cards_list_by_role[role]:
                            Cards_list_by_role[role][cardname] = Cards_now
                        elif len(Cards_list_by_role[role][cardname]) == 0:
                            Cards_list_by_role[role][cardname] = Cards_now
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_list_by_role[role][cardname])
                            Cards_list_by_role[role][cardname].remove(result)
                            if num == 1:
                                self.role_entries[role].insert(tk.END,
                                                               f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】的不放回牌堆[{cardname}]还余{len(Cards_list_by_role[role][cardname])}张卡。\n\n')
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_list_by_role[role][cardname][cardname])
                            if len(Cards_list_by_role[role][cardname][cardname]) != 1:
                                Cards_list_by_role[role][cardname][cardname].remove(result)
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if num == 1:
                                self.role_entries[role].insert(tk.END,
                                                               f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】的不放回牌堆[{cardname}]还余{len(Cards_list_by_role[role][cardname][cardname])}张卡。\n\n')
                                if len(Cards_list_by_role[role][cardname][cardname]) == 0:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'已自动补充牌堆。\n')
                                    Cards_list_by_role[role][cardname] = load_CardDeck(cardname)[cardname]
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"
                        cardname = cardname + "(不放回)"
                    else:
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_now)
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_now[cardname])
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"

                    if "draw_" in message or "draw_" in message:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n", "")
                            result = f"\n{result}".replace("\n\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的暗抽。\n\n')
                            self.role_entries[role].insert(tk.END,
                                                           f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的抽取结果：{result}\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    else:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "\n")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在自己牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    num -= 1
            else:
                print("未找到牌堆或牌堆为空！")
                os.startfile("CardDecks")
            return
        else:
            num = 1
            if "*" in message:
                num = int(message.split("*")[1])
                message = message.split("*")[0]
            cardname = message.replace(".draw_", "").replace("。draw_", "").replace(".draw", "").replace("。draw", "")
            cardname = cardname.replace("?", "").replace("？", "").strip()
            Cards_now = load_CardDeck(cardname)
            # self.role_entries[role].delete("1.0", tk.END)
            if Cards_now:
                result_ = ""
                while num > 0:
                    if "?" in message or "？" in message:
                        if cardname not in Cards_list:
                            Cards_list[cardname] = Cards_now
                        elif len(Cards_list[cardname]) == 0:
                            Cards_list[cardname] = Cards_now
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_list[cardname])
                            Cards_list[cardname].remove(result)
                            if num == 1:
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n不放回公有牌堆[{cardname}]还余{len(Cards_list[cardname])}张卡。\n\n')
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_list[cardname][cardname])
                            if len(Cards_list[cardname][cardname]) != 1:
                                Cards_list[cardname][cardname].remove(result)
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if num == 1:
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n不放回公有牌堆[{cardname}]还余{len(Cards_list[cardname][cardname])}张卡。\n\n')
                                if len(Cards_list[cardname][cardname]) == 0:
                                    self.role_entries[role].insert(tk.END,
                                                                   f'已自动补充牌堆。\n')
                                    Cards_list[cardname][cardname] = load_CardDeck(cardname)[cardname]
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"
                        cardname = cardname + "(不放回)"
                    else:
                        if isinstance(Cards_now, list):
                            result = random.choice(Cards_now)
                        elif isinstance(Cards_now, dict):
                            result = random.choice(Cards_now[cardname])
                            matches = re.findall(r'\{%([^%]+)%\}', result)
                            for m in matches:
                                result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            while "{%" in result:
                                result = result.replace("%}", "}")
                                result = result.replace("}", "%}")
                                matches = re.findall(r'\{%([^%]+)%\}', result)
                                for m in matches:
                                    result = result.replace("{%" + m + "%}", random.choice(Cards_now[m]))
                            if "{" in result or "%" in result:
                                result = result + "\n> WAR: 请检查JSON牌堆格式！引用应为{%string%}，JSON文件名应与抽取名相同！"
                        else:
                            print("my_var 不是列表也不是字典")
                            result = "ERR:请检查JSON牌堆格式！"

                    if "draw_" in message or "draw_" in message:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "")
                            result = f"\n{result}".replace("\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n这是一次【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的暗抽。\n\n')
                            self.role_entries[role].insert(tk.END,
                                                           f'\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    else:
                        if num == 1:
                            if result_ != "":
                                result_ = result_ + f"[{num}]" + result
                                result = result_
                            result = f"\n{result}".replace("\n\n\n", "")
                            result = f"\n{result}".replace("\n\n", "")
                            self.chat_log.insert(tk.END,
                                                 f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role].replace("【", "[").replace("】", "]")}】在公有牌堆[{cardname}]的抽取结果：{result}\n\n')
                            self.chat_log.yview(tk.END)
                        else:
                            result_ = result_ + f"[{num}]" + result + "\n"
                    num -= 1
            else:
                print("未找到牌堆或牌堆为空！")
                os.startfile("CardDecks")
            return

    def parse_input_skill(self, input_string):
        skills = {}
        # 使用正则表达式从输入字符串中提取技能和值的组合
        if " " in input_string:
            input_string_list = input_string.split(" ")
            for input_string_ in input_string_list:
                if "@" in input_string_:
                    input_string_ = input_string_[1:]
                    input_string_ = input_string_.split("@")
                    skill = input_string_[0].strip()
                    modifier = input_string_[1].strip()
                    #print(skill)
                    #print(modifier)
                    skill_name = "#" + skill.strip().upper()
                    skill_value = modifier
                    skills[skill_name] = skill_value
                else:
                    pattern = re.compile(r'([\u4e00-\u9fa5a-zA-Z\s]+)(\d+)')
                    matches = pattern.findall(input_string_)
                    for match in matches:
                        skill_name = match[0].strip().upper()
                        skill_value = int(match[1])
                        skills[skill_name] = skill_value
                        #print(skill_name)
                        #print(skill_value)
        else:
            if "@" in input_string:
                input_string = input_string[1:]
                input_string = input_string.split("@")
                skill = input_string[0].strip()
                modifier = input_string[1].strip()
                #print(skill)
                #print(modifier)
                skill_name = "#" + skill.strip().upper()
                skill_value = modifier
                skills[skill_name] = skill_value
            else:
                pattern = re.compile(r'([\u4e00-\u9fa5a-zA-Z\s]+)(\d+)')
                matches = pattern.findall(input_string)
                for match in matches:
                    skill_name = match[0].strip().upper()
                    skill_value = int(match[1])
                    skills[skill_name] = skill_value
        #print(skills)
        return skills

    def update_skills(self, old_dict, new_dict):
        skill_dict = []
        for skill, value in new_dict.items():
            skill_dict.append(skill)
            if skill in old_dict:
                # 如果技能已存在于旧字典中，更新数值
                old_dict[skill] = value
            else:
                # 如果技能不存在于旧字典中，将其添加到旧字典
                old_dict[skill] = value
        if (old_dict["SIZ"] == 0) and (old_dict["体型"] != 0) and (old_dict["体型"] != "SIZ"):
            old_dict["EDU"] = old_dict["教育"]
            old_dict["APP"] = old_dict["外貌"]
            old_dict["DEX"] = old_dict["敏捷"]
            old_dict["STR"] = old_dict["力量"]
            old_dict["INT"] = old_dict["智力"]
            old_dict["CON"] = old_dict["体质"]
            old_dict["POW"] = old_dict["意志"]
            old_dict["SIZ"] = old_dict["体型"]
            old_dict["LUCK"] = old_dict["幸运"]
        if old_dict["SIZ"] >= 0 and (old_dict["体型"] == "SIZ"):
            old_dict["教育"] = old_dict["EDU"]
            old_dict["外貌"] = old_dict["APP"]
            old_dict["敏捷"] = old_dict["DEX"]
            old_dict["力量"] = old_dict["STR"]
            old_dict["智力"] = old_dict["INT"]
            old_dict["体质"] = old_dict["CON"]
            old_dict["意志"] = old_dict["POW"]
            old_dict["体型"] = old_dict["SIZ"]
            old_dict["幸运"] = old_dict["LUCK"]
        old_dict["灵感"] = old_dict["智力"]
        if ((old_dict["HP"] == "(CON+SIZ)/10") or (old_dict["HP"]) == 0) and ("HP" not in skill_dict):
            old_dict["HP"] = int((old_dict["体质"] + old_dict["体型"]) / 10)
        if ((old_dict["MP"] == "POW/5") or (old_dict["MP"]) == 0) and ("MP" not in skill_dict):
            old_dict["MP"] = int(old_dict["意志"] / 5)
        if (old_dict["SAN"] == "POW" or old_dict["SAN"] == old_dict["意志"]) and ("SAN" not in skill_dict):
            old_dict["SAN"] = old_dict["意志"]
        else:
            pass
        old_dict["理智"] = old_dict["SAN"]
        if new_dict:
            if old_dict["闪避"] > int(old_dict["敏捷"] / 2):
                pass
            elif "闪避" in new_dict:
                pass
            else:
                old_dict["闪避"] = int(old_dict["敏捷"] / 2)
            if old_dict["母语"] != "EDU" and old_dict["母语"] > old_dict["教育"]:
                pass
            elif "母语" in new_dict:
                pass
            else:
                old_dict["母语"] = old_dict["教育"]
            old_dict["魅力"] = old_dict["外貌"]
        old_dict["CM"] = old_dict["克苏鲁神话"]
        old_dict["克苏鲁"] = old_dict["克苏鲁神话"]
        old_dict["计算机"] = old_dict["计算机使用"]
        old_dict["电脑"] = old_dict["计算机使用"]
        old_dict["法学"] = old_dict["司法科学"]
        old_dict["霰弹枪"] = old_dict["步枪/霰弹枪"]
        old_dict["步枪"] = old_dict["步枪/霰弹枪"]
        if old_dict["信用评级"] > 0:
            old_dict["信用"] = old_dict["信用评级"]
        else:
            old_dict["信用评级"] = old_dict["信用"]
        if old_dict["MOV"] == 8:
            if ("mov" in new_dict) or ("MOV" in new_dict):
                pass
            elif (old_dict["敏捷"] < old_dict["体型"]) and (old_dict["力量"] < old_dict["体型"]):
                old_dict["MOV"] = 7
            elif (old_dict["敏捷"] > old_dict["体型"]) and (old_dict["力量"] > old_dict["体型"]):
                old_dict["MOV"] = 9
            else:
                old_dict["MOV"] = 8
        if old_dict["DB"] == 1:
            old_dict["DB"] = "1(+1D4)"
        if old_dict["DB"] == 2:
            old_dict["DB"] = "2(+1D6)"
        if old_dict["DB"] == -2:
            old_dict["DB"] = "-2(-2)"
        if old_dict["DB"] == -1:
            old_dict["DB"] = "-1(-1)"
        if old_dict["DB"] == 0:
            old_dict["DB"] = "0(0)"

        if old_dict["力量"] + old_dict["体型"] <= 164:
            old_dict["DB"] = "1(+1D4)"
            if old_dict["力量"] + old_dict["体型"] <= 124:
                old_dict["DB"] = "0(0)"
            if old_dict["力量"] + old_dict["体型"] <= 84:
                old_dict["DB"] = "-1(-1)"
            if old_dict["力量"] + old_dict["体型"] <= 64:
                old_dict["DB"] = "-2(-2)"
            if old_dict["力量"] + old_dict["体型"] <= 0:
                old_dict["DB"] = "0(0)"
        else:
            old_dict["DB"] = "2(+1D6)"
        if "图书馆使用" not in old_dict or old_dict["图书馆使用"] == 20:
            old_dict["图书馆使用"] = old_dict["图书馆"]
        if ("图书馆使用" in old_dict) and old_dict["图书馆使用"] > 20 and old_dict["图书馆"] == 20:
            old_dict["图书馆"] = old_dict["图书馆使用"]

        if "ARMOR" not in old_dict:
            old_dict["ARMOR"] = 0
        old_dict["#SAN"] = 100 - old_dict["克苏鲁神话"]

        # 基于年龄的调整值
        if "年龄" not in old_dict and "生日" not in old_dict and "生日" in new_dict:
            pass
        else:
            # 开启老化的年龄计算（。st生日）
            if "生日" not in old_dict and "生日" in new_dict:
                if new_dict["生日"] == "":
                    # 计算生日
                    current_date = self.time_log.get("1.0", tk.END).split("【日期】")[1].split(" ")[0]
                    date_object = datetime.strptime(current_date, "%Y/%m/%d")
                    # 提取年、月和日
                    year = date_object.year - old_dict["年龄"]
                    month = date_object.month
                    day = date_object.day
                    old_dict["生日"] = f"{year}/{month}/{day}"
                else:
                    old_dict["生日"] = new_dict["生日"]
            elif "生日" in old_dict and old_dict["生日"] != "":
                # 将日期对象格式化为统一的格式
                standard_format = "%Y/%m/%d"
                parsed_date = old_dict["生日"]
                current_date = self.time_log.get("1.0", tk.END).split("【日期】")[1].split(" ")[0]
                # 定义所有可能的日期格式
                possible_formats = ["%Y-%m-%d", "%d-%b-%Y", "%Y/%m/%d", "%b %d, %Y", "%Y年%m月%d日"]
                # 将字符串转换为日期对象
                for format_str in possible_formats:
                    try:
                        parsed_date = datetime.strptime(old_dict["生日"], format_str)
                        break
                    except ValueError:
                        continue
                        # 将日期对象格式化为统一的格式
                formatted_date = parsed_date.strftime(standard_format)
                # 将日期字符串解析为日期对象
                date_object = datetime.strptime(formatted_date, "%Y/%m/%d")
                current_date_object = datetime.strptime(current_date, "%Y/%m/%d")
                if current_date_object.month >= date_object.month and current_date_object.day >= date_object.day:
                    old_dict["年龄"] = current_date_object.year - date_object.year
                else:
                    old_dict["年龄"] = current_date_object.year - date_object.year - 1

            if "_年龄" not in old_dict and "年龄" in old_dict:  # 初始调整值
                old_dict["_年龄"] = old_dict["年龄"]
                if old_dict["年龄"] < 15:
                    old_dict["教育"] = (old_dict["年龄"] - 6) * 5
                    old_dict["EDU"] = (old_dict["年龄"] - 6) * 5
                    old_dict["体型"] -= 1
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["体型"], old_dict["力量"], old_dict["体质"])
                    # 将最小的变量减1
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["体型"]:
                        old_dict["体型"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["力量"] = min_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["SIZ"] = old_dict["体型"]
                    old_dict["CON"] = old_dict["体质"]
                else:
                    if 15 <= old_dict["年龄"] <= 19:
                        old_dict["教育"] -= 5
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["体型"] -= 2
                        old_dict["力量"] -= 2
                        # 找到最小的变量
                        min_var = min(old_dict["体型"], old_dict["力量"])
                        # 将最小的变量减1
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["体型"]:
                            old_dict["体型"] = min_var
                        else:
                            old_dict["力量"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["SIZ"] = old_dict["体型"]
                    elif 20 <= old_dict["年龄"] <= 39:
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                    elif 40 <= old_dict["年龄"] <= 49:
                        old_dict["MOV"] -= 1
                        old_dict["APP"] -= 5
                        old_dict["外貌"] = old_dict["APP"]
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["力量"] -= 1
                        old_dict["体质"] -= 1
                        old_dict["敏捷"] -= 1
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 50 <= old_dict["年龄"] <= 59:
                        old_dict["MOV"] -= 2
                        old_dict["APP"] -= 10
                        old_dict["外貌"] -= 10
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 3
                        old_dict["体质"] -= 3
                        old_dict["敏捷"] -= 3
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 60 <= old_dict["年龄"] <= 69:
                        old_dict["MOV"] -= 3
                        old_dict["APP"] -= 15
                        old_dict["外貌"] -= 15
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 6
                        old_dict["体质"] -= 6
                        old_dict["敏捷"] -= 6
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 70 <= old_dict["年龄"] <= 79:
                        old_dict["MOV"] -= 4
                        old_dict["APP"] -= 20
                        old_dict["外貌"] -= 20
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 13
                        old_dict["体质"] -= 13
                        old_dict["敏捷"] -= 13
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 1
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]

                    elif 80 <= old_dict["年龄"] <= 89:
                        old_dict["MOV"] -= 5
                        old_dict["APP"] -= 25
                        old_dict["外貌"] -= 25
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]

                        old_dict["力量"] -= 26
                        old_dict["体质"] -= 26
                        old_dict["敏捷"] -= 26
                        # 找到最小的变量
                        min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                        min_var -= 2
                        # 根据最小的变量是哪一个，更新原始变量
                        if min_var == old_dict["力量"]:
                            old_dict["力量"] = min_var
                        elif min_var == old_dict["体质"]:
                            old_dict["体质"] = min_var
                        else:
                            old_dict["敏捷"] = min_var
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]
                    else:
                        old_dict["MOV"] = 1
                        old_dict["APP"] -= 30
                        old_dict["外貌"] -= 30
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["教育"] += random.randint(1, 10)
                        if old_dict["教育"] > 99:
                            old_dict["教育"] = 99
                        old_dict["EDU"] = old_dict["教育"]
                        old_dict["力量"] = 1
                        old_dict["体质"] = 1
                        old_dict["敏捷"] = 1
                        old_dict["STR"] = old_dict["力量"]
                        old_dict["CON"] = old_dict["体质"]
                        old_dict["DEX"] = old_dict["敏捷"]
                self.update_skills(old_dict, {})

            if "_年龄" in old_dict and old_dict["_年龄"] != old_dict["年龄"]:  # 老化规则：
                if 15 > old_dict["年龄"] >= 8 and old_dict["_年龄"] < 15:
                    old_dict["教育"] = (old_dict["年龄"] - 6) * 5
                    old_dict["EDU"] = (old_dict["年龄"] - 6) * 5
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["体型"])
                    min_var += 4
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["体型"] = min_var
                    # 找到最大的变量
                    max_var = max(old_dict["力量"], old_dict["体质"], old_dict["体型"])
                    max_var += 4
                    # 根据最大的变量是哪一个，更新原始变量
                    if max_var == old_dict["力量"]:
                        old_dict["力量"] = max_var
                    elif max_var == old_dict["体质"]:
                        old_dict["体质"] = max_var
                    else:
                        old_dict["体型"] = max_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["SIZ"] = old_dict["体型"]
                if 15 <= old_dict["年龄"] <= 20 and old_dict["_年龄"] < 20:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["体型"] += 2
                    old_dict["力量"] += 2
                    # 找到最大的变量
                    max_var = max(old_dict["体型"], old_dict["力量"])
                    # 将最大的变量加1
                    max_var += 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if max_var == old_dict["体型"]:
                        old_dict["体型"] = max_var
                    else:
                        old_dict["力量"] = max_var
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["SIZ"] = old_dict["体型"]
                if 40 <= old_dict["年龄"] <= 49 and old_dict["_年龄"] < 40:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    old_dict["敏捷"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 50 <= old_dict["年龄"] <= 59 and old_dict["_年龄"] < 50:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 1
                    old_dict["体质"] -= 1
                    old_dict["敏捷"] -= 1
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 60 <= old_dict["年龄"] <= 69 and old_dict["_年龄"] < 60:
                    old_dict["教育"] += random.randint(1, 10)
                    if old_dict["教育"] > 99:
                        old_dict["教育"] = 99
                    old_dict["EDU"] = old_dict["教育"]
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 3
                    old_dict["体质"] -= 3
                    old_dict["敏捷"] -= 3
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 70 <= old_dict["年龄"] <= 79 and old_dict["_年龄"] < 70:
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 6
                    old_dict["体质"] -= 6
                    old_dict["敏捷"] -= 6
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 80 <= old_dict["年龄"] <= 89 and old_dict["_年龄"] < 80:
                    old_dict["MOV"] -= 1
                    old_dict["APP"] -= 5
                    old_dict["外貌"] -= 5
                    old_dict["力量"] -= 13
                    old_dict["体质"] -= 13
                    old_dict["敏捷"] -= 13
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 1
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 90 <= old_dict["年龄"] <= 99 and old_dict["_年龄"] < 90:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 100 <= old_dict["年龄"] <= 109 and old_dict["_年龄"] < 100:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 110 <= old_dict["年龄"] <= 119 and old_dict["_年龄"] < 110:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 120 <= old_dict["年龄"] <= 129 and old_dict["_年龄"] < 120:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 130 <= old_dict["年龄"] <= 139 and old_dict["_年龄"] < 130:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 140 <= old_dict["年龄"] <= 149 and old_dict["_年龄"] < 140:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                if 150 <= old_dict["年龄"] <= 159 and old_dict["_年龄"] < 150:
                    old_dict["MOV"] -= 1
                    old_dict["LUCK"] += 1
                    old_dict["幸运"] += 1
                    old_dict["力量"] -= 26
                    old_dict["体质"] -= 26
                    old_dict["敏捷"] -= 26
                    # 找到最小的变量
                    min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    min_var -= 2
                    # 根据最小的变量是哪一个，更新原始变量
                    if min_var == old_dict["力量"]:
                        old_dict["力量"] = min_var
                    elif min_var == old_dict["体质"]:
                        old_dict["体质"] = min_var
                    else:
                        old_dict["敏捷"] = min_var
                    if min_var < 0:
                        var_value = 0
                        can_be_minus = []
                        while min_var < 0:
                            if old_dict["力量"] < 0:
                                var_value += old_dict["力量"]
                                old_dict["力量"] = 0
                            else:
                                can_be_minus.append("力量")
                            if old_dict["体质"] < 0:
                                var_value += old_dict["体质"]
                                old_dict["体质"] = 0
                            else:
                                can_be_minus.append("体质")
                            if old_dict["敏捷"] < 0:
                                var_value += old_dict["敏捷"]
                                old_dict["敏捷"] = 0
                            else:
                                can_be_minus.append("敏捷")
                            if can_be_minus == "":
                                min_var = 0
                            else:
                                for s in can_be_minus:
                                    old_dict[s] += int(var_value / len(can_be_minus))
                            min_var = min(old_dict["力量"], old_dict["体质"], old_dict["敏捷"])
                    old_dict["STR"] = old_dict["力量"]
                    old_dict["CON"] = old_dict["体质"]
                    old_dict["DEX"] = old_dict["敏捷"]
                old_dict["_年龄"] = old_dict["年龄"]
                self.update_skills(old_dict, {})
            else:
                pass

    def edit_role_name(self, event, role, label):
        label.config(relief=tk.GROOVE)
        entry = tk.Entry(label, width=10)
        entry.insert(0, role)
        entry.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        entry.bind("<FocusOut>",
                   lambda event, role=role, entry=entry, label=label: self.update_role_name(event, role, entry, label))

    def update_role_name(self, event, role, entry, label):
        global bot_personality
        global bot_personality_by_name
        global mav_prob
        global encounter_prob
        self.search_and_delete_insert_symbol()
        label.config(relief=tk.FLAT, font=("Times New Roman", 16, "bold"))
        new_name = entry.get().strip()
        if new_name and new_name != "":
            if "NPC_name" in role:
                entry.grid_forget()
                label.configure(text=new_name)
                return
            # 更新角色名
            index = self.roles.index(role)
            # self.roles[index] = new_name
            old_name_dict = self.role_entries_name.copy()
            self.role_entries_name[role] = new_name
            babel(self)
            # 更新当前角色名
            # if self.current_role.get() == role:
            # self.current_role.set(new_name)

            # 初始化当前角色codename
            if role in self.role_entries_name:
                self.codename_by_name[role] = self.role_entries_name[role]
            else:
                self.codename_by_name[role] = role

            entry.grid_forget()
            label.configure(text=new_name)

            if role == "DiceBot":
                # 按名牌加载Bot性格
                for names in bot_personality_by_name:
                    if "_encounter_prob" not in bot_personality_by_name[names]:
                        bot_personality_by_name[names]["_encounter_prob"] = encounter_prob
                    if names == self.role_entries_name["DiceBot"]:
                        bot_personality = bot_personality_by_name[names]
                        self.trpg_module.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                        self.trpg_module.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                        self.trpg_module.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                        self.trpg_module.Success = random.choice(bot_personality["Success"]["通用"])
                        self.trpg_module.Failure = random.choice(bot_personality["Failure"]["通用"])
                        self.trpg_module.Fumble = random.choice(bot_personality["Fumble"]["通用"])
                        self.trpg_module.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
                        self.trpg_module.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]
                        mav_prob = bot_personality["妙语"]["_mav_prob"]  # 妙语概率
                        encounter_prob = bot_personality["_encounter_prob"]  # 遭遇事件概率
                        print("妙语概率：" + str(mav_prob))
                        print("遭遇事件概率：" + str(encounter_prob))
                        self.role_entries["DiceBot"].insert("1.0", f"已录入[{names}]的性格！\n")
                        break
            old_role = ""
            # 按名牌加载设置
            if new_name in role_Chart_at_name and (new_name != role) and ("PL " not in new_name):
                if new_name in self.infoCanvas_data_by_name:
                    self.infoCanvas_data[role] = self.infoCanvas_data_by_name[new_name]
                role_Chart[role] = role_Chart_at_name[new_name].copy()
                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                # self.role_entries[role].delete("1.0", tk.END)
                self.role_avatar_paths[role] = role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"]
                self.load_and_display_avatar(role, self.role_entries[role].master)
                SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                POW = role_Chart_detail.get("POW")
                DB = role_Chart_detail.get("DB")
                if "#SAN" in role_Chart_detail:
                    SAN_ = role_Chart_detail.get("#SAN")
                else:
                    SAN_ = 100
                for r2, n2 in old_name_dict.items():
                    if n2 == new_name and r2 != role:
                        old_role = r2
                if old_role != "":
                    #_SAN = self.role_values_entry[old_role].get("1.0", "2.0").split("/")[0]
                    role_Chart[role]["SAN"] = self.role_values_entry[old_role].get("1.0", "2.0").split("/")[0]
                    #_HP = self.role_values_entry[old_role].get("2.0", "3.0").split("/")[0]
                    #_MP = self.role_values_entry[old_role].get("3.0", "4.0").split("/")[0]
                    #_MOV = self.role_values_entry[old_role].get("4.0", "5.0").split("/")[0]
                    old_values = self.role_values_entry[old_role].get("1.0", tk.END)
                    #self.role_values_entry[role].insert("1.0", f'{_SAN}/{SAN_}:SAN\n{_HP}/{HP}:HP\n{_MP}/{MP}:MP\n{_MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                    self.role_values_entry[role].insert("1.0", old_values + "===\n")
                else:
                    self.role_values_entry[role].insert("1.0", f'{SAN}/{SAN_}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                # self.role_entries[role].delete("1.0", tk.END)
                # self.role_entries[role].insert(tk.END, "已录入！")
                # self.chat_log.insert(tk.END,
                # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\nSAN:{SAN}\nHP:{HP}\nMP:{MP}\nMOV:{MOV}\n\n\n')
                self.chat_log.insert(tk.END,
                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.role_entries_name[role]}】的状态：\n{self.role_values_entry[role].get("1.0", "5.0").strip()}\n\n')
                self.chat_log.yview(tk.END)
                self.role_entries[role].insert("1.0", "已加载名牌为[" + new_name + "]的角色卡！\n")
            else:
                role_Chart[role] = role_Chart_detail_demo.copy()
            if f"===状态===" not in self.role_values_entry[role].get("1.0", tk.END).strip():
                self.role_values_entry[role].insert(tk.END, f"\n===状态===\n无(永久)\n")
            if new_name in self.role_items and old_role == "":
                for key, value in self.role_items[new_name].items():
                    if value != "":
                        for value_ in value:
                            if value_ != "":
                                self.role_values_entry[role].insert(tk.END, f"\n==={key}===\n" + "\n".join(value))
            # 重新创建角色框架
            # for widget in self.root.grid_slaves(column=2):
            # widget.grid_forget()

            # self.create_role_frames()

    def add_role(self):
        self.role_count += 1
        # print(self.role_count)
        # self.role_count = self.role_count
        new_role = f"PL {len(self.roles) - 1}"
        self.roles.append(new_role)
        if new_role not in self.codename_by_name:
            self.codename_by_name[new_role] = new_role
        if new_role not in self.role_entries_name:
            self.role_entries_name[new_role] = new_role
            self.codename_by_name[new_role] = new_role
        elif self.role_entries_name[new_role] != new_role:
            self.codename_by_name[new_role] = self.role_entries_name[new_role]
            pass
        if new_role in self.role_entries_name:
            if self.role_entries_name[new_role] not in self.role_skill_menu:
                self.role_skill_menu[self.role_entries_name[new_role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if self.role_entries_name[new_role] not in self.luck_by_name:
                self.luck_by_name[self.role_entries_name[new_role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
        else:
            if new_role not in self.luck_by_name:
                self.luck_by_name[new_role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        num_cols = 3
        idx = len(self.roles) - 1
        row = idx % num_cols
        col = idx // num_cols
        self.create_role_frame(new_role, row, col)

        # 超过3列时自动换列
        if col > 2:
            self.root.columnconfigure(col + 2, weight=1)

        # 重新创建角色框架
        # for widget in self.root.grid_slaves(column=2):
        # widget.grid_forget()

        # self.create_role_frames()
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

    def add_role_init(self):
        self.role_count = self.role_count
        new_role = f"PL {len(self.roles) - 1}"
        self.roles.append(new_role)
        self.canvas_icon_animate[new_role] = tk.Canvas(self.root, width=20, height=20)
        self.image_references_on_Avatar[new_role] = []
        self.frames_avatar[new_role] = []
        self.current_frame_avatar[new_role] = []
        self.frames_icon[new_role] = []
        self.current_frame_icon[new_role] = []
        self.frames_map[new_role] = []
        self.current_frame_map[new_role] = []
        self.frames_icon_on_canvas[new_role] = []
        self.current_frame_icon_on_canvas[new_role] = []
        if new_role not in self.role_entries_name:
            self.role_entries_name[new_role] = new_role
        elif self.role_entries_name[new_role] != new_role:
            pass
        if new_role not in self.codename_by_name:
            if new_role in self.role_entries_name:
                self.codename_by_name[new_role] = self.role_entries_name[new_role]
            else:
                self.codename_by_name[new_role] = new_role
        if new_role in self.role_entries_name:
            if self.role_entries_name[new_role] not in self.role_skill_menu:
                self.role_skill_menu[self.role_entries_name[new_role]] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                                          '法术名[效果公式](消费)：描述': "spell",
                                                                          '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            if self.role_entries_name[new_role] not in self.luck_by_name:
                self.luck_by_name[self.role_entries_name[new_role]] = {"_d100": 0, "_luck": 0, "_luck_weight": 0,
                                                                       "_luck_exp": 0, "_success": 0, "_fail": 0,
                                                                       "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                                                       "_critical_rate": 0, "_d100_value": [],
                                                                       "_luck_exp_value": []}
        else:
            if new_role not in self.luck_by_name:
                self.luck_by_name[new_role] = {"_d100": 0, "_luck": 0, "_luck_weight": 0, "_luck_exp": 0, "_success": 0,
                                               "_fail": 0, "_fumble": 0, "_fumble_rate": 0, "_critical": 0,
                                               "_critical_rate": 0, "_d100_value": [], "_luck_exp_value": []}

        num_cols = 3
        idx = len(self.roles) - 1
        row = idx % num_cols
        col = idx // num_cols
        self.create_role_frame(new_role, row, col)

        # 超过3列时自动换列
        if col > 2:
            self.root.columnconfigure(col + 2, weight=1)

        # 重新创建角色框架
        # for widget in self.root.grid_slaves(column=2):
        # widget.grid_forget()

        # self.create_role_frames()
        for role in self.roles:
            entry = self.role_entries[role]
            entry.bind("<FocusIn>", lambda event, role=role: self.bind_enter_to_send_message(event, role))
        for role in self.roles:
            entry_roll = self.role_entries_roll[role]
            entry_roll.bind("<FocusIn>", lambda event2, role=role: self.bind_enter_to_send_roll(event2, role))

    def delete_role(self):
        if len(self.roles) > 3:
            self.role_count -= 1
            role_to_delete = self.roles.pop()
            self.role_entries[role_to_delete].destroy()
            # self.roles[len(self.roles)-1].destroy()
            del self.role_entries[role_to_delete]
            # del self.roles[len(self.roles)]
            self.role_entries_frame[role_to_delete].destroy()
            # 更新当前角色名
            if role_to_delete == self.current_role.get():
                self.current_role.set(self.roles[0])

            # 重新创建角色框架
            # for widget in self.root.grid_slaves(column=2):
            # widget.grid_forget()

            # self.create_role_frames()

    def insert_newline(self):
        current_text = self.role_entries[self.current_role.get()].get("1.0", tk.END)
        self.role_entries[self.current_role.get()].delete("1.0", tk.END)
        self.role_entries[self.current_role.get()].insert(tk.END, current_text)
        self.highlight_role_frame(self.current_role.get())

    def bind_enter_to_send_message(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.current_role.set(role)
        self.root.bind("<Return>", lambda event, role=role: self.send_message_on_enter(event, role))
        self.highlight_role_frame(role)

    def bind_enter_to_send_message_NPC(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.new_combat_window = self.new_combat_windows[role]
        self.current_role.set(role)
        self.new_combat_window.bind("<Return>", lambda event, role=role: self.send_message_on_enter(event, role))
        self.highlight_role_frame(role)

    def env_focus(self, event):
        self.reset_focus(event)
        self.root.bind("<Return>", lambda event, role="env": self.send_message_on_enter(event, role))

    def reset_focus(self, event):
        self.search_and_delete_insert_symbol()
        self.current_role.set("")
        self.root.bind("<Return>", lambda event: self.send_message_on_enter(event))
        self.chat_log.config(relief=tk.SOLID)
        for role in self.role_entries:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)

    def bind_enter_to_send_roll(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.current_role.set(role)
        self.root.bind("<Return>", lambda event, role=role: self.send_roll_on_enter(event, role))
        self.highlight_role_frame_roll(role)

    def bind_enter_to_send_roll_NPC(self, event, role):
        # 为当前文本框绑定回车键发送消息
        self.new_combat_window = self.new_combat_windows[role]
        self.current_role.set(role)
        self.new_combat_window.bind("<Return>", lambda event, role=role: self.send_roll_on_enter(event, role))
        self.highlight_role_frame_roll(role)

    def random_discovery(self):
        global encounter_prob
        global hurt_position
        # 触发概率
        if random.randint(1, 100) >= encounter_prob:
            return
        cats_and_dogs = ["毛球Fluffy：一只长毛的波斯猫，非常温顺喜欢被抚摸。品种：波斯猫",
    "咪咪Mimi：一只机灵的小橘猫，总是喜欢探索家里的每一个角落。品种：美国短毛猫",
    "黑影Shadow：一只全黑的猫咪，动作敏捷，喜欢在晚上活动。品种：缅因猫",
    "雪花Snowflake：一只白色的短毛猫，眼睛像蓝宝石一样闪闪发光。品种：暹罗猫",
    "虎斑Tiger：一只虎斑猫，外表威武，总是像个小猎人一样巡视着家。品种：孟加拉猫",
    "小灰灰Grey：一只灰色的英国短毛猫，性格温和，喜欢和人亲近。品种：英国短毛猫",
    "斑点Spotty：一只斑点猫，身上的花纹像是一幅精美的艺术品。品种：埃及猫",
    "小胖Puffy：一只略胖的橘猫，总是喜欢吃东西和晒太阳。品种：美国短毛猫",
    "咪宝Momo：一只喜欢捉迷藏的猫咪，总能找到各种奇怪的藏身之处。品种：布偶猫",
    "黑白Cookie：一只黑白相间的猫咪，喜欢在家里跳上跳下。品种：美国短毛猫",
    "小花Patch：一只三花猫，性格独立，总是喜欢独自行动。品种：日本短尾猫",
    "蓝眼Blue：一只蓝眼睛的暹罗猫，声音甜美，总是喜欢和人“对话”。品种：暹罗猫",
    "卷毛Curly：一只卷毛猫，毛发柔软，总是卷成一个小球睡觉。品种：塞尔凯克卷毛猫",
    "小黑Blackie：一只小黑猫，喜欢追逐家里的小玩具。品种：孟买猫",
    "奶牛Cow：一只黑白花的猫咪，看起来像一只小奶牛。品种：英国短毛猫",
    "豆豆Bean：一只小巧的猫咪，喜欢钻进各种小盒子和袋子里。品种：新加坡猫",
    "大橘Ginger：一只大橘猫，性格懒散，喜欢整天躺在沙发上。品种：美国短毛猫",
    "小白Whitie：一只白色的猫咪，性格活泼，喜欢到处跑来跑去。品种：土耳其安哥拉猫",
    "长耳Bunny：一只耳朵特别长的猫咪，样子有点像小兔子。品种：东方短毛猫",
    "花花Daisy：一只花斑猫，性格开朗，总是能带来欢乐。品种：加州闪亮猫",
    "铃铛Bell：一只脖子上总是挂着一个小铃铛的猫咪，走到哪里都能听到叮当声。品种：苏格兰折耳猫",
    "香草Vanilla：一只毛色像香草冰淇淋一样的奶油色猫咪，非常甜美可爱。品种：喜马拉雅猫",
    "灰耳Ash：一只灰色耳朵的白猫，总是喜欢蹲在窗边晒太阳。品种：俄罗斯蓝猫",
    "豹纹Leopard：一只身上有着豹纹斑点的猫咪，看起来像一只小猎豹。品种：孟加拉猫",
    "橘子Tangerine：一只小橘猫，总是精力充沛，喜欢四处奔跑和玩耍。品种：美国卷耳猫",
    "奶油Cream：一只毛色柔软的奶油色猫咪，喜欢在主人腿上打盹。品种：挪威森林猫",
    "蜜糖Honey：一只性格温顺的猫咪，毛色像蜜糖一样温暖。品种：布偶猫",
    "小狸Raccoon：一只像小浣熊一样的猫咪，有着独特的面部花纹。品种：缅因猫",
    "蓝贝Blueberry：一只蓝灰色的猫咪，眼睛像蓝莓一样闪亮。品种：俄罗斯蓝猫",
    "金豆Goldie：一只金色毛发的猫咪，总是给人带来阳光般的温暖感觉。品种：英国短毛猫","小黑Blackie：一只聪明的黑色拉布拉多，总是充满活力和热情。品种：拉布拉多",
    "毛球Fluffy：一只长毛的萨摩耶，友善且爱玩，总是面带微笑。品种：萨摩耶",
    "小黄Sunny：一只黄色的金毛猎犬，温顺友好，非常喜欢小朋友。品种：金毛猎犬",
    "大白Snowy：一只巨大的白色大丹犬，尽管体型庞大，但性格温和。品种：大丹犬",
    "小贝Buddy：一只棕色的比格犬，嗅觉灵敏，喜欢户外活动。品种：比格犬",
    "灰狼Wolfie：一只灰色的阿拉斯加雪橇犬，外表像狼，精力充沛。品种：阿拉斯加雪橇犬",
    "巧克力Choco：一只巧克力色的贵宾犬，聪明机智，非常擅长学习新技能。品种：贵宾犬",
    "斑点Spotty：一只斑点狗，总是喜欢跑来跑去，非常活泼。品种：达尔马提亚犬",
    "小熊Bear：一只像小熊一样的纽芬兰犬，非常温柔且保护主人。品种：纽芬兰犬",
    "金毛Goldie：一只金色的黄金猎犬，聪明且忠诚。品种：黄金猎犬",
    "猎鹰Falcon：一只敏捷的德国牧羊犬，擅长追踪和保护。品种：德国牧羊犬",
    "棕熊Bruno：一只棕色的圣伯纳犬，巨大的体型下藏着一颗温柔的心。品种：圣伯纳犬",
    "小不点Tiny：一只体型娇小的吉娃娃，虽然小但非常勇敢。品种：吉娃娃",
    "大力士Hercules：一只强壮的斗牛犬，肌肉发达但非常友好。品种：斗牛犬",
    "雪宝Frosty：一只白色的哈士奇，眼睛像冰蓝色的湖水。品种：哈士奇",
    "小鹿Bambi：一只苗条的意大利灵缇犬，跑起来像风一样快。品种：意大利灵缇犬",
    "蜜糖Honey：一只棕色的可卡犬，性格甜美，非常亲人。品种：可卡犬",
    "小虎Tiger：一只勇猛的罗威纳犬，忠诚且保护主人。品种：罗威纳犬",
    "雪球Snowball：一只全白的比熊犬，外表像个毛茸茸的雪球。品种：比熊犬",
    "小胖Puffy：一只胖嘟嘟的巴哥犬，总是喜欢吃东西和打盹。品种：巴哥犬",
    "斑马Zebra：一只黑白条纹的斑点狗，外表独特，喜欢玩耍。品种：斑点狗",
    "小棕Brownie：一只棕色的杜宾犬，机警且忠诚。品种：杜宾犬",
    "卷毛Curly：一只卷毛的巴哥犬，活泼好动。品种：巴哥犬",
    "黑耳Blackie：一只耳朵黑色的可卡犬，性格开朗。品种：可卡犬",
    "香草Vanilla：一只奶油色的拉布拉多，温顺且友好。品种：拉布拉多",
    "风暴Storm：一只灰色的西伯利亚雪橇犬，力量强大且耐力惊人。品种：西伯利亚雪橇犬",
    "豆豆Bean：一只小巧的法国斗牛犬，精力充沛且爱玩。品种：法国斗牛犬",
    "雷电Thunder：一只黑色的杜宾犬，威风凛凛且忠诚。品种：杜宾犬",
    "花斑Patch：一只身上有花斑的柯基犬，短腿可爱，性格活泼。品种：柯基犬",
    "蓝贝Blue：一只蓝灰色的澳大利亚牧羊犬，聪明且善于工作。品种：澳大利亚牧羊犬"]
        clothes = ["男学生制服",
	"天线宝宝-丁丁裝(紫)",
	"天线宝宝-迪西裝(绿)",
	"天线宝宝-拉拉裝(黄)",
	"天线宝宝-小波裝(红)",
	"比基尼泳装",
	"比基尼+超短裙",
	"果体围裙",
	"唐代囚衣",
	"女巫服",
	"小马甲+低腰小热裤",
	"蕾丝女仆装",
	"猫耳装",
	"希腊白袍",
	"黑色薄纱",
	"高叉旗袍",
	"婚纱",
	"小狗玩偶装",
	"水手服",
	"和服",
	"浴衣",
	"小丑装",
	"日式艺伎服",
	"凤梨装",
	"兔女郎装",
	"死库水",
	"军服",
	"猫女郎",
	"OL装",
	"护士装",
	"女士西装",
	"咸蛋超人装",
	"任意女装cos服"]
        done = []
        order = self.roles
        random.shuffle(order)
        goods = ["获得了黄铜指虎\n检定技能:斗殴\n伤害:1D3+1+DB\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):1/10\n发明时间:——",
        "获得了长鞭\n检定技能:鞭子\n伤害:1D3+半DB\n射程:10英尺\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s\n价格20s/现代($):5/50\n发明时间:——",
        "获得了燃烧的蜡烛\n检定技能:斗殴\n伤害:1D3+燃烧\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):0.05/0.5\n发明时间:——",
        "获得了电锯\n检定技能:电锯\n伤害:2D8\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:95\n常见时代:现代\n价格20s/现代($):——/300\n发明时间:1926年",
        "获得了包皮铁棍(甩棍、大头棍、护身棒)\n检定技能:斗殴\n伤害:1D8+DB\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):2/15\n发明时间:1940年",
        "获得了大型棍状物(棒球棍、板球棒、拨火棍、撬棍等)\n检定技能:斗殴\n伤害:1D8+DB\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):3/35\n发明时间:——",
        "获得了小型棍状物(警棍等)\n检定技能:斗殴\n伤害:1D6+DB\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):3/35\n发明时间:——",
        "获得了玩具弩\n检定技能:弓\n伤害:1D8+1\n射程:50码\n贯穿:√\n每轮:1/2\n装弹量:1\n故障值:96\n常见时代:1920s,现代\n价格20s/现代($):10/100\n发明时间:前210年",
        "获得了绞具（绳子、电线等）\n检定技能:绞具\n伤害:1D6+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):0.5/3\n发明时间:——",
        "获得了手斧\n检定技能:斧\n伤害:1D6+1+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):3/9\n发明时间:——",
        "获得了中型刀具(切肉菜刀等)\n检定技能:斗殴\n伤害:1D4+2+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):2/15\n发明时间:——",
        "获得了小型刀具(弹簧折叠刀等)\n检定技能:斗殴\n伤害:1D4+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):2/6\n发明时间:——",
        "获得了220v通电导线\n检定技能:斗殴\n伤害:2D8+眩晕\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:95\n常见时代:现代\n价格20s/现代($):——\n发明时间:1894年",
        "获得了催泪瓦斯\n检定技能:斗殴\n伤害:眩晕\n射程:6英尺\n贯穿:×\n每轮:1\n装弹量:25次\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):——/10\n发明时间:1912年",
        "获得了双节棍\n检定技能:链枷\n伤害:1D8+DB\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):1/10\n发明时间:960年",
        "获得了哑铃\n检定技能:投掷\n伤害:1D4+半DB\n射程:STR英尺\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):——\n发明时间:——",
        "获得了手里剑\n检定技能:投掷\n伤害:1D3+半DB\n射程:20码\n贯穿:√\n每轮:2\n装弹量:一次性\n故障值:100\n常见时代:1920s,现代\n价格20s/现代($):0.5/3\n发明时间:——",
        "获得了弓箭头\n检定技能:斗殴\n伤害:1D3+半DB\n射程:接触\n贯穿:√\n每轮:2\n装弹量:一次性\n故障值:100\n常见时代:1920s,现代\n价格20s/现代($):0.5/3\n发明时间:——",
        "获得了矛、装饰长枪\n检定技能:矛\n伤害:1D8+1\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):25/150\n发明时间:——",
        "获得了大型剑（马刀）\n检定技能:剑\n伤害:1D8+1+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):30/75\n发明时间:——",
        "获得了中型剑（佩剑、重剑）\n检定技能:剑\n伤害:1D6+1+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):15/100\n发明时间:——",
        "获得了轻型剑（花剑、剑杖）\n检定技能:剑\n伤害:1D6+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):25/100\n发明时间:——",
        "获得了电棍、电击枪(接触)\n检定技能:斗殴\n伤害:1D3+眩晕\n射程:接触\n贯穿:×\n每轮:1\n装弹量:——\n故障值:97\n常见时代:现代\n价格20s/现代($):——/200\n发明时间:2006年",
        "获得了战斗回力镖\n检定技能:投掷\n伤害:1D8+半DB\n射程:20码\n贯穿:×\n每轮:1\n装弹量:——\n故障值:——\n常见时代:罕见\n价格20s/现代($):2/4\n发明时间:——",
        "获得了伐木斧\n检定技能:斧\n伤害:1D8+2+DB\n射程:接触\n贯穿:√\n每轮:1\n装弹量:——\n故障值:——\n常见时代:1920s,现代\n价格20s/现代($):5/10\n发明时间:——",
        "获得了.22(5.6mm)小型自动手枪\n检定技能:手枪\n伤害:1D6\n射程:10\n贯穿:√\n每轮:1(3)\n装弹量:6\n故障值:100\n常见时代:1920s,现代\n价格20s/现代($):25/190\n发明时间:1857年",
        "获得了.32(7.65mm)左轮手枪\n检定技能:手枪\n伤害:1D8\n射程:15\n贯穿:√\n每轮:1(3)\n装弹量:6\n故障值:100\n常见时代:1920s,现代\n价格20s/现代($):15/200\n发明时间:1930年",
        "获得了燃烧瓶\n检定技能:投掷\n伤害:2D6+燃烧\n射程:STR码\n贯穿:√\n每轮:1/2\n装弹量:一次性\n故障值:95\n常见时代:1920s,现代\n价格20s/现代($):N/A\n发明时间:1936年",
        "获得了炸药棒\n检定技能:投掷\n伤害:4D10/3码\n射程:STR英尺\n贯穿:√\n每轮:1/2\n装弹量:一次性\n故障值:99\n常见时代:1920s,现代\n价格20s/现代($):2/5\n发明时间:——",
        "获得了开锁器，指定一次锁匠检定为普通成功。",
        f"疗愈之光Healing Light：“感觉好多了。”你被一股神秘的疗愈力量所包围，所有的伤痛和疲惫都被治愈了。HP恢复{random.randint(1,10)}点！",
        f"复苏药剂Revival Elixir：“这药剂真神奇。”你获得了一瓶珍贵的复苏药剂，神清气爽。MP恢复{random.randint(1,10)}点！",
        f"疗愈之光Healing Light：“感觉好多了。”你被一股神秘的疗愈力量所包围，所有的伤痛和疲惫都被治愈了。HP恢复{random.randint(1,3)}点！",
        f"复苏药剂Revival Elixir：“这药剂真神奇。”你获得了一瓶珍贵的复苏药剂，神清气爽。MP恢复{random.randint(1,3)}点！",
        f"疗愈之光Healing Light：“感觉好多了。”你被一股神秘的疗愈力量所包围，所有的伤痛和疲惫都被治愈了。HP恢复{random.randint(1,6)}点！",
        f"复苏药剂Revival Elixir：“这药剂真神奇。”你获得了一瓶珍贵的复苏药剂，神清气爽。MP恢复{random.randint(1,6)}点！",
        "意外之财Unexpected Wealth：“天降横财！”你无意中发现了一笔遗失的财宝，或许是从一个旧箱子里翻出来的古钱币，也可能是在路边发现的一大堆钞票。不论是什么，你的财富增加了。信用+1。",
        "贵人相助Help from a Stranger：“谢谢你，陌生人。”你在困境中得到了一个陌生人的帮助。这位好心人提供了你所需的资源或信息，帮助你渡过难关。指定一次检定变为普通成功。",
        f"力量提升Strength Boost：“感觉浑身充满力量！”你突然感到一股强大的力量涌入体内。你的力量和耐力都得到了提升。{random.randint(1,6)}小时内力量或体质检定默认成功。",
        "幸运时刻Lucky Moment：“太幸运了！”你在关键时刻躲过了一场灾难，或者意外地取得了一次成功。下一检定获得+20的加值。",
        f"智慧启迪Insight：“啊哈，我明白了！”你突然领悟了一些之前一直困扰你的问题，或者找到了一个解决问题的新方法。获得{random.randint(1,6)}智力值。",
        "友谊之力Power of Friendship：“有朋友真好。”你结识了一位新朋友，这位朋友将来可能会在关键时刻帮助你。随机生成或邀请PL加入，由此获得一位可靠的盟友。",
        "好运降临Good Luck：“今天是我的幸运日！”你在日常活动中获得了意想不到的好运。接下来的三个小时内，所有检定获得+10的加值。",
        "知识的馈赠Gift of Knowledge：“知识就是力量。”你无意中获得了一本书籍，里面包含了丰富的知识和智慧。阅读这本书后，你的技能得到了提升。选择一个技能，永久获得+1的加值。",
        "神秘护符Mystic Amulet：“这个护符好像很特别。”你发现了一块神秘的护符，它似乎拥有某种神奇的力量。佩戴它时，无视最大为3的理智检定（例如1D3、1D2+1）。",
        f"捡到了一件{random.choice(clothes)}！...",
        f"遇到了{random.choice(cats_and_dogs)}！"
        ]
        bad = [f"噩梦Bad Dreams：“不要让我睡觉！”你从你经历过最为恐怖的噩梦中醒来。你冷汗直流，浸透了被单；身上则满是瘀青、擦伤和划痕（损失1点耐久值和1点理智值）。从此以后，你每次睡觉都要忍受恐怖梦魇的折磨，损失1点理智值。如果你愿意，你可以进行一次INT检定来判断自己是否记得自己的梦魇：若你成功，再损失1D4点理智值——KP 会描述你记得什么。如果你的 INT 检定失败，你记不得任何清晰的内容，只记得自己对入睡的极端恐惧。此状态将一直持续{random.randint(1,3)}天。",
    f"厄运Bad Luck：“诸事不顺！”命运在和你做对。你的当前幸运减半。（如果使用了燃运-消耗运气规则，你也不能花费幸运来改变掷骰结果。）此状态将一直持续{random.randint(1,24)}小时",
    f"坏乌贼Bad Squid：“唔呕！快滚出去！恶心死我了！”尽管你美美地享用了一餐，有些被你吃掉的东西却不这么认为。也许它就是所谓“坏乌贼”？你大汗淋漓、浑身抽搐，热浪和寒流在你的体内奔涌。头痛越来越强烈，你难以集中精力清晰地思考。也许休息{random.randint(1,4)+1}天能让你恢复正常，要不你就得去看看大夫？你在生病期间，每天进行一次 CON 检定：若失败，损失 1 点耐久值。若结果为困难成功，你的病将在转天痊愈。另外，医学检定也能让你恢复正常。当你生病时，你的 STR、DEX、技能和战斗检定均要受到一个惩罚骰。",
    f"被监视了？Being Watched? ：“你有没有感觉自己不是一个人？”每次你转身或回头时，都有一个人在那里看着你。你十分确定。很难说这个人已经监视你多久了，也许今天下午才刚刚开始，也许已经持续了好几天……",
    f"勒索信Blackmail：你收到了一封意料之外的信，信上没有邮戳，也没有任何标记表明它是如何送到你手上的。信封上写着你的全名。里面装着的信上是用墨水手写的花体字，内容是：你过去的所作所为已经败露。我要把所有事情告诉你最亲最爱的人。我还要把它们全部公之于众。除非你付出代价。你今天在扣眼上佩戴一朵康乃馨，我就知道你同意了；我会联系你，告诉你具体该如何做。不戴的话，就等着自食其果吧！",
    f"目盲Blinded：“我看不见了！”你毫无征兆地突然失明。一切需要视力的检定（身体协调、战斗等等）必须要极难成功（才视为普通成功）。KP也可以适当地加入惩罚骰。如果你正处在危险的境况中（如站在高处的墙壁突出物上、攀登墙壁等），你可能要做一次DEX检定来保证安全。此状态将一直持续{random.randint(1,8)}小时。",
    f"受制于人Bound by Command：“你不能碰我！”你的脑袋里开始响起一个声音，指示你不可以伤害某一人（KP会告诉你是谁）。你绝对确信，你不论尝试做什么，都不可以加害这个人，甚至不能动起这个念头。你的加害这个人的任何行动将不会成功，除非 KP 另行决定。",
    f"呆滞Dumbfounded：“告诉我该怎么做……”你的脑袋变糊涂了。你难以自主思考。你如同愚钝的僵尸一般寻求别人的指引，心甘情愿地遵从周围其他人对你的命令。此状态将一直持续，结束时间由KP另行告知。",
    f"邪恶低语Evil Whisper：“你听见了吗？”你听到有人在附近说着什么东西。说话的声音太小，你几乎听不见。其他人好像也没人听到。你不能确定说话的内容，但它听上去就像：“这样就对了……杀尽他们……”",
    f"发热恶寒Feverish Chills：“我这是怎么了？！”你的身体突然受到发热恶寒的摧残。可怕的疼痛顺着你的手脚传递。你全身滚烫，还恶心想吐。每天失去{random.randint(1,6)}点 STR、CON 和 DEX（分别掷骰决定每一项），直到KP宣称你的病已经痊愈，或任意一项属性归零（意味着这疾病最终要了你的命）。在你的发热恶寒痊愈之前，所有技能和战斗检定都要受到一个惩罚骰。若你活过这场病，只要症状消失，失去的属性值便可以每天1D4点的速度取回。",
    f"被跟踪了？Followed?：“我敢保证，我被人尾随了。”刚才的一小时中，你感觉自己被跟踪了。在你前进的时候，好像有什么人或者什么东西在跟着你的足迹。",
    f"旅馆失火Hotel Fire：“来人啊！叫消防员啊！”你回到自己的住地，却发现那里正在熊熊燃烧！四周被人群围得水泄不通，消防员在试图控制局势。在{random.randint(1,10)}小时内，你无法进入建筑物附近的任何地方。做一次幸运检定决定受损失的等级：\n成功——火灾造成的损失十分巨大；但大多数客房多少还算完整。你的物品也许烧坏了一小部分，但其他的都完好。\n失败——彻底是一场灾难，整座楼都夷为平地，你的物品也一起变成了灰烬。",
    f"生命吸取Life Drain：“好像……身体被掏空……”你感觉自己的生命力突然衰退，似乎有什么东西在从你体内吸走生命力。失去{random.randint(1,6)}点魔法值。你忽然觉得非常虚弱，摔倒在地并昏厥{random.randint(1,10)}回合。",
    f"故障Malfunction：“握草！”你用的物品有毛病，造成了一些不好的事情。不管你打算做什么，都会当着你的面失败。进行一次幸运检定：\n成功——你及时丢掉了它或者快速跑开了，没有受到任何伤害。\n失败——这物品伤到了你的{random.choice(hurt_position)}，也许是它刺破了你的皮肤、擦伤了你、爆炸了，甚至更糟！KP会告知你会受到多少点伤害。",
    f"记忆受损Memory Loss：“我什么也记不得了！”你不管怎么尝试，都回忆不起来刚才经历那些事情的画面。这就好像你记忆的一部分被云雾笼罩一样，你无法回忆起具体的时间、地点和发生的任何事情。遗忘{random.randint(1,3)}条个人推理信息。",
    f"丢失Missing：“等等！它到底哪去了？！”你找某件物品的时候却发现它不见了！这段时间它能跑到哪里去呢？",
    f"有敌人 - 战场经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 警务经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 医务经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 艺术经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 神话经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 邪教徒！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 教育经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人 - 罪犯经历！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有敌人！Enemies!：“不要动...”邪教徒、好事者、深陷其中的人，或者是你们的朋友……",
    f"有野兽！Monsters!：“咿...!!”你们遭遇了{random.randint(1, 7)}只{random.choice(['小型','中型','大型'])}野兽！……",
    f"有怪物！Monsters!：“快逃命啊!”你们遭遇了{random.randint(1, 7)}只{random.choice(['小型', '中型', '大型'])}怪物！……你听见一阵奇怪的尖锐嗡嗡声。你的面前出现了一个光球，还在继续变大。强烈的不祥之感令你无法忍受，因为你有什么东西在穿过你面前的发光大门！骇人的附肢从传送门里出现，向前伸展，感知着空气。强烈的恶臭逐渐弥漫开来。你明显感受到这东西清楚你们的存在……",
    f"有野兽 - 小型！Monsters!：“咿...!!”你们遭遇了一群{random.randint(2,7)}只组成的小型野兽！……",
    f"有野兽 - 中型！Monsters!：“乖狗狗...”你们遭遇了{random.randint(1,3)}只中型野兽！……",
    f"有野兽 - 大型！Monsters!：“快逃命啊！”你们遭遇了{random.randint(1,2)}只大型野兽！……",
    f"有怪物 - 神明！Monsters!：“我的神啊！”看起来有人召唤了一只古神级别的怪物，你们能做的只有逃跑……你听见一阵奇怪的尖锐嗡嗡声。你的面前出现了一个光球，还在继续变大。强烈的不祥之感令你无法忍受，因为你有什么东西在穿过你面前的发光大门！骇人的附肢从传送门里出现，向前伸展，感知着空气。强烈的恶臭逐渐弥漫开来。你明显感受到这东西清楚你们的存在……",
    f"有怪物 - 小型！Monsters!：这是由{random.randint(1,5)}只组成的小型怪物……“有怪物啊！”你听见一阵奇怪的尖锐嗡嗡声。你的面前出现了一个光球，还在继续变大。强烈的不祥之感令你无法忍受，因为你有什么东西在穿过你面前的发光大门！骇人的附肢从传送门里出现，向前伸展，感知着空气。强烈的恶臭逐渐弥漫开来。你明显感受到这东西清楚你们的存在……",
               f"有怪物 - 中型！Monsters!：这是{random.randint(1,2)}只中型怪物……“快逃命啊！”你听见一阵奇怪的尖锐嗡嗡声。你的面前出现了一个光球，还在继续变大。强烈的不祥之感令你无法忍受，因为你有什么东西在穿过你面前的发光大门！骇人的附肢从传送门里出现，向前伸展，感知着空气。强烈的恶臭逐渐弥漫开来。你明显感受到这东西清楚你们的存在……",
               f"有怪物 - 大型！Monsters!：这是一只大型怪物……“快逃命啊！”你听见一阵奇怪的尖锐嗡嗡声。你的面前出现了一个光球，还在继续变大。强烈的不祥之感令你无法忍受，因为你有什么东西在穿过你面前的发光大门！骇人的附肢从传送门里出现，向前伸展，感知着空气。强烈的恶臭逐渐弥漫开来。你明显感受到这东西清楚你们的存在……",
               f"神秘纸条Mysterious Note：“这是什么？”你将手伸进口袋，抽出了一张神秘纸条，但刚才它还不在那里。一定是有人把它放进了你的口袋……你展开纸条，看到的是手写的潦草笔迹：午夜时分到图书馆外面来见我。自己来。",
               f"头脑失控No Longer in Control：【不要向别人透露此事。】“现在，我就是你的主人……”不知何故，有一种超维度寄生虫钻进了你的大脑。这寄生虫现在愉悦地寄生在你的大脑里，控制了你的一举一动。你必须服从它的命令，它一般会让你表现得铁石心肠、残忍无情，只要一有机会就对别人造成痛苦。你的新主子当然不想自己被发现，会阻止你向其他人泄露自己的情况；它也不允许你伤害自己，或者让你引起不必要的注意。KP会告诉你更多内容。",
               f"书里的笔记Notes in a Book：“书里掉出了什么东西……”在浏览书籍时，其中一本书掉出了一张古旧的纸片。这张古旧泛黄的纸片上只写了一组坐标，再无其他。如果你决定搞清这些坐标上到底有什么，KP会告诉你更多的……",
               f"被请喝茶Police Trouble：“但是警官，先听我解释……”你被警方拘留了，他们想就最近发生的某件事对你进行讯问。这肯定只是他们搞错了人，因为局子里的警探始终用另一个姓名来称呼你。他想知道你昨晚去了哪里、干过什么。如果有合适的不在场证明（会被验证的），你会在{random.randint(1,6)+1}小时后被释放。但愿你没做过什么可以被警察发现并对号入罪的行为吧……",
               f"被占据Possessed：【不要向别人透露此事。】“终于有了属于自己的躯体！”你被一个邪恶巫师的精神占据了，他的意志力比你的强大。这个外来精神可以完全控制你的身体和记忆。失去{random.randint(1,20)}点理智值——但是忽略所有“疯狂”结果，直到你从占据中解脱为止（这时立刻执行疯狂）。KP会把新主子的计划详情告诉你；但是你的主子暂时只是维持对“你”的伪装。",
               f"预感Premonition：“不要开门！别问我怎么知道的！”你突然失去了意识。在你失去意识期间，你见到了一个尚未出现的未来场景的幻象。进行一次理智检定(1/1D4)。到你醒来时，事实细节都朦胧不清，但你确信这个场景会出现，你会知道并记住它。你可以持有本卡，并在面临抉择时打出它。若你打出本卡，KP将告知你如何选择最符合你的利益。你持有本卡时只能打出本卡一次，打出本卡之后要交还KP。",
               f"血雨Raining Blood：“这雨！是红的！”转瞬间狂风大作，阴云密布。很快开始下雨了；然而雨水的颜色不应该是红色的啊！鲜血从天而降，几秒钟之内就把你们淋湿了。进行一次理智检定(1/1D4)。",
               f"抢劫现行犯Robbery in Progress ：“抢劫！谁都不许动！”你突然听见有人大嚷；你们已经置身于一场劫案当中了。人们惊慌尖叫，所有人都被要求面朝下卧倒在地上。决定你们的行动：有甲乙两个选项，也可以有更多。\n选项甲：你们顺从并按照要求去做。只要几秒钟，罪犯就会劫走你身上的钱包、珠宝以及任何看上去值钱的物品，并逃之夭夭。\n选项乙：你们拒不从命并挨了一顿打，受到{random.randint(1,6)+1}点伤害，尤其是你的{random.choice(hurt_position)}。幸运的是，你们的反抗行为拖延了时间，警察及时赶到了。罪犯匆忙逃离，没机会抢走你们的物品。",
               f"患病Sickness：“噢噢，我突然觉得好烦！”你变虚弱了。你感觉不对劲。可能是你被传染了什么病，也可能更糟……每天进行一次体质检定，持续{random.randint(1,6)+1}天。若成功，你不损失耐久值；若失败，损失{random.randint(1,4)-1}点耐久值。若任一天的检定出现极难成功，则转天病会痊愈。若你因病失去了一半以上的耐久值，你必须接受医疗（按受到重伤处理）。当你生病时，你的技能和战斗检定均要受到一个惩罚骰。",
               f"蜘蛛蜇咬Spider Bite：“哎哟！”你伸手探查的时候，突然什么东西咬了你一口！你迅速抽回手，看见一只巨大的黑蜘蛛溜走了。进行一次幸运检定：\n成功——受到1点伤害。它只是割破了你的皮肉。\n失败——你的{random.choice(hurt_position)}受到{random.randint(1,10)}点伤害，而且毒液进入了你的循环系统——你会抽搐{random.randint(1,6)}小时（这期间你的技能和战斗检定均要受到一个惩罚骰）。体质检定极难成功可以将蜇咬造成的伤害和中毒时间减半。",
               f"汽车被盗Stolen Car：“我不信！”你返回自己停车的位置却发现它不见了——被盗了！若调查员没有车，将其等同于失窃和差旅问题。调查员将被迫步行到达下一个目的地，除非能够提出另外的解决方案。如果你报警，进行一次幸运检定：\n成功——你的车将在{random.randint(1,10)}小时之后被警察寻获。汽车基本完好，只是油差不多用光了。\n失败——你的车将在{random.randint(1,10)}天之后被警察寻获。它似乎出过车祸，因为它被找到的时候已经破破烂烂，而且被翻了个四脚朝天。KP会决定这辆车还能不能驾驶，以及修理费用的数额。\n注意：如果车内有值钱的物品（包括武器），那么要对车内的每件物品分别进行幸运检定，来决定它是尚在车内还是已经被盗。",
               f"神秘雕像The Mysterious Statue：“这是什么古怪的玩意？”在你探索的一处废墟里，你发现了一个奇怪的雕像。这个雕像是用一种你从未见过的金属铸造的。你清晰地感知到雕像身上存在一种古老的、邪恶的力量。如果你决定搞清雕像上的力量，KP会告诉你更多的……",
               f"车祸！Unexpected：一次意外！司机立刻逃之夭夭。进行一次幸运检定：\n成功——真是走运，只是{random.randint(1,6)}点伤害。\n失败——你的{random.choice(hurt_position)}受到{random.randint(1,6)+1}点伤害，而且你需要进行一个幸运检定来确定是否有其他物品受损。",
               f"威胁Threat：“你们谁也跑不了……”你得罪了某些势力，他们给你发出了威胁。要是你想平安无事，就得解决掉他们。每周进行一次幸运检定，成功意味着你找到了妥善解决这事的办法。失败意味着遭到暗算（{random.randint(1,3)}伤害）；若连续{random.randint(1,6)+1}周失败，你将面临终极对决。",
               f"意外中的幸运Lucky Accident：“差点就要了我的命！”进行一次幸运检定：\n成功——真走运，只是受了{random.randint(1,6)}点伤害。\n失败——{random.choice(hurt_position)}受到{random.randint(1,6)+1}点伤害。幸运的是，幸运检定成功的话，这个意外会有其他方面的补偿。若成功，则补偿值相当于你受的伤害值。",
               f"迷路Lost：“我在哪？”你一不留神，竟然迷失了方向。检定导航，若失败：你没有足够的时间搞清楚应该走哪条路。进行一次幸运检定：\n成功——幸运啊，过了{random.randint(1,6)}个小时，最终回到了正确的路线。\n失败——你在某个荒凉的地方迷了路，这里看起来是个绝妙的伏击地点……",
               f"鬼影Ghostly Vision：“那是啥？”一道若隐若现的鬼影出现在你面前！它的外貌极其恐怖（投影一个随机怪物）。进行一次理智检定 (1D4/1D8)。然后它消失了。",
               f"被盗Stolen：“看看这地方，成了什么样子！”你回到自己的房间时发现你的物品被丢得到处都是，好像被一群牛踩过了一样。很明显，有什么人闯入过，还搜查了你的物品。仅仅将所有物品归回原位就已经要花费不少时间，更别说发现有没有东西被盗、是什么被盗了……",
               f"怪异旋律Strange Melody：“你也听得到吗？”你开始听到一段奇怪而连绵起伏的旋律。你四顾之下并不能找出声音的来源。不论你走到哪里，声音都一直响起。你很快就明白，这旋律并不是由外物，而是你的头脑发出的，而且无论你做什么，都不能减弱或停止这令人疯狂的反复旋律。每天失去1点理智值，直到KP另行决定为止。",
               f"怪异幻象Strange Visions：“看呐！”突然之间，你看到面前出现了一个老流浪汉，你可以保证他刚才绝对没在那里。他饱经风霜的脸上留着花白的长胡子，眼睛直盯着你的方向。他抬起自己的左手，手上有一个由两条圆形线条缠绕成的奇怪印记，好像在向外旋转移动一般。你仿佛被催眠了一样注视着这奇异的几何形状——你也不知道你看了多久。四周似乎没人注意到这老人，不过他张口说道：“你被选中了。”你还没来得及回答，这个老流浪汉就轻笑一声消失了。你看看自己的表，才发现两个小时已经过去了。",
               f"恐惧！The Horror!：“啊啊啊哎哎哎咿咿咿咿咿！”你被突兀而不可阻挡的恐惧感击溃了。进行一次理智检定 (1/1D6)。你必须逃到你来的地方，不得不撤退到你平常能感觉安全和安心的地方。若有多人在场，你会尝试说服其他人。",
               f"头脑中的声音The Voices in Your Head ：“你知道你想……”你越来越注意自己脑子里的声音。这到底是你的意识，还是什么更黑暗的东西？这声音认识你。它了解你最黑暗的想法，希望并劝说你挣脱道德的束缚——无视社会评价的生活。它想要你：想要什么就去拿、去偷、甚至去杀人，毫不利人，专门利己。从现在起直到 KP 另外告知为止，每当你要进行道德抉择时，进行一次幸运检定。如果幸运检定失败，你必须选择恶堕路线，并且表演出最适合你的行动。",
               f"被调包The Wrong Briefcase：“但我绝对肯定这就是我的！”你打开自己的公文包审阅自己的论文和笔记，却发现它们不翼而飞了！其实，尽管这个公文包看上去和你的几乎一模一样，但它肯定是别人的，因为里面只有些霉变的枕头套和一本又旧又破的《白鲸记》。你的所有证据、作品和笔记都丢失了。",
               f"不速之手Unexpected Remains：“这玩意儿是怎么进去的？！”你打开包，惊恐地发现你的物品当中躺着一只鲜血淋漓的断手。谁也说不清这到底是怎么混进来的。进行一次理智检定 (0/1D4)。",
               f"跌倒！WHACK!：“啊啊啊啊啊啊啊啊啊啊啊啊！”你明明躲开了脚下的陷阱，但一阵突然、不可阻挡的看不见的巨力击中了你，把你掷到离你站的位置相当远的地面上。进行一次 DEX 检定：\n成功——受到{random.randint(1,4)}点耐久值伤害并倒地。\n失败——{random.choice(hurt_position)}受到{random.randint(1,6)}点耐久值伤害并昏厥{random.randint(1,10)}轮。",
               f"绑架！Kidnapped!：“我身上没有钱！”进行一次DEX检定：\n成功——你成功逃脱了罪犯，但你的队友并不一定。\n失败——你被一棍打昏，并在未来的{random.randint(1,3)}天内，被蒙着眼囚禁在一个未知的地方。你必须想方设法逃脱，或说服对方释放你，否则，你的队友或关系人将被迫支付赎金，除非你们有更好的办法。"
               ]
        for roles in order:
            if roles != "KP" and roles != "DiceBot":
                if "NPC_name" in roles:
                    role_Chart_detail = role_Chart_at_name.get(roles.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(roles, {}).copy()
                luck = int(role_Chart_detail.get("幸运"))
                if random.randint(1, luck) < random.randint(1, 100): #遭遇战斗/惨事卡
                    print(f"{self.role_entries_name[roles]}#遭遇战斗/惨事卡")
                    self.role_entries[roles].insert("1.0", random.choice(bad)+"\n\n")
                    done.append(roles)
                    for roles2 in order:
                        if roles2 != "KP" and roles2 != "DiceBot" and roles2 not in done:
                            if "NPC_name" in roles2:
                                role_Chart_detail = role_Chart_at_name.get(roles2.split("NPC_name")[0], {}).copy()
                            else:
                                role_Chart_detail = role_Chart.get(roles2, {}).copy()
                            luck = int(role_Chart_detail.get("幸运"))
                            if random.randint(1, 100)*2 <= luck:  # 获取物品/好事卡
                                print(f"{self.role_entries_name[roles2]}#获取物品/好事卡")
                                self.role_entries[roles2].insert("1.0", random.choice(goods) + "\n\n")
                    pass
                    return
                elif random.randint(1, 100) <= luck:  # 获取物品/好事卡
                    print(f"{self.role_entries_name[roles]}#获取物品/好事卡")
                    self.role_entries[roles].insert("1.0", random.choice(goods) + "\n\n")
                    done.append(roles)
                    pass
                else:
                    done.append(roles)

    def send_env_text_to_log(self, sendText=True):
        env_text = self.time_log.get("1.0", tk.END).strip()
        # self.chat_log.insert(tk.END,
        # f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text}\n\n')
        time_info = env_text.split("【时间】")[1]
        date = time_info.split("【日期】")[1]
        time = time_info.split("【地点】")[0]
        time_info = time_info.split("【地点】")[1]
        place = time_info.split("【天气】")[0]
        time_info = time_info.split("【天气】")[1]
        weather = time_info.split("【日期】")[0]
        # 上下午
        if ":" in time:
            if int(time.split(":")[0]) > 12:
                time_ = time + "㏘"
            else:
                time_ = time + "㏂"
            if 6 >= int(time.split(":")[0]) >= 5:
                time_ += "凌晨"
            elif 9 >= int(time.split(":")[0]) >= 7:
                time_ += "早晨"
            elif 11 >= int(time.split(":")[0]) >= 10:
                time_ += "上午"
            elif 13 >= int(time.split(":")[0]) >= 12:
                time_ += "中午"
            elif 17 >= int(time.split(":")[0]) >= 14:
                time_ += "下午"
            elif 19 >= int(time.split(":")[0]) >= 18:
                time_ += "傍晚"
            elif 23 >= int(time.split(":")[0]) >= 20:
                time_ += "夜晚"
            elif 1 >= int(time.split(":")[0]) >= 0:
                time_ += "午夜"
            elif 4 >= int(time.split(":")[0]) >= 2:
                time_ += "深夜"
            time_ += "-"
        else:
            time_ = "???"
        # 季节
        if "/" in date:  # 春✿ 夏♨ 秋♣ 冬♦ 晴☀阴☁雨☂雪☃ ✿❀
            if 5 >= int(date.split("/")[1]) >= 3:
                date_ = "春✿" + date
            elif 8 >= int(date.split("/")[1]) >= 6:
                date_ = "夏♨" + date
            elif 11 >= int(date.split("/")[1]) >= 9:
                date_ = "秋♣" + date
            else:
                date_ = "冬♦" + date
        else:
            date_ = "???"
        # 昼夜
        if "夏" in date_:
            if 19 >= int(time.split(":")[0]) >= 6:
                time_ = time_ + "昼☀"
            else:
                time_ = time_ + "夜◐"
        elif "冬" in date_:
            if 17 >= int(time.split(":")[0]) >= 8:
                time_ = time_ + "昼☀"
            else:
                time_ = time_ + "夜◐"
        else:
            if ":" in time_:
                if 18 >= int(time.split(":")[0]) >= 7:
                    time_ = time_ + "昼☀"
                else:
                    time_ = time_ + "夜◐"
            else:
                time_ = "???"
        # 天气
        if "晴" in weather:  # 晴☀阴☁雨☂雪☃ ✿❀
            weather_ = weather + "☀"
        elif "阴" in weather:
            weather_ = weather + "☁"
        elif "雨" in weather:
            weather_ = weather + "☂"
        elif "雪" in weather:
            weather_ = weather + "☃"
        elif "雾" in weather:
            weather_ = weather + "▓"
        else:
            weather_ = weather
        date_ = date_.replace("Monday", datenamelist[0]).replace("Tuesday", datenamelist[1]).replace("Wednesday",
                                                                                                     datenamelist[
                                                                                                         2]).replace(
            "Thursday",
            datenamelist[3]).replace(
            "Friday", datenamelist[4]).replace("Saturday", datenamelist[5]).replace("Sunday", datenamelist[6])
        env_text_ = f"【时间】{time_}【地点】{place}\n【天气】{weather_}【日期】{date_}"
        env_text = f"【时间】{time}【地点】{place}【天气】{weather}【日期】{date}"
        if sendText:
            self.search_and_delete_insert_symbol()
            self.chat_log.insert(tk.END, f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{env_text_}\n\n')
            self.chat_log.yview(tk.END)
        self.time_log.delete("1.0", tk.END)
        self.time_log.insert("1.0", env_text)
        return env_text_

    def send_message_on_enter(self, event, role=None):
        global datenamelist
        if role == None:
            pass
        elif role == "env":
            self.random_discovery()
            env_text_ = self.send_env_text_to_log()
            self.display_weather_FX(env_text_)
            self.save_settings()
        else:
            self.current_role.set(role)
            # 判断是否同时按下了 Ctrl 键
            if event.state - 4 == 0:  # 4 表示 Ctrl 键的状态值
                return
            # 发送消息
            current_role = role or self.current_role.get()
            self.send_message(current_role)
            self.highlight_role_frame(current_role)

    def send_roll_on_enter(self, event, role=None):
        self.current_role.set(role)
        # 判断是否同时按下了 Ctrl 键
        if event.state - 4 == 0:  # 4 表示 Ctrl 键的状态值
            return
        # 发送消息
        current_role = role or self.current_role.get()
        self.get_and_roll(current_role)
        self.highlight_role_frame_roll(current_role)

    def newline_on_ctrl_enter(self, event):
        # 换行
        current_role = self.current_role.get()
        self.role_entries[current_role].insert(tk.END, "")
        # self.role_entries_roll[current_role].insert(tk.END, "")
        self.highlight_role_frame(current_role)

    def highlight_role_frame(self, role):
        self.search_and_delete_insert_symbol()
        current_role = self.highlighted_role.get()
        # 高亮指定角色的 Frame
        self.highlighted_role.set(role)
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            self.chat_log.insert(tk.END, ">>> 【NPC】" + name_ + "正在输入...")
        else:
            self.chat_log.insert(tk.END, ">>> " + self.role_entries_name[role] + "正在输入...")
        self.chat_log.yview(tk.END)
        for role in self.roles:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        for role in self.new_combat_windows:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        self.role_entries_frame[self.highlighted_role.get()].config(relief=tk.SOLID)
        # self.create_role_frames()
        self.chat_log.config(relief=tk.GROOVE)

    def highlight_role_frame_roll(self, role):
        # 高亮指定角色的 Frame
        self.highlighted_role.set(role)
        for role in self.roles:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        for role in self.new_combat_windows:
            self.role_entries_frame[role].config(relief=tk.GROOVE)
            self.role_entries_roll[role].config(relief=tk.GROOVE)
        self.role_entries_frame[self.highlighted_role.get()].config(relief=tk.SOLID)
        self.role_entries_roll[self.highlighted_role.get()].config(relief=tk.SOLID)
        # self.create_role_frames()

    def on_at_click(self, role):
        # @点击事件处理
        # self.current_at_role.set(role)
        self.avatar_click_event = role
        current_role = self.current_role.get()
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = role.split("NPC_name")[0]
            self.role_entries[current_role].insert(tk.END, "@" + name_ + " ")
        else:
            self.role_entries[current_role].insert(tk.END, "@" + self.role_entries_name[role] + " ")

    def on_at_right_click(self, role):
        # @右键事件处理
        filename_ = ""
        avatar_path = ""
        # self.current_at_role.set(role)
        if role == "chatlog":
            role = "KP"
        self.avatar_click_event = role
        current_role = self.current_role.get()
        options = ["【背景】", "【背景】纯黑", "【BGM】", "【停止BGM】", "【音效】", "【展示图片】", "【撤除图片】", "【特效】震动", "【特效】闪屏", "【高级特效】开始",
                   "【高级特效】结束", "【改变名字】[+(之后出场角色被改成的名字, 留空为恢复)]", "【对话框特效】震动", "【隐藏/显示对话框】",
                   f"【开始角色特效】({self.role_entries_name[role]})", "【结束角色特效(连续和剪影)】", "【更换对话框样式】[+(对话框样式名, 留空为撤除样式)]",
                   "【等待】[+(秒数)]", "【角色退场】[+(角色名, 留空为清退)]"]
        # content_ = simpledialog.askstring("Select Option", "请选择下拉项：", initialvalue=options[0], options=options)
        # 创建新的顶级窗口
        self.top_ask = tk.Toplevel(root)
        # 设置窗口标题
        self.top_ask.title("选择活字命令")
        # 创建下拉菜单
        var = tk.StringVar()
        var.set(options[0])  # 默认选择第一个选项
        dropdown = tk.OptionMenu(self.top_ask, var, *options)
        dropdown.pack(padx=10, pady=10)
        confirm_button = tk.Button(self.top_ask, text="确认", command=lambda: self.confirm_selection(var, role))
        confirm_button.pack(pady=10)

    def create_dropdown(self, role, options, title):
        self.avatar_click_event = role
        current_role = self.current_role.get()
        # 创建新的顶级窗口
        self.top_ask2 = tk.Toplevel(root)
        # 设置窗口标题
        self.top_ask2.title(title)
        # 创建下拉菜单
        var = tk.StringVar()
        var.set(options[0])  # 默认选择第一个选项
        dropdown2 = tk.OptionMenu(self.top_ask2, var, *options)
        dropdown2.pack(padx=20, pady=10)
        confirm_button2 = tk.Button(self.top_ask2, text="确认", command=lambda: self.confirm_selection2(var))
        confirm_button2.pack(pady=10)

        # 让程序等待窗口被关闭
        self.top_ask2.wait_window()
        # return str(var)

    def search_and_delete_insert_symbol(self):
        # 搜索包含 ">>>" 的行的起始索引
        start_index = "1.0"
        while True:
            match_index = self.chat_log.search(">>>", start_index, tk.END)
            if not match_index:
                break
            # 删除包含 ">>>" 的行
            line_start = self.chat_log.index(match_index)
            line_end = self.chat_log.index(match_index + " lineend")
            self.chat_log.delete(line_start, line_end)
            # 更新搜索的起始位置
            start_index = line_end

    def confirm_selection2(self, var):
        self.top_ask2.destroy()  # 销毁窗口
        self.content_ = var.get()

    def confirm_selection(self, var, role):
        self.top_ask.destroy()  # 销毁窗口
        content_ = var.get()

        if (content_ == "【背景】") or ("【BGM】" in content_) or ("音效" in content_) or ("【展示图片】" in content_):
            if "背景" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【背景】图片文件名",
                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg")],
                    initialdir="ReplayResources/BG")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    content = f"【背景】{filename_}"
                    self.display_image(avatar_path, "背景图")
                    if os.path.exists(
                            'ReplayResources/BG/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/BG/' + filename_ + dotextension)
                else:
                    return
            elif "音效" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【音效】音频文件名",
                    filetypes=[("Audio files", "*.mp3;*.wav;*.ogg")],
                    initialdir="ReplayResources/SE")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    play_audio(avatar_path, filename_, 0)
                    content = f"【音效】{filename_}"

                    if os.path.exists(
                            'ReplayResources/SE/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/SE/' + filename_ + dotextension)
                else:
                    return
            elif "BGM" in content_:
                avatar_path = filedialog.askopenfilename(
                    title="选择【BGM】音频文件名",
                    filetypes=[("Audio files", "*.mp3;*.wav;*.ogg")],
                    initialdir="ReplayResources/BGM")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    self.NowBGM.append(filename_)
                    play_audio(avatar_path, filename_)
                    content = f"【BGM】{filename_}"
                    if os.path.exists(
                            'ReplayResources/BGM/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/BGM/' + filename_ + dotextension)
                else:
                    return
            else:
                avatar_path = filedialog.askopenfilename(
                    title="选择【展示图片】图片文件名",
                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg")],
                    initialdir="ReplayResources/HandOut")
                if avatar_path:
                    filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                    if os.path.exists(
                            'ReplayResources/HandOut/' + filename_ + dotextension):
                        pass
                    else:
                        shutil.copyfile(avatar_path,
                                        'ReplayResources/HandOut/' + filename_ + dotextension)
                    self.NowImage.append(filename_)
                    content = f"【展示图片】{filename_}"
                    self.display_image(avatar_path, "HandOut", filename_)
                    content_ = simpledialog.askstring("展示秒数(0为忽略)", "请输入展示秒数(0或不输入为忽略)：")
                    if content_ == "" or content_ == "0":
                        pass
                    else:
                        content = content + "\n【等待】" + content_ + f"\n【撤除图片】{self.NowImage.pop()}"
                else:
                    return
        elif "隐藏/显示对话框" in content_:
            if self.NowDialogState:
                content = "【隐藏对话框】隐藏"
                content_ = simpledialog.askstring("隐藏秒数(0为忽略)", "请输入隐藏秒数(0或不输入为忽略)：")
                if content_ == "" or content_ == "0":
                    self.NowDialogState = False
                else:
                    content = content + "\n【等待】" + content_ + f"\n【隐藏对话框】显示"
                    self.NowDialogState = True
            else:
                content = "【隐藏对话框】显示"
                self.NowDialogState = True
        elif "恢复名字" in content_:
            content = "【改变名字】"

        elif "停止BGM" in content_:
            if len(self.NowBGM) > 1:
                self.create_dropdown(role, self.NowBGM, "请选择要停止的BGM：")
                content_ = self.content_
                if content_:
                    if content_ == "全部":
                        content = f"【停止BGM】"
                        for name in self.NowBGM:
                            if name != "全部":
                                kill_audio(name)
                        self.NowBGM.clear()
                        self.NowBGM.append("全部")
                    else:
                        kill_audio(content_)
                        content = f"【停止BGM】{content_}"
                        self.NowBGM.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的BGM！")
                messagebox.showwarning("警告", "没有使用中的BGM！")
                content = f"【停止BGM】[+(BGM名称)]"

        elif "撤除图片" in content_:
            if self.NowImage:
                self.create_dropdown(role, self.NowImage, "请选择要撤除的图片：")
                content_ = self.content_
                if content_:
                    content = f"【撤除图片】{content_}"
                    self.NowImage.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的图片！")
                messagebox.showwarning("警告", "没有使用中的图片！")
                content = f"【撤除图片】[+(HandOut名称)]"
        elif "【高级特效】开始" in content_:
            _list = ["[自定义...]", "---环境---", "下雨", "下雪", "暴风雪", "大雾", "水下", "---设备---", "监控录像", "胶卷", "黑白电视", "彩色电视",
                     "黑白电影",
                     "---故障---", "轻微故障", "中等故障", "严重故障", "---漫画---", "黑色集中线", "白色集中线", "---事件---", "幻觉", "血迹", "直面古神"]
            self.create_dropdown(role, _list, "请选择要使用的高级特效：")
            content_ = self.content_
            if content_:
                if content_ == "[自定义...]":
                    avatar_path = filedialog.askopenfilename(
                        title="选择【特效】图片文件名",
                        filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.gif;*.apng")],
                        initialdir="ReplayResources/FX")
                    if avatar_path:
                        filename_, dotextension = os.path.splitext(os.path.basename(avatar_path))
                        if os.path.exists(
                                'ReplayResources/FX/' + filename_ + dotextension):
                            pass
                        else:
                            shutil.copyfile(avatar_path,
                                            'ReplayResources/FX/' + filename_ + dotextension)
                        content_ = filename_
                        self.display_FX(avatar_path, filename_)
                else:
                    pass
                content = f"【高级特效】开始{content_}"
                self.NowEffect.append(content_)
            else:
                return
        elif "【高级特效】结束" in content_:
            if self.NowEffect:
                self.create_dropdown(role, self.NowEffect, "请选择要结束的高级特效：")
                content_ = self.content_
                if content_:
                    content = f"【高级特效】结束{content_}"
                    self.NowEffect.remove(content_)
                else:
                    return
            else:
                # print("没有使用中的高级特效！")
                messagebox.showwarning("警告", "没有使用中的高级特效！")
                content = f"【高级特效】结束[+(特效名)]"
        elif "开始角色特效" in content_:
            _list = [f"({self.role_entries_name[role]})震动",
                     f"({self.role_entries_name[role]})左右震动",
                     f"({self.role_entries_name[role]})连续震动",
                     f"({self.role_entries_name[role]})剪影",
                     f"({self.role_entries_name[role]})转圈",
                     f"({self.role_entries_name[role]})连续转圈",
                     f"({self.role_entries_name[role]})跳动",
                     f"({self.role_entries_name[role]})下沉"]
            self.create_dropdown(role, _list, "请选择要进行的角色特效：")
            content_ = self.content_
            if ("连续" in content_) or ("剪影" in content_):
                self.NowCharacterEffect.append(content_)
            content = f"【角色特效】" + content_
        elif "结束角色特效" in content_:
            if self.NowCharacterEffect:
                self.create_dropdown(role, self.NowCharacterEffect, "请选择要结束的角色特效：")
                content_ = self.content_
                if content_:
                    content = f"【角色特效】" + content_.replace("连续", "结束").replace("剪影", "结束剪影")
                    self.NowCharacterEffect.remove(content_)
                else:
                    return
            else:
                content = f"【角色特效】([+(角色名)])结束[+(震动/转圈/剪影)]"
                # print("没有使用中的角色特效！")
                messagebox.showwarning("警告", "没有使用中的角色特效！")
        elif "角色退场" in content_:
            content = "【角色退场】"
        else:
            content = content_

        self.search_and_delete_insert_symbol()
        # 发布到LOG
        self.chat_log.insert(tk.END,
                             f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{content}\n\n')
        self.chat_log.yview(tk.END)

    def on_avatar_right_click(self, role):
        # Icon、Avatar右击事件处理
        avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择[会附加到头像上的]状态Icon文件",
                                                 filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                 initialdir="Images/IconImages")
        if avatar_path:
            if os.path.exists('Images/IconImages/' + role + '-' + self.role_entries_name[role] + '.png'):
                pass
            else:
                shutil.copyfile(avatar_path,
                                'Images/IconImages/' + role + '-' + self.role_entries_name[role] + '.png')

            # 更新头像路径
            self.role_Icon_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_icon_on_avatar(role, frame)
            self.load_and_display_icon(role, frame)
        else:
            self.role_Icon_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_icon_on_avatar(role, frame)
            self.load_and_display_icon(role, frame)

    def on_avatar_click(self, role):
        # 头像点击事件处理
        # self.current_at_role.set(role)
        self.avatar_click_event = role
        current_role = self.current_role.get()
        # self.role_entries[current_role].insert(tk.END, "@" + self.role_entries_name[role] + " ")
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            filename = filedialog.askopenfilename(title="为【" + name_ + "】选择简卡图片",
                                                  filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                  initialdir="Images/SheetImages")
        else:
            filename = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择简卡图片",
                                                  filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                  initialdir="Images/SheetImages")
        _, extension = os.path.splitext(filename)
        filename_, dot = os.path.splitext(os.path.basename(filename))
        if extension == ".apng" or extension == ".APNG":
            filename = self.apng_to_gif(filename, _ + ".gif")
        if filename:
            if "NPC_name" in role:
                pass
            else:
                if os.path.exists(
                        'Images/SheetImages/' + role + '-' + self.role_entries_name[
                            role] + "-" + filename_ + extension):
                    pass
                else:
                    if os.path.exists('Images/SheetImages/' + filename_ + extension):
                        pass
                    else:
                        shutil.copyfile(filename,
                                        'Images/SheetImages/' + role + '-' + self.role_entries_name[
                                            role] + '-' + filename_ + extension)
                        shutil.copyfile(filename,
                                        'Images/SheetImages/' + filename_ + extension)
                if "PL " not in self.role_entries_name[role]:
                    self.infoCanvas_data_by_name[self.role_entries_name[role]] = filename
            self.filename = filename
            self.infoCanvas_data[role] = filename

    def on_Namelabel_hover(self, role):
        # print("enter"+role)
        # 头像悬停事件处理
        if role in self.infoCanvas_data and self.infoCanvas_data[role]:
            self.new_window_infoCanvas = tk.Toplevel(root)
            if "NPC_name" in role:
                if role.split("NPC_name")[1]:
                    name_ = role.split("NPC_name")[1]
                else:
                    name_ = "NPC"
                self.new_window_infoCanvas.title(f"NPC - {name_}的简图")
            else:
                self.new_window_infoCanvas.title(f"{role} - {self.role_entries_name[role]}的简图")
            self.avatar_click_event = role
            current_role = self.current_role.get()

            # 创建图片对象
            self.infoimage = Image.open(self.infoCanvas_data[role])
            width, height = self.infoimage.size
            canvas_h = int(height / 2.2)
            canvas_w = int(width / 2.2)
            self.infoimage = self.infoimage.resize((canvas_w, canvas_h), Image.LANCZOS)  # 调整头像大小
            # self.infoimage.thumbnail((width, height))
            self.infophoto = ImageTk.PhotoImage(self.infoimage)

            self.infocanvas = tk.Canvas(self.new_window_infoCanvas, width=canvas_w + 5, height=canvas_h + 5)
            self.infocanvas.pack()
            # 在 Canvas 上展示图片
            self.infocanvas.create_image(canvas_w / 2 + 5, canvas_h / 2 + 5, image=self.infophoto, tags="image")

    def on_Namelabel_unfocus(self, role):
        # print("leave" + role)
        # 头像离开悬停事件处理
        self.avatar_click_event = role
        current_role = self.current_role.get()
        self.new_window_infoCanvas.destroy()

    def set_codename_window(self):
        self.new_window_codename = tk.Toplevel(root)
        self.new_window_codename.title("编辑代称替换")
        self.name_codename_label = {}
        self.name_codename_entry = {}
        self.name_codename_var_list = {}
        row = 0
        col = 0
        for role in self.roles:
            name_codename_label = tk.Label(self.new_window_codename, text=self.role_entries_name[role])
            name_codename_label.grid(row=row, column=col, padx=5, pady=5, sticky="nsew")
            self.name_codename_label[role] = name_codename_label
            self.name_codename_var = tk.StringVar()
            self.name_codename_var.set(self.codename_by_name[role])
            self.name_codename_var_list[role] = self.name_codename_var
            name_codename_entry = tk.Entry(self.new_window_codename, textvariable=self.name_codename_var)
            name_codename_entry.grid(row=row, column=col+1, padx=5, pady=5, sticky="nsew")
            self.name_codename_entry[role] = name_codename_entry
            row += 1
        name_codename_button = tk.Button(self.new_window_codename, text="保存并关闭", command=lambda: self.on_kill_codename_window())
        name_codename_button.grid(row=row, column=0, columnspan=2, padx=5, pady=5, sticky="nsew")
        self.new_window_codename.protocol("WM_DELETE_WINDOW", lambda: self.on_kill_codename_window())

    def on_kill_codename_window(self):
        for role in self.roles:
            self.codename_by_name[role] = self.name_codename_var_list[role].get()
        # 将角色codename保存到JSON文件
        with open('AppSettings/codename_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.codename_by_name, file, indent=4, ensure_ascii=False)
        self.codename_by_name = load_settings_codename()
        if "_status" not in self.codename_by_name:
            self.codename_by_name["_status"] = "True"
        self.new_window_codename.destroy()

    def output_chat_log(self):
        global log_file_last_name
        for role in self.codename_by_name:
            if role != "_status":
                if self.codename_by_name[role] == self.role_entries_name[role]:
                    self.codename_by_name["_status"] = "False"
                else:
                    self.codename_by_name["_status"] = "True"
                    break
        new_text = simpledialog.askstring("选择输出格式", "请输入输出格式(QQ/活字/回声):", initialvalue="QQ")
        if new_text:
            self.search_and_delete_insert_symbol()
            name_text = simpledialog.askstring("输入文件名称", "请输入LOG保存名称(可留空):", initialvalue=log_file_last_name)
            log_file_last_name = name_text
            # 搜索包含 "===以上可删除===" 的行的起始索引
            start_index = "1.0"
            match_index = self.chat_log.search("===以上可删除===", start_index, tk.END)
            if match_index:
                while True:
                    match_index = self.chat_log.search("===以上可删除===", start_index, tk.END)
                    if not match_index:
                        break
                    # 删除之前的所有行
                    # line_start = self.chat_log.index(match_index)
                    line_end = self.chat_log.index(match_index + " lineend")
                    self.chat_log.delete("1.0", line_end)
                    self.chat_log.delete("1.0", "3.0")
                    # 更新搜索的起始位置
                    start_index = line_end
                # self.chat_log.delete("0.0", "2.0")
            if new_text == "QQ":
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(QQ)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                # 悄悄话系统
                for whispered_roles, whispered_content in self.whisper_data.items():
                    for receive_roles, receive_content in whispered_content.items():
                        for receive_roles_, receive_content_ in receive_content.items():
                            chat_log_content = chat_log_content.replace(receive_roles_, receive_content_)

            elif new_text == "活字":
                if str(self.codename_by_name["_status"]) == "True":
                    codename_by_name_= simpledialog.askstring("是否开启替换", "是否开启CodeName替换?(True/False/Set):",
                                                                              initialvalue=f"{self.codename_by_name['_status']}")
                    if codename_by_name_ != "Set":
                        self.codename_by_name["_status"] = str(codename_by_name_)
                    else:
                        self.set_codename_window()
                        return
                chat_log_content_ = ""
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(活字)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                # 悄悄话系统
                for whispered_roles, whispered_content in self.whisper_data.items():
                    for receive_roles, receive_content in whispered_content.items():
                        for receive_roles_, receive_content_ in receive_content.items():
                            chat_log_content = chat_log_content.replace(receive_roles_, receive_content_)
                chat_log_content = chat_log_content.replace("\n\n\n", "\n\n")

                # pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n(.*?)\n\n'
                pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\n\n'
                # pattern =  r'[\u4e00-\u9fa5a-zA-Z0-9\s`~!@#$%^&*()\-_+={}\[\]|;:\'",<.>/?·！￥……（）—【】、；：‘“’”《》，。？]*\d{1,2}\/\d{1,2}\/\d{2,4}\s\d{1,2}:\d{1,2}:\d{1,2}'
                matches = re.findall(pattern, chat_log_content)
                # 输出转换后的格式
                for match in matches:
                    name = match[0]
                    timestamp = match[1]
                    content = match[2]
                    # print(name)
                    # print(timestamp)
                    # print(content)
                    chat_log_content_ = chat_log_content_ + f"<{name}>{content}\n"
                chat_log_content = chat_log_content_
                # for m in matches:
                # regex_pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s`~!@#$%^&*()\-_+={}\[\]|;:\'",<.>/?·！￥……（）—【】、；：‘“’”《》，。？]*)(\d{1,2}\/\d{1,2}\/\d{2,4}\s\d{1,2}:\d{1,2}:\d{1,2})'
                # match = re.search(regex_pattern, m)
                # if match:
                # 获取捕获组的内容
                # name = match.group(1)  # 括号内第一个捕获组的内容
                # date_time = match.group(2)  # 括号内第二个捕获组的内容
                # chat_log_content = chat_log_content.replace(m,f"<{name}>")
                chat_log_content = chat_log_content.replace("<活字命令>", "")
                chat_log_content = chat_log_content.replace("【差分】", "【请编辑差分】")
                chat_log_content = chat_log_content.replace("<【骰子】>", "【骰子】")
                # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
                # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
                chat_log_content = chat_log_content.replace(";\n", ";")
                # chat_log_content = chat_log_content.replace("\n【骰子】", ";")
                # 使用正则表达式匹配掷骰结果
                # matches = re.findall(r'(\【.*?\】掷骰(?:\{.*?\})?)\d+D\d+=\d+(?:/\d+)?', text)
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    if line and line[0] == "【" and "【骰子】" in line:
                        content = line.replace("【骰子】", "")
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                # 联合检定处理 (【沃姆】掷骰{潜行+意志})1D100=24/[21, 70]:失败/困难成功
                                if "+" in r and ":" in expression and ", " in expression:
                                    skill_ = r.split("{")[1].split("}")[0]
                                    #pc_name = r.split("【")[1].split("】")[0]
                                    skill_list = skill_.split("+")
                                    comment = expression.split(":")[1]
                                    comment = comment.split("/")
                                    expression_ = expression.split(":")[0].split("/[")[0]
                                    number = expression.split(":")[0].split("/[")[1].replace("]", "").split(", ")
                                    k = 0
                                    combine_list = []
                                    for n in number:
                                        combine_ = "(" + r + "：" + skill_list[k] + ")" + "[" + comment[k] + "]" + expression_ + "/" + n
                                        combine_list.append(combine_)
                                        k += 1
                                    content = ";".join(combine_list)
                                    lines[i] = "【骰子】" + content
                chat_log_content = "\n".join(lines)
                matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                while matches:
                    # print(matches)
                    chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;', chat_log_content)
                    matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)

                # chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;\2', chat_log_content)
                # chat_log_content = re.sub(r'(\【骰子\】).*\n\1', r'\1', chat_log_content)
                # 对连续出现的掷骰结果进行合并
                # merged_text = "；".join(matches)
                # 将无说话人的行变更为上一个说话人
                matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)
                while matches:
                    # matches_lastline = re.findall(r'^(?![【<])[^\\n]*$(?<=<([^>]*)>)', chat_log_content, re.MULTILINE)
                    # chat_log_content = re.sub(r'^(?![【<])[^\\n]*$', "<"+matches_lastline + ">" + r'\1', chat_log_content)
                    # 将文本按行拆分成列表
                    lines = chat_log_content.split('\n')
                    # 用于存放行号的列表
                    # line_numbers = []
                    # 遍历每一行，并查找开头不是 "【" 或 "<" 的行
                    for i, line in enumerate(lines):
                        if ("【天气】" in line and "【日期】" in line) or ("【时间】" in line and "【地点】" in line):
                            lines[i] = "<时空广播>" + lines[i]
                        if not re.match(r'^[【<]', line):
                            if line == "":
                                lines.pop(i)
                                break
                            else:
                                # line_numbers.append(i + 1)  # 行号从1开始
                                j = 0
                                for k, l in enumerate(lines):
                                    last_line = re.findall(r'<([^>]*)>', lines[i - 1 - j], re.MULTILINE)
                                    if last_line:
                                        lines[i] = f"<{last_line[0]}>{lines[i]}"
                                        break
                                    elif i - 1 - j < 0:
                                        # print("输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        messagebox.showerror("错误！", "输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        lines = []
                                        matches = []
                                        return
                                    j += 1
                    # chat_log_content = chat_log_content.replace("","")
                    chat_log_content = "\n".join(lines)
                    matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)

                # 高亮文字效果
                chat_log_content = chat_log_content.replace("<【多轮掷骰】>", "【骰子】")
                lines = chat_log_content.split('\n')
                global style_highlight_style
                global style_highlight_weak_style
                global style_highlight_weak_style2
                global style_dice_reason_color
                global style_dice_pcname_color
                global style_dice_skillname_style
                for index, line in enumerate(lines):
                    if (line[0] == "<") and (("【" in line) or ("（" in line) or ("(" in line) or ("[" in line)):
                        name = re.findall(r'<([^>]*)>', line, re.MULTILINE)
                        if name:
                            title = re.findall(r'【([^】]*)】', name[0])
                            if title:
                                name[0] = name[0].replace(f"【{title[0]}】", f"{title[0]}_")
                                line = line.replace(f"【{title[0]}】", f"{title[0]}_")
                            if "【【" in line:
                                title = re.findall(r'【【([^】]*)】', line)
                                line = line.replace(f"【{title[0]}】", f"{title[0]}")
                            content = line.replace(f"<{name[0]}>", "").replace("【【【", "【【").replace("】】】",
                                                                                                    "】】").replace(
                                "【【", "<color=#FF0000><b><抖动>").replace("】】", "</抖动></b></color>").replace("（",
                                                                                                           "<color=#FFFFFF70>（").replace(
                                "）", "）</color>").replace("(", "<color=#FFFFFF70>(").replace(")", ")</color>").replace(
                                "【",
                                style_highlight_style[
                                    0]).replace(
                                "】", style_highlight_style[1]).replace("[", style_highlight_weak_style[0]).replace("]",
                                                                                                                   style_highlight_weak_style[
                                                                                                                       1]).replace(
                                "@", f"{style_highlight_weak_style2[0]}@{style_highlight_weak_style2[1]}")
                            lines[index] = f"<{name[0]}>{content}"
                    if (line[0] == "【") and ("【骰子】" in line):
                        # 把两个=简化成一个
                        content = line.replace("【骰子】", "")
                        content = re.sub(r'=([^;=]+)=', '=', content)
                        content = content.replace("因【", style_dice_reason_color).replace("【", style_dice_pcname_color[
                            0]).replace("】", style_dice_pcname_color[1]).replace("{",
                                                                                 style_dice_skillname_style[0]).replace(
                            "}",
                            style_dice_skillname_style[
                                1])  # .replace(")", "</color>").replace("）", "</color>").replace("（", "<color=#FFFFFF70>").replace("(", "<color=#FFFFFF70>")
                        # 将理由中的“D”替换为“🎲”
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                if "D" in r or "d" in r:
                                    reason_ = r
                                    reason_ = reason_.replace("D", "◈").replace("d", "◈")
                                    content = content.replace(r, reason_)
                        lines[index] = f"【骰子】{content}"
                chat_log_content = "\n".join(lines)
                # 替换codename
                if str(self.codename_by_name["_status"]) == "True":
                    for role in self.codename_by_name:
                        if role != "_status":
                            if "【" in self.codename_by_name[role]:
                                self.codename_by_name[role] = self.codename_by_name[role].replace("【", "").replace("】",
                                                                                                                   "_")
                            chat_log_content = chat_log_content.replace(f"<{self.role_entries_name[role]}>",
                                                                        f"<{self.codename_by_name[role]}>").replace(f"@{self.role_entries_name[role]}",
                                                                        f"@{self.codename_by_name[role]}").replace(f"与{self.role_entries_name[role]}对抗",
                                                                        f"与{self.codename_by_name[role]}对抗").replace(f"对抗{self.role_entries_name[role]}",
                                                                        f"对抗{self.codename_by_name[role]}").replace(f"【{self.role_entries_name[role]}】",
                                                                        f"【{self.codename_by_name[role]}】").replace(f"[{self.role_entries_name[role]}]",
                                                                        f"[{self.codename_by_name[role]}]")

            elif new_text == "回声":
                global EnterCharacters
                if str(self.codename_by_name["_status"]) == "True":
                    codename_by_name_ = simpledialog.askstring("是否开启替换", "是否开启CodeName替换?(True/False/Set):",
                                                               initialvalue=f"{self.codename_by_name['_status']}")
                    if codename_by_name_ != "Set":
                        self.codename_by_name["_status"] = str(codename_by_name_)
                    else:
                        self.set_codename_window()
                        return
                EnterCharacters = int(simpledialog.askstring("是否开启自动换行", "自动换行字数(0为不换行):",
                                                             initialvalue="30"))
                chat_log_content_ = ""
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(回声)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                # 悄悄话系统
                for whispered_roles, whispered_content in self.whisper_data.items():
                    for receive_roles, receive_content in whispered_content.items():
                        for receive_roles_, receive_content_ in receive_content.items():
                            chat_log_content = chat_log_content.replace(receive_roles_, receive_content_)
                chat_log_content = chat_log_content.replace("\n\n\n", "\n\n")
                pattern = r'([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\s(\d{4}/\d{2}/\d{2}\s\d{2}:\d{2}:\d{2})\n([\u4e00-\u9fa5a-zA-Z0-9\s\S]+?)\n\n'
                matches = re.findall(pattern, chat_log_content)
                # 输出转换后的格式
                for match in matches:
                    name = match[0]
                    content = match[2]
                    chat_log_content_ = chat_log_content_ + f"<{name}>{content}\n"
                chat_log_content = chat_log_content_
                # 获取捕获组的内容
                chat_log_content = chat_log_content.replace("<活字命令>", "")
                chat_log_content = chat_log_content.replace("【差分】", "【请编辑差分：格式：[说话人.差分]】")
                chat_log_content = chat_log_content.replace("<【骰子】>", "【骰子】")
                # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
                # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
                chat_log_content = chat_log_content.replace(";\n", ";")
                # 使用正则表达式匹配掷骰结果
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    if line and line[0] == "【" and "【骰子】" in line:
                        content = line.replace("【骰子】", "")
                        reason = re.findall(r'\(([^)]*)\)', content)
                        if reason:
                            for r in reason:
                                expression = content.replace("(" + r + ")", "")
                                # 联合检定处理 (【沃姆】掷骰{潜行+意志})1D100=24/[21, 70]:失败/困难成功
                                if "+" in r and ":" in expression and ", " in expression:
                                    skill_ = r.split("{")[1].split("}")[0]
                                    # pc_name = r.split("【")[1].split("】")[0]
                                    skill_list = skill_.split("+")
                                    comment = expression.split(":")[1]
                                    comment = comment.split("/")
                                    expression_ = expression.split(":")[0].split("/[")[0]
                                    number = expression.split(":")[0].split("/[")[1].replace("]", "").split(", ")
                                    k = 0
                                    combine_list = []
                                    for n in number:
                                        combine_ = "(" + r + "：" + skill_list[k] + ")" + "[" + comment[k] + "]" + expression_ + "/" + n
                                        combine_list.append(combine_)
                                        k += 1
                                    content = ";".join(combine_list)
                                    lines[i] = "【骰子】" + content
                chat_log_content = "\n".join(lines)
                matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                while matches:
                    # print(matches)
                    chat_log_content = re.sub(r'(\【骰子】.*?)\n(\【骰子】)', r'\1;', chat_log_content)
                    matches = re.findall(r'(\【骰子】.*?)\n(\【骰子】)', chat_log_content)
                # 对连续出现的掷骰结果进行合并
                # 将无说话人的行变更为上一个说话人
                matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)
                while matches:
                    # 将文本按行拆分成列表
                    lines = chat_log_content.split('\n')
                    # 用于存放行号的列表
                    # 遍历每一行，并查找开头不是 "【" 或 "<" 的行
                    for i, line in enumerate(lines):
                        if ("【天气】" in line and "【日期】" in line) or ("【时间】" in line and "【地点】" in line):
                            lines[i] = "<时空广播>" + lines[i]
                        if not re.match(r'^[【<]', line):
                            if line == "":
                                lines.pop(i)
                                break
                            else:
                                j = 0
                                for k, l in enumerate(lines):
                                    last_line = re.findall(r'<([^>]*)>', lines[i - 1 - j], re.MULTILINE)
                                    if last_line:
                                        lines[i] = f"<{last_line[0]}>{lines[i]}"
                                        break
                                    elif i - 1 - j < 0:
                                        # print("输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        messagebox.showerror("错误！", "输出失败，请删除LOG框内的程序提示或检查首行是否具备说话人！")
                                        return
                                    j += 1
                    chat_log_content = "\n".join(lines)
                    matches = re.findall(r'^(?![【<])[^\\n]*$', chat_log_content, re.MULTILINE)

                # 高亮文字效果
                chat_log_content = chat_log_content.replace("<【多轮掷骰】>", "【骰子】")
                lines = chat_log_content.split('\n')
                global style_shock_echo
                global style_weaken_echo
                global style_highlight_style_echo
                global style_highlight_weak_style_echo
                global style_highlight_weak_style2_echo
                global style_dice_reason_color_echo
                global style_dice_pcname_color_echo
                global style_dice_skillname_style_echo
                global style_dice_icon
                for index, line in enumerate(lines):

                    if (line[0] == "<") and (("【" in line) or ("（" in line) or ("(" in line) or ("[" in line)):
                        name = re.findall(r'<([^>]*)>', line, re.MULTILINE)
                        title = re.findall(r'【([^】]*)】', name[0])
                        if title:
                            name[0] = name[0].replace(f"【{title[0]}】", f"{title[0]}_")
                            line = line.replace(f"【{title[0]}】", f"{title[0]}_")
                        if "【【" in line:
                            title = re.findall(r'【【([^】]*)】', line)
                            line = line.replace(f"【{title[0]}】", f"{title[0]}")
                        if name:
                            content = line.replace(f"<{name[0]}>", "").replace("[", style_highlight_weak_style2_echo[
                                0]).replace("]", style_highlight_weak_style2_echo[1]).replace("【【【", "【【").replace(
                                "】】】", "】】").replace(
                                "【【", style_shock_echo[0]).replace("】】", style_shock_echo[1]).replace("（",
                                                                                                      f"{style_weaken_echo[0]}（").replace(
                                "）", f"）{style_weaken_echo[1]}").replace("(", f"{style_weaken_echo[0]}(").replace(")",
                                                                                                                  f"){style_weaken_echo[1]}").replace(
                                "【", style_highlight_style_echo[0]).replace(
                                "】", style_highlight_style_echo[1]).replace("@",
                                                                            f"{style_highlight_weak_style2_echo[0]}@{style_highlight_weak_style2_echo[1]}")
                            lines[index] = f"[{name[0].replace('【', '').replace('】', '_')}]:{content}"
                    if (line[0] == "【") and ("【骰子】" in line):
                        # 把两个=简化成一个
                        content = line.replace("【骰子】", "")
                        if "SAN CHECK" in content:
                            sc_result = re.findall(r'=([^=]*)=', content, re.MULTILINE)
                            content = re.sub(r'=([^;=]+)=', '=', content)
                            if sc_result:
                                content = re.sub(r'=([^;=]+);?', "=" + sc_result[0], content)
                        else:
                            content = re.sub(r'=([^;=]+)=', '=', content)
                        content = content.replace("因【", style_dice_reason_color_echo).replace("【",
                                                                                              style_dice_pcname_color_echo[
                                                                                                  0]).replace("】",
                                                                                                              style_dice_pcname_color_echo[
                                                                                                                  1]).replace(
                            "{",
                            style_dice_skillname_style_echo[0]).replace("}", style_dice_skillname_style_echo[
                            1])  # .replace(")", "</color>").replace("）", "</color>").replace("（", "<color=#FFFFFF70>").replace("(", "<color=#FFFFFF70>")
                        # 分解骰子语句格式：(理由)[结果]公式=投出值/鉴定值;(理由)[结果]公式=投出值;(理由)公式=投出值 → 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                        content_parse = content.replace(style_dice_reason_color_echo, "→因").replace(
                            style_dice_skillname_style_echo[0], style_dice_icon[2] + "{").replace(
                            style_dice_skillname_style_echo[1], "}").replace(
                            style_dice_pcname_color_echo[0], "").replace(style_dice_pcname_color_echo[1], "")
                        if ";" in content_parse:
                            # 多个合并骰子
                            exp_ = []
                            EchoDice_ = []
                            dicelines = content_parse.split(';')
                            for dice in dicelines:
                                if "(" in dice:
                                    reason = re.findall(r'\(([^)]*)\)', dice, re.MULTILINE)[0]
                                else:
                                    reason = " "
                                if "{" in reason:
                                    skillname = re.findall(r'\{([^}]*)}', reason, re.MULTILINE)[0]
                                else:
                                    skillname = " "
                                result = dice.split('=')[1]
                                if "/" in result:
                                    result = result.split('/')[0]
                                else:
                                    pass
                                comment = re.findall(r'\[(.*?)\]', dice, re.MULTILINE)
                                if comment:
                                    expression = re.findall(r']([^=]*)=', dice, re.MULTILINE)
                                else:
                                    expression = re.findall(r'\)([^=]*)=', dice, re.MULTILINE)
                                    comment = [" "]
                                exp_number = str(eval(expression[0].replace("D", "*")))
                                if "/" in dice.split('=')[1]:
                                    objective = dice.split('=')[1].split('/')[1]
                                else:
                                    objective = exp_number
                                # print(reason[0] + "\n" + expression[0] + "\n" + comment[0] + "\n" + result + "\n" + objective + skillname)
                                dicebot_name = self.role_entries_name["DiceBot"]
                                exp_.append(
                                    f"<table:{dicebot_name}.Reason>:{reason}\n<table:{dicebot_name}.Expression>:{expression[0]}\n<table:{dicebot_name}.Comment>:{comment[0]}\n<table:{dicebot_name}.Result>:{result}\n<table:{dicebot_name}.Objective>:{objective}\n<table:{dicebot_name}.Skillname>:{skillname}\n")
                                # 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                                EchoDice_.append(f"({reason},{exp_number},{objective},{result})")
                            # exp = f"[{self.role_entries_name['DiceBot']}]掷骰中...\n".join(exp_)
                            exp = (f"==={self.role_entries_name['DiceBot']}===:掷骰中..." + "{掷骰}\n").join(exp_)
                            # 描述，骰子总面数，检定值，投出值(伊可-智力检定,100,50,30)
                            EchoDice = "<dice>:" + ",".join(EchoDice_)
                        else:
                            # 单个骰子
                            if "(" in content_parse:
                                reason = re.findall(r'\(([^)]*)\)', content_parse, re.MULTILINE)[0]
                            else:
                                reason = " "
                            if "{" in reason:
                                skillname = re.findall(r'\{([^}]*)}', reason, re.MULTILINE)[0]
                            else:
                                skillname = " "
                            comment = re.findall(r'\[(.*?)\]', content_parse, re.MULTILINE)
                            if comment:
                                expression = re.findall(r']([^=]*)=', content_parse, re.MULTILINE)
                            else:
                                expression = re.findall(r'\)([^=]*)=', content_parse, re.MULTILINE)
                                comment = [" "]
                            exp_number = str(eval(expression[0].replace("D", "*")))
                            result = content_parse.split('=')[1]
                            if "/" in result:
                                result = result.split('/')[0]
                            else:
                                pass
                            if "/" in content_parse.split('=')[1]:
                                objective = content_parse.split('=')[1].split('/')[1]
                            else:
                                objective = exp_number
                            # print(reason + "\n" + expression[0] + "\n" + comment[0] + "\n" + result + "\n" +objective + "\n" + skillname)
                            dicebot_name = self.role_entries_name["DiceBot"]
                            exp = f"<table:{dicebot_name}.Reason>:{reason}\n<table:{dicebot_name}.Expression>:{expression[0]}\n<table:{dicebot_name}.Comment>:{comment[0]}\n<table:{dicebot_name}.Result>:{result}\n<table:{dicebot_name}.Objective>:{objective}\n<table:{dicebot_name}.Skillname>:{skillname}\n"
                            EchoDice = f"<dice>:({reason},{exp_number},{objective},{result})"
                        # lines[index] = exp + f"[dice]:{content.replace(';',',')} + {EchoDice}"
                        lines[
                            index] = exp + f"[{self.role_entries_name['DiceBot']}]:掷骰中..." + "{掷骰}\n" + EchoDice.replace(
                            "{", "").replace("}", "").replace("SAN CHECK", "SC").replace("掷骰", "")
                    if lines[index][0] == "<" and ("<dice>:" not in lines[index]):
                        name = re.findall(r'<([^>]*)>', lines[index], re.MULTILINE)
                        if len(name) > 0:
                            content = lines[index].replace(f"<{name[0]}>", "")
                            lines[index] = f"[{name[0]}]:{content}"
                    if "【停止BGM】" in line:
                        lines[index] = "<BGM>:stop"
                    if "【高级特效】结束" in line or "【撤除图片】" in line:
                        lines[index] = "<animation>:NA"
                    if line == "【更换样式】":
                        lines[index] = "<bubble>:NA"
                    if "【音效】" in line:
                        lines[index - 1] = lines[index - 1] + "{" + line + "}"
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace("【等待】", "<wait>:")
                chat_log_content = chat_log_content.replace("【更换样式】", "<bubble>:")
                chat_log_content = chat_log_content.replace("【背景】", "<background>:")
                chat_log_content = chat_log_content.replace("【背景】纯黑", "<background>:black")
                chat_log_content = chat_log_content.replace("【背景】", "<background>:")
                chat_log_content = chat_log_content.replace("【BGM】", "<BGM>:")
                chat_log_content = chat_log_content.replace("【高级特效】开始", "<animation>:")
                chat_log_content = chat_log_content.replace("【特效】", "<animation>:")
                # 多个说出相同台词的说话人可合并 [a]aaa [b]aaa → [a,b]aaa
                # 多个连续展示图片可合并
                lines = chat_log_content.split('\n')
                # 用于存放行号的列表
                # 遍历每一行，查找开头是 "[" 的行、查找开头是【展示图片】的行
                merged_speak = []
                speak_content = ""
                last_speak_content = ""
                now_name = ""
                last_name = ""
                merged_speak_del = []
                for i, line in enumerate(lines):
                    if line[0] == "[":
                        name = re.findall(r'\[([^\]]*)\]', line)
                        # 如果说话人在角色列表，在句尾加语音合成标记"{*}"
                        for PLindex, PLname in self.role_entries_name.items():
                            if "【" in PLname:
                                PLname = PLname.replace("【", "").replace("】", "_")
                            #print(name[0])
                            #print(PLname)
                            if name[0] == PLname:
                                # 超过设置字数，添加自动换行标记"#",且将句尾标点不置于首位
                                if EnterCharacters > 0:
                                    lines_ = line.replace(f"[{name[0]}]:", "")
                                    lines_len = lines_
                                    deletechars = re.findall(r'\[([^\]]*)\]', lines_)
                                    if deletechars:
                                        for de in deletechars:
                                            lines_len = lines_len.replace(de, "")
                                    lines_result = ""
                                    if len(lines_len) > EnterCharacters:
                                        for a in range(0, len(lines_), EnterCharacters):
                                            chunk = lines_[a:a + EnterCharacters]
                                            if chunk.rstrip().endswith((
                                                    " ", ",", ".", "!", "?", "。", "；", "，", ";", "”",
                                                    "’", "、", "！", "？", "）", ")", "】", "]", "：",
                                                    ":")):
                                                lines_result += chunk + "#"
                                            else:
                                                index = -1
                                                if any(punctuation in lines_ for punctuation in (
                                                        " ", ",", ".", "!", "?", "。", "；", "，", ";", "”", "’", "、", "！",
                                                        "？",
                                                        "）", ")", "】", "]", "：",
                                                        ":")):  # 如果 lines[i] 中包含任何一个标点符号，则执行相应的操作
                                                    for punctuation in (
                                                            " ", ",", ".", "!", "?", "。", "；", "，", ";", "”", "’", "、",
                                                            "！",
                                                            "？", "）", ")", "】", "]", "：", ":"):
                                                        temp_index = chunk.rfind(punctuation)
                                                        if temp_index > index:
                                                            index = temp_index
                                                    if index == -1:  # 如果没有空格，则直接插入
                                                        lines_result += chunk + "#"
                                                    else:
                                                        lines_result += chunk[:index] + chunk[index] + "#" + chunk[
                                                                                                             index + 1:]  # 在最后一个符号之后插入分隔符
                                        if lines_result[len(lines_result) - 1] == "#":
                                            lines[i] = f"[{name[0]}]:" + lines_result[:-1]
                                        else:
                                            lines[i] = f"[{name[0]}]:" + lines_result
                                lines[i] += "{*}"
                        last_speak_content = speak_content
                        speak_content = line.replace(f"[{name[0]}]", "")
                        #print(last_speak_content)
                        #print(speak_content)
                        last_last_name = last_name
                        last_name = now_name
                        now_name = re.findall(r'\[([^\]]*)\]:', line)[0]
                        if speak_content != last_speak_content:
                            if len(merged_speak) >= 1:
                                #print(line)
                                #print(lines[i])
                                #if i > 0:
                                    #merged_speak.append(re.findall(r'\[([^\]]*)\]:', lines[i-1])[0])
                                merged_speak.append(last_last_name)
                                #merged_speak.append(last_name)
                                merged_speak.append(now_name)
                                #print(re.findall(r'\[([^\]]*)\]:', line)[0])
                                if self.role_entries_name["DiceBot"] in merged_speak:
                                    merged_speak.remove(self.role_entries_name["DiceBot"])
                                merged_speak.insert(0, merged_speak[len(merged_speak) - 1])
                                merged_speak.pop(len(merged_speak) - 1)
                                #merged_speak[len(merged_speak) - 1] = merged_speak[0]
                                startpoint = merged_speak_del[0] - 1
                                for j in merged_speak_del:
                                    lines[j] = "===删除行==="
                                    #i -= 1
                                lines[startpoint] = f"[{','.join(merged_speak)}]{last_speak_content}"
                                print(merged_speak)
                            merged_speak_del.clear()
                            merged_speak.clear()
                        else:
                            merged_speak.append(name[0])
                            merged_speak_del.append(i)
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace(f"==={self.role_entries_name['DiceBot']}===",
                                                            f"[{self.role_entries_name['DiceBot']}]")
                lines = chat_log_content.split('\n')
                merged_showImg = []
                merged_showImg_del = []
                for i, line in enumerate(lines):
                    if "【展示图片】" not in line:
                        if len(merged_showImg) > 1:
                            startpoint = merged_showImg_del.pop(0)
                            for j in merged_showImg_del:
                                lines[j] = "===删除行==="
                            lines[startpoint] = f"【展示图片】({','.join(merged_showImg)})"
                        merged_showImg_del.clear()
                        merged_showImg.clear()
                    else:
                        # 匹配连续多个"【展示图片】"开头的文字内容
                        merged_showImg.append(line.replace("【展示图片】", ""))
                        merged_showImg_del.append(i)
                chat_log_content = "\n".join(lines)
                chat_log_content = chat_log_content.replace("【展示图片】", "<animation>:")

                # 搜索包含 "===删除行===" 的行的起始索引
                start_index = 0
                match_index = chat_log_content.find("===删除行===", start_index)
                if match_index:
                    while True:
                        match_index = chat_log_content.find("===删除行===", start_index)
                        if match_index == -1:
                            break
                        line_start = chat_log_content.rfind("\n", 0, match_index) + 1
                        line_end = chat_log_content.find("\n", match_index)
                        chat_log_content = chat_log_content[:line_start] + chat_log_content[line_end + 1:]
                        # 更新搜索的起始位置
                        start_index = line_start

                # 处理状态变化：【xxx】的状态[已减少1点HP]：11/12:HP → <table:角色.HP>:50/50
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):
                    exp = ""
                    if "的状态[" in line:
                        name = re.findall(r'【([^】]*)】', line, re.MULTILINE)[0]
                        item = re.search(r':([^:]+)$', line)
                        if item:
                            item = item.group(1)
                        value = re.findall(r'：([^:]*):', line, re.MULTILINE)[0]
                        exp = f"<table:{name}.{item}>:{value}"
                    if exp:
                        lines[i] = exp + "\n" + lines[i]
                chat_log_content = "\n".join(lines)
                # 处理时空状态变化：【时间】02:54【地点】多伦多大学【天气】阴【日期】2024/03/01 Friday → <table:时空广播.Time>、.Place .Date .Weather
                lines = chat_log_content.split('\n')
                for i, line in enumerate(lines):  # 白天☀ 夜晚☆ 上午㏂ 下午㏘ 春✿夏♨秋♣冬♦
                    exp = ""
                    if "【时间】" in line and "【地点】" in line:
                        time_info1 = line.replace("[时空广播]:", "").replace(style_highlight_style_echo[0], "【").replace(
                            style_highlight_style_echo[1], "】")
                        time_info2 = lines[i + 1].replace("[时空广播]:", "").replace(style_highlight_style_echo[0],
                                                                                 "【").replace(
                            style_highlight_style_echo[1], "】")
                        time_info1 = time_info1.split("【时间】")[1]
                        time_info2 = time_info2.split("【天气】")[1]
                        date_ = time_info2.split("【日期】")[1]
                        time_ = time_info1.split("【地点】")[0]
                        place_ = time_info1.split("【地点】")[1]
                        weather_ = time_info2.split("【日期】")[0]
                        exp = f"<table:时空广播.Time>:{time_}\n<table:时空广播.Place>:{place_}\n<table:时空广播.Date>:{date_}\n<table:时空广播.Weather>:{weather_}"
                    if exp:
                        lines[i] = exp + "\n" + lines[i]
                chat_log_content = "\n".join(lines)
                # 替换codename
                if str(self.codename_by_name["_status"]) == "True":
                    for role in self.codename_by_name:
                        if role != "_status":
                            if "【" in self.codename_by_name[role]:
                                self.codename_by_name[role] = self.codename_by_name[role].replace("【", "").replace("】",
                                                                                                                   "_")
                            chat_log_content = chat_log_content.replace(f"[{self.role_entries_name[role]}]:",
                                                                        f"[{self.codename_by_name[role]}]:").replace(f"@{self.role_entries_name[role]}",
                                                                        f"@{self.codename_by_name[role]}").replace(f"与{self.role_entries_name[role]}对抗",
                                                                        f"与{self.codename_by_name[role]}对抗").replace(f"对抗{self.role_entries_name[role]}",
                                                                        f"对抗{self.codename_by_name[role]}").replace(f"【{self.role_entries_name[role]}】",
                                                                        f"【{self.codename_by_name[role]}】").replace(f"[{self.role_entries_name[role]}]",
                                                                        f"[{self.codename_by_name[role]}]")

            else:
                timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
                filename = f"(QQ)_{timestamp}.txt"
                chat_log_content = self.chat_log.get("1.0", tk.END)
                # 悄悄话系统
                for whispered_roles, whispered_content in self.whisper_data.items():
                    for receive_roles, receive_content in whispered_content.items():
                        for receive_roles_, receive_content_ in receive_content.items():
                            chat_log_content = chat_log_content.replace(receive_roles_, receive_content_)
            filename = "【" + name_text + "】" + filename
            try:
                # 尝试写入文件
                with open(filename, "w", encoding='utf-8') as file:
                    file.write(chat_log_content)
                print(f'{datetime.now().strftime("%Y-%m-%d_%H-%M-%S")}：LOG[{filename}]输出成功！')
            except:
                # 出错则弹出警告
                messagebox.showerror("错误！", "无法输出LOG文件！")
                return

    def output_html_log(self):
        timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
        filename = f"chat_log_{timestamp}.html"
        chat_log_content = self.chat_log.get("1.0", tk.END)
        # 悄悄话系统
        for whispered_roles, whispered_content in self.whisper_data.items():
            for receive_roles, receive_content in whispered_content.items():
                for receive_roles_, receive_content_ in receive_content.items():
                    chat_log_content = chat_log_content.replace(receive_roles_, receive_content_)
        with open(filename, "w", encoding='utf-8') as file:
            file.write(f'<html><head></head><body>{chat_log_content}</body></html>')

    def choose_Icon(self, role):
        avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择状态Icon文件",
                                                 filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                 initialdir="Images/IconImages")
        if avatar_path:
            _, extension = os.path.splitext(avatar_path)
            filename, dot = os.path.splitext(os.path.basename(avatar_path))
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
            if os.path.exists('Images/IconImages/' + filename + extension):
                pass
            else:
                shutil.copyfile(avatar_path,
                                'Images/IconImages/' + filename + extension)

            # 更新头像路径
            self.role_Icon_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_icon(role, frame)
        else:
            self.role_Icon_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_icon(role, frame)

    def choose_avatar(self, role):
        if role in self.role_dir_path:
            initDir = self.role_dir_path[role]
        else:
            initDir = "Images/AvatarImages"
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            avatar_path = filedialog.askopenfilename(title="为【" + name_ + "】选择头像文件",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir=initDir)
        else:
            avatar_path = filedialog.askopenfilename(title="为【" + self.role_entries_name[role] + "】选择头像文件",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir=initDir)
        if avatar_path:
            _, extension = os.path.splitext(avatar_path)
            filename, dot = os.path.splitext(os.path.basename(avatar_path))
            self.role_dir_path[role] = os.path.dirname(avatar_path)
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
            if "NPC_name" in role:
                self.role_avatar_paths[role] = avatar_path
                frame = self.role_entries[role].master
                self.load_and_display_avatar(role, frame)
                return
            if os.path.exists(
                    'Images/AvatarImages/' + role + '-' + self.role_entries_name[role] + '-' + filename + extension):
                pass
            else:
                if os.path.exists('Images/AvatarImages/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/AvatarImages/' + role + '-' + self.role_entries_name[
                                        role] + '-' + filename + extension)
                    shutil.copyfile(avatar_path,
                                    'Images/AvatarImages/' + filename + extension)
            # 发布到LOG
            self.search_and_delete_insert_symbol()
            self.chat_log.insert(tk.END,
                                 f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【差分】<{self.role_entries_name[role]}({filename})>\n\n')
            self.chat_log.yview(tk.END)
            # 更新头像路径
            self.role_avatar_paths[role] = avatar_path
            # 加载并显示头像
            frame = self.role_entries[role].master
            self.load_and_display_avatar(role, frame)
        else:
            self.role_avatar_paths[role] = ""
            frame = self.role_entries[role].master
            self.load_and_display_avatar(role, frame)
        if self.role_entries_name[role] in role_Chart_at_name:
            role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = self.role_avatar_paths[role]

    def load_and_display_avatar(self, role, frame):
        self.Avatar = ""
        if role in self.role_avatar_paths:
            # 加载头像
            image_path = self.role_avatar_paths[role]
            if image_path:
                if "NPC_name" in role:
                    pass
                else:
                    if self.role_entries_name[role] in role_Chart_at_name:
                        role_Chart_at_name[self.role_entries_name[role]]["_AvatarPath"] = image_path
                image = Image.open(image_path)
                image_temp = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size

                # 根据宽高比设置头像大小
                if math.fabs(width - height) <= 10:
                    image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小
                elif math.fabs(width - height) <= 400:
                    image = image.resize((50, 80), Image.LANCZOS)
                else:
                    image = image.resize((50, 100), Image.LANCZOS)

                tk_image = ImageTk.PhotoImage(image)
                label = tk.Label(frame, image=tk_image)
                label.image = tk_image
                label.grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                # 头像点击事件绑定
                label.bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                frame = self.role_entries[role].master
                label.bind("<Button-3>",
                           lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":

                    # gif = imageio.mimread(image_path)
                    self.Iconcanvas[role] = tk.Canvas(frame, width=20, height=20)
                    self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                    # self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)
                    if math.fabs(width - height) <= 10:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    elif math.fabs(width - height) <= 400:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 80), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    else:
                        self.frames_avatar[role] = [ImageTk.PhotoImage(frame.resize((50, 100), Image.LANCZOS)) for frame
                                                    in ImageSequence.Iterator(image_temp)]
                    # 获取 GIF 图片的所有帧

                    # self.frames_avatar[role] = image_temp
                    # self.frames_avatar[role] = []
                    # for temp_frame in ImageSequence.Iterator(image_temp):
                    # 转换为 RGBA 模式并添加到列表中
                    # frame_rgba = temp_frame.convert("RGBA")
                    # frame_rgba = ImageTk.PhotoImage(frame_rgba)
                    # self.frames_avatar[role].append(frame_rgba)

                    # 显示 GIF 图片的第一帧
                    self.current_frame_avatar[role] = self.Iconcanvas[role].create_image(0, 0, anchor=tk.NW,
                                                                                         image=self.frames_avatar[role][
                                                                                             0])
                    # 播放 GIF 动画
                    self.animate(0, self.Iconcanvas[role], self.current_frame_avatar[role], self.frames_avatar[role])

                    self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                    self.Iconcanvas[role].bind("<Button-3>",
                                               lambda event, role=role, frame=frame: self.hide_icon_on_avatar(
                                                   role, frame))

                    self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                else:
                    self.Iconcanvas[role] = tk.Canvas(frame, width=20, height=20)
                    self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")
                    self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)

                    self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                    self.Iconcanvas[role].bind("<Button-3>",
                                               lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role,
                                                                                                              frame))

                    self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

            else:
                if self.Avatar:
                    self.Iconcanvas[role].delete(self.Avatar)
                self.Iconcanvas[role] = tk.Canvas(frame, width=0, height=0)
                self.Iconcanvas[role].grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                self.Iconcanvas[role].bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                self.Iconcanvas[role].bind("<Button-3>",
                                           lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                self.Iconcanvas[role].bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                self.Iconcanvas[role].bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

                label = tk.Label(frame)
                label.grid(row=1, column=0, padx=0, pady=0, sticky="nsew")

                label.bind("<Button-1>", lambda event, role=role: self.choose_avatar(role))
                label.bind("<Button-3>", lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))

                label.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))

    def hide_icon_on_avatar(self, role, frame):
        if role in self.Icon_on_avatar:
            self.Iconcanvas[role].delete(self.Icon_on_avatar.pop(role))
            if self.current_frame_icon_on_canvas[role]:
                self.Iconcanvas[role].delete(self.current_frame_icon_on_canvas[role])
            # self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
        else:
            # self.Icon_on_avatar[role] = ""
            self.load_and_display_icon_on_avatar(role, frame)
            _path = self.role_Icon_paths[role]
            filename, dot = os.path.splitext(os.path.basename(_path))
            self.role_entries[role].insert(tk.END, f"[{filename}]")

    def load_and_display_icon_on_avatar(self, role, frame):
        if role not in self.Icon_on_avatar:
            self.Icon_on_avatar[role] = ""
        else:
            print("delete load_and_display_icon_on_avatar")
            self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
        if role in self.role_Icon_paths:
            # 加载头像
            image_path = self.role_Icon_paths[role]
            if image_path:
                image = Image.open(image_path)
                image_temp = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size
                # 根据宽高比设置头像大小
                if math.fabs(width - height) <= 10:
                    image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小
                elif math.fabs(width - height) <= 400:
                    image = image.resize((50, 80), Image.LANCZOS)
                else:
                    image = image.resize((50, 100), Image.LANCZOS)

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":

                    # self.Avatar = self.Iconcanvas[role].create_image(30, 50, image=tk_image)
                    if math.fabs(width - height) <= 10:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    elif math.fabs(width - height) <= 400:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 80), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    else:
                        self.frames_icon_on_canvas[role] = [ImageTk.PhotoImage(frame.resize((50, 100), Image.LANCZOS))
                                                            for frame in ImageSequence.Iterator(image_temp)]
                    # 显示 GIF 图片的第一帧
                    self.current_frame_icon_on_canvas[role] = self.Iconcanvas[role].create_image(0, 0, anchor=tk.NW,
                                                                                                 image=
                                                                                                 self.frames_icon_on_canvas[
                                                                                                     role][
                                                                                                     0])
                    # 播放 GIF 动画
                    self.animate(0, self.Iconcanvas[role], self.current_frame_icon_on_canvas[role],
                                 self.frames_icon_on_canvas[role])
                else:
                    if self.current_frame_icon_on_canvas[role]:
                        self.Iconcanvas[role].delete(self.current_frame_icon_on_canvas[role])
                    tk_image = ImageTk.PhotoImage(image)
                    # self.Iconcanvas.create_rectangle(0, 0, 30, 30, fill="red")
                    if math.fabs(width - height) <= 10:
                        self.Icon_on_avatar[role] = self.Iconcanvas[role].create_image(20, 20, image=tk_image)
                    else:
                        self.Icon_on_avatar[role] = self.Iconcanvas[role].create_image(30, 40, image=tk_image)
                    self.image_references_on_Avatar[role].append(tk_image)

                    # elif math.fabs(width - height) <= 100:
                    # image = image.resize((20, 30), Image.LANCZOS)
                    # else:
                    # image = image.resize((10, 30), Image.LANCZOS)

                    # label3 = tk.Label(frame, image=tk_image, background = "white")
                    # label3.image = tk_image

                    # hwnd = self.Iconcanvas.winfo_id()
                    # colorkey = win32api.RGB(255, 255, 255)  # full black in COLORREF structure
                    # wnd_exstyle = win32gui.GetWindowLong(hwnd, win32con.GWL_EXSTYLE)
                    # new_exstyle = wnd_exstyle | win32con.WS_EX_LAYERED
                    # win32gui.SetWindowLong(hwnd, win32con.GWL_EXSTYLE, new_exstyle)
                    # win32gui.SetLayeredWindowAttributes(hwnd, colorkey, 255, win32con.LWA_COLORKEY)

            else:
                if self.Icon_on_avatar[role]:
                    self.Iconcanvas[role].delete(self.Icon_on_avatar[role])
                    # self.Iconcanvas[role].delete(self.current_frame_avatar[role])
        else:
            pass

    def autoSave(self):
        timestamp = datetime.now().strftime("%H:%M")
        print(timestamp + ": 已自动保存当前Log")
        self.quickSave()
        root.after(600000, self.autoSave)

    def autoSave_firstTime(self):
        root.after(600000, self.autoSave)
        # timer = threading.Timer(5, autoSave)
        # timer.start()
        print("已启动自动保存，间隔为10分钟")

    def animate(self, frame_index, canvas, current_frame, frames):
        # print(str(frame_index)+"/" + str(len(frames)))
        # 更新当前帧
        canvas.itemconfig(current_frame, image=frames[frame_index])
        # canvas.create_image(20, 20, anchor=tk.NW, image=frames[frame_index])
        # 循环播放下一帧
        frame_index = (frame_index + 1) % len(frames)
        self.after_id = canvas.after(50, self.animate, frame_index, canvas, current_frame, frames)

    def load_and_display_icon(self, role, frame):
        # self.Icon = ""
        if role in self.role_Icon_paths:
            # 加载头像
            image_path = self.role_Icon_paths[role]
            if image_path:
                image = Image.open(image_path)
                # 获取图像的宽和高
                width, height = image.size
                if height != width:
                    image2 = image.resize((50, 30), Image.LANCZOS)
                else:
                    image2 = image.resize((30, 30), Image.LANCZOS)

                _, extension = os.path.splitext(image_path)
                if extension == ".gif" or extension == ".GIF":
                    # print("帧数:", image.n_frames)
                    self.canvas_icon_animate[role] = tk.Canvas(frame, width=20, height=20)
                    self.canvas_icon_animate[role].grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    # 获取 GIF 图片的所有帧
                    if height != width:
                        self.frames_icon[role] = [ImageTk.PhotoImage(frame.resize((50, 30), Image.LANCZOS)) for frame in
                                                  ImageSequence.Iterator(image)]
                    else:
                        self.frames_icon[role] = [ImageTk.PhotoImage(frame.resize((30, 30), Image.LANCZOS)) for frame in
                                                  ImageSequence.Iterator(image)]

                    # 显示 GIF 图片的第一帧
                    self.current_frame_icon[role] = self.canvas_icon_animate[role].create_image(0, 0, anchor=tk.NW,
                                                                                                image=
                                                                                                self.frames_icon[role][
                                                                                                    0])
                    # 播放 GIF 动画
                    self.animate(0, self.canvas_icon_animate[role], self.current_frame_icon[role],
                                 self.frames_icon[role])

                    self.canvas_icon_animate[role].bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    self.canvas_icon_animate[role].bind("<Enter>",
                                                        lambda event, role=role: self.on_Namelabel_hover(role))
                    self.canvas_icon_animate[role].bind("<Leave>",
                                                        lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    self.canvas_icon_animate[role].bind("<Button-3>",
                                                        lambda event, role=role, frame=frame: self.hide_icon_on_avatar(
                                                            role, frame))
                elif role in self.canvas_icon_animate:
                    self.canvas_icon_animate[role].destroy()
                    # 根据宽高比设置头像大小
                    # if width >= 100:
                    # image = image.resize((50, 50), Image.LANCZOS)  # 调整头像大小

                    # elif math.fabs(width - height) <= 100:
                    # image = image.resize((20, 30), Image.LANCZOS)
                    # else:
                    # image = image.resize((10, 30), Image.LANCZOS)
                    # tk_image = ImageTk.PhotoImage(image)
                    tk_image2 = ImageTk.PhotoImage(image2)
                    label2 = tk.Label(frame, image=tk_image2)
                    label2.image = tk_image2

                    # self.Icon = self.Iconcanvas.create_image(200, 200, image=tk_image)

                    # 头像点击事件绑定
                    label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    label2.bind("<Button-3>",
                                lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                else:
                    tk_image2 = ImageTk.PhotoImage(image2)
                    label2 = tk.Label(frame, image=tk_image2)
                    label2.image = tk_image2

                    # self.Icon = self.Iconcanvas.create_image(200, 200, image=tk_image)

                    # 头像点击事件绑定
                    label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                    label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                    label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                    label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                    frame = self.role_entries[role].master
                    label2.bind("<Button-3>",
                                lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))

            else:
                if role in self.canvas_icon_animate:
                    self.canvas_icon_animate[role].destroy()
                label2 = tk.Label(frame)
                # if self.Icon:
                # self.Iconcanvas.delete(self.Icon)
                label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
                label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
                label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
                label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
                frame = self.role_entries[role].master
                label2.bind("<Button-3>",
                            lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
                # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))
        else:
            label2 = tk.Label(frame)
            label2.grid(row=0, column=0, padx=0, pady=0, sticky="nsew")
            label2.bind("<Button-1>", lambda event, role=role: self.choose_Icon(role))
            label2.bind("<Enter>", lambda event, role=role: self.on_Namelabel_hover(role))
            label2.bind("<Leave>", lambda event, role=role: self.on_Namelabel_unfocus(role))
            frame = self.role_entries[role].master
            label2.bind("<Button-3>",
                        lambda event, role=role, frame=frame: self.hide_icon_on_avatar(role, frame))
            # label2.bind("<Button-3>", lambda event, role=role: self.on_avatar_right_click(role))

    def get_and_roll(self, role):
        global reason_string_list
        self.search_and_delete_insert_symbol()
        if self.role_entries_roll[self.current_role.get()].get("1.0", tk.END).strip() == "":
            text = self.role_entries_roll[role].get("1.0", tk.END).strip()
            self.role_entries_roll[self.current_role.get()].delete("1.0", tk.END)
            self.role_entries_roll[self.current_role.get()].insert(tk.END, text)
            # 回车不换行

        text = self.role_entries_roll[self.current_role.get()].get("1.0", tk.END).strip()
        self.role_entries_roll[self.current_role.get()].delete("1.0", tk.END)
        self.role_entries_roll[self.current_role.get()].insert(tk.END, text)
        current_role = self.current_role.get()
        if role == "DiceBot":
            if current_role != "DiceBot":
                if self.role_entries_roll[current_role].get("1.0", tk.END).strip() != "":
                    # self.role_entries_roll[role].delete("1.0",tk.END)
                    # self.role_entries_roll[role].insert(self.role_entries_roll[current_role].get("1.0", tk.END).strip(),"1.0")
                    self.roll_dice_silent(current_role,
                                          self.role_entries_roll[current_role].get("1.0", tk.END).strip().lower(),
                                          self.role_entries[current_role].get("1.0", tk.END).strip())
                else:
                    self.roll_dice_silent(current_role, self.role_entries_roll[role].get("1.0", tk.END).strip().lower(),
                                          self.role_entries[current_role].get("1.0", tk.END).strip())
            else:
                if self.role_entries_roll[role].get("1.0", tk.END).strip() != "":
                    self.roll_dice("全员", self.role_entries_roll[role].get("1.0", tk.END).strip().lower(),
                                   self.role_entries[current_role].get("1.0", tk.END).strip())
                else:
                    self.roll_dice("全员", "1d100", self.role_entries[current_role].get("1.0", tk.END).strip())
        else:
            # 获取相应角色的输入框文本
            enemy_matches = []
            self.enemy_matches = {}
            reason = self.role_entries[role].get("1.0", tk.END).strip()
            reason = reason.replace(self.trpg_module.Critical_Success, "")
            reason = reason.replace(self.trpg_module.Extreme_Success, "")
            reason = reason.replace(self.trpg_module.Success, "")
            reason = reason.replace(self.trpg_module.Hard_Success, "")
            reason = reason.replace(self.trpg_module.Failure, "")
            reason = reason.replace(self.trpg_module.Fumble, "")
            if "@" in reason:
                print("对抗骰")
                #enemy_matches2 = reason.split("@")
                #enemy_matches2 = [s.strip() for s in enemy_matches2]
                pattern = r"@[\u4e00-\u9fa5a-zA-Z0-9\s\S]+?\s"
                enemy_matches = re.findall(pattern, reason.replace("PL ", "PL") + " ")
                enemy_matches = [s.replace("@", "").strip() for s in enemy_matches]
                print(enemy_matches)
                reason = reason.replace("@", "对抗").strip()
                reason = reason.replace(" 对抗", "，对抗")
            if reason == "":
                # 从列表中随机选择一个字符串
                reason = random.choice(reason_string_list)
            role_Chart_detail = role_Chart.get(role, {}).copy()
            expression = self.role_entries_roll[role].get("1.0", tk.END).strip().lower()

            if expression == "":
                expression = "1d100"
            if len(enemy_matches) >= 1:
                for enemy in enemy_matches:
                    role_ = ""
                    expression_ = ""
                    for key, nickname in self.role_entries_name.items():
                        if enemy.replace("PL", "PL ") == nickname:
                            role_ = key
                        elif enemy in nickname:
                            role_ = key
                    if role_ in self.role_entries_roll:
                        expression_ = self.role_entries_roll[role_].get("1.0", tk.END).strip()
                    if expression_ == "" or expression_ == "1d100":
                        self.enemy_matches[enemy.replace("PL", "PL ")] = expression
                    else:
                        # self.enemy_matches[enemy] = expression + self.role_entries_roll[enemy].get("1.0", tk.END).strip()
                        self.enemy_matches[enemy.replace("PL", "PL ")] = self.role_entries_roll[role_].get("1.0", tk.END).strip()

            for skill in role_Chart_detail:
                if ("r" + skill in reason) or ("ra" + skill in reason) and ("[" not in reason):
                    reason = reason.replace("." + skill, skill)
                    reason = reason.replace("r" + skill, skill)
                    reason = reason.replace("ra" + skill, skill)
                    expression = skill
                    timestamp = datetime.now().strftime("%Y/%m/%d %H:%M:%S")
                    log = f"{self.role_entries_name[role]} {timestamp}\n{reason}\n\n"  # 不加引号
                    self.search_and_delete_insert_symbol()
                    self.chat_log.insert(tk.END, log)
                    # 滚动到最底部
                    self.chat_log.yview(tk.END)
                    reason = "尝试" + skill

            if len(enemy_matches) >= 1:
                self.roll_dice(role, expression, reason)
                for enemy in self.enemy_matches:
                    role_ = ""
                    for key, nickname in self.role_entries_name.items():
                        if enemy == nickname:
                            role_ = key
                        elif enemy in nickname:
                            role_ = key
                    expression_ = self.enemy_matches[enemy]
                    reason_ = f"与{self.role_entries_name[role]}对抗"
                    self.roll_dice(role_, expression_, reason_)
            else:
                self.roll_dice(role, expression, reason)

    def roll_dice(self, role, expression, reason):
        global mav_prob
        global encounter_prob
        global hurt_position
        final_words = ""
        is_multiDice = False
        if role != "全员":
            # 清空输入框文本
            # 多轮掷骰应该分开计算
            # 多人格式：【骰子】（内容理由）D100=73/40;（内容理由）D100=73/40;（内容理由）D100=73/40
            # 单人格式：【骰子】（内容理由）D100=73/40; D100=73/40; D100=73/40
            self.role_entries[role].delete("1.0", tk.END)
        multi_num = 1
        pattern_multi = re.compile(r'\d+\*[\u4e00-\u9fa5a-zA-Z]+')
        if pattern_multi.match(expression):
            multi_num = int(expression.split("*")[0])
            expression = expression.split("*")[1]
            print("多轮掷骰:" + str(multi_num))
            is_multiDice = True
        else:
            is_multiDice = False
        parts_ = []
        pattern = re.compile(r'[\u4e00-\u9fa5]')
        final_words = ""
        final_words_roles = {}
        final_words_roles_comment = {}
        for roles in self.roles:
            final_words_roles[roles] = ""
            final_words_roles_comment[roles] = ""
        while multi_num > 0:
            if role == "全员":
                for roles in self.roles:
                    if roles != "DiceBot":
                        result_ = self.trpg_module.roll(expression, roles, allin=True)
                        if result_:
                            self.jrrp_record(roles, result_ + "###" + expression, "all")
                            if "扣除" in result_ and "SAN" in result_:
                                self.SAN_[roles] = int(result_.split("扣除")[1].split("点")[0])
                                # self.SAN[roles] -= int(result_.split("扣除")[1].split("点")[0])
                                self.SAN[roles] += int(result_.split("扣除")[1].split("点")[0])
                                self.san_cal_status(roles)
                        # 妙语
                        if role != "DiceBot" and "NPC_name" not in role:
                            rand_num = random.random()  # 生成0到1之间的随机数
                            if rand_num >= 1 - mav_prob:
                                if expression in bot_personality["妙语"]:
                                    _mav_list = []
                                    if self.role_entries_name[role] in bot_personality["妙语"]:
                                        _mav_list = bot_personality["妙语"][expression] + \
                                                    bot_personality["妙语"]["通用"]
                                    else:
                                        _mav_list = bot_personality["妙语"][expression]
                                    mav_words_ = random.choice(_mav_list)
                                    self.search_and_delete_insert_symbol()
                                    self.chat_log.insert(tk.END,
                                                         f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                                    self.chat_log.yview(tk.END)
                        if any(op in expression.upper() for op in ["HP", "MP", "MOV", "SAN"]):
                            expression = ""
                            reason = ""
                            return
                        parts_ = result_.split('：')
                        SANC = ""
                        expressionUPP = expression.upper()
                        if re.compile(r'^[+\-*/]').match(expressionUPP):
                            pattern = re.compile(r'([+\-*/]+)(.*)')
                            # 使用正则表达式进行匹配
                            match = pattern.match(expressionUPP)
                            # 提取匹配的结果
                            if match:
                                expressionUPP = match.group(2)
                        if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                            expressionUPP = "1D100"
                            if ("sc" or "SC" or ".sc" or "。sc") in expression:
                                SANC = "{SAN CHECK" + expression.split("sc")[1].upper() + "}"
                            else:
                                SANC = "{" + expression.upper() + "}"
                        result = ""
                        if len(parts_) > 1:
                            if "大成功" in parts_[1]:
                                result = "[大成功]"
                            elif "极难成功" in parts_[1]:
                                result = "[极难成功]"
                            elif "困难成功" in parts_[1]:
                                result = "[困难成功]"
                            elif "大失败" in parts_[1]:
                                result = "[大失败]"
                            elif "成功" in parts_[1]:
                                result = "[成功]"
                            elif "失败" in parts_[1]:
                                result = "[失败]"
                            else:
                                result = ""
                        if multi_num == 1:
                            self.role_entries[roles].delete("1.0", tk.END)
                            self.role_entries[roles].insert("1.0", final_words_roles_comment[roles])
                            final_words_roles[roles] = final_words_roles[roles] + f"{result}{expressionUPP}={parts_[0]}"
                            if reason == "":
                                # message = f'<{self.role_entries_name["DiceBot"]}>(【{self.role_entries_name[role]}】掷骰{SANC}{adv_comment}){result}{expressionUPP}={parts_[0]}\n'
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[roles]}】掷骰{SANC}{adv_comment}){final_words_roles[roles]}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[roles]}】因【{reason}】掷骰{SANC}{adv_comment}){final_words_roles[roles]}\n\n'
                            if is_multiDice:
                                message = message.replace("【骰子】", "【多轮掷骰】")
                            self.chat_log.insert(tk.END, message)
                            self.chat_log.yview(tk.END)
                        else:
                            final_words_roles[roles] = final_words_roles[
                                                           roles] + f"{result}{expressionUPP}={parts_[0]};\n"
                            final_words_roles_comment[roles] = final_words_roles_comment[roles] + f"{parts_[1]}"
                        self.role_entries["DiceBot"].delete("1.0", tk.END)
                        if len(parts_) > 1:
                            self.role_entries[roles].insert(tk.END, parts_[1])
                            weapon_list_ = {}
                            if parts_ and "成功" in parts_[1]:
                                role_Chart_detail_ = role_Chart.get(roles, {}).copy()
                                DB_ = role_Chart_detail_["DB"]
                                DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
                                if ("D" not in DB_) and ("-" not in DB_):
                                    DB_ = "+" + DB_
                                for skill, value in role_Chart_detail_.items():
                                    if "#" in skill:
                                        weapon_list_[skill.replace("#", "")] = value
                                for weapon, value in weapon_list_.items():
                                    if weapon in expression:
                                        self.role_entries_roll[roles].delete("1.0", tk.END)
                                        self.role_entries_roll[roles].insert("1.0", f"{value.replace('+DB', DB_)}")
                                        if f"[{weapon}伤害]" not in self.role_entries[roles].get("1.0", tk.END):
                                            self.role_entries[roles].insert("1.0", f"[{weapon}伤害]{random.choice(hurt_position)}\n")
                                        for role_armor in self.roles:
                                            if role_armor != roles and "ARMOR:" in str(
                                                    self.role_entries_roll[role_armor]):
                                                role_Chart_detail_armor = role_Chart.get(roles, {}).copy()
                                                if "ARMOR" in role_Chart_detail_armor:
                                                    value_armor = role_Chart_detail_armor["ARMOR"]
                                                else:
                                                    value_armor = 0
                                                self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                                self.role_entries_roll[role_armor].insert("1.0",
                                                                                          f"ARMOR:{value_armor}")
                                if "急救" in expression:
                                    self.role_entries[roles].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                                    self.role_entries_roll[role].insert("1.0", f"hp+1")
                                if "医学" in expression:
                                    self.role_entries[roles].insert("1.0", f"[医学]恢复1D3 HP\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"hp+1d3")
                                if "精神分析" in expression:
                                    self.role_entries[roles].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"san+1d3")
                            if parts_ and "大失败" in parts_[1]:
                                if "精神分析" in expression:
                                    self.role_entries[roles].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                                    self.role_entries_roll[roles].delete("1.0", tk.END)
                                    self.role_entries_roll[roles].insert("1.0", f"san-1d6")
                            if parts_ and "失败" in parts_[1]:
                                for weapon, value in weapon_list_.items():
                                    # print(weapon_list_)
                                    if weapon in expression:
                                        role_Chart_detail_armor = role_Chart.get(roles, {}).copy()
                                        if "ARMOR" in role_Chart_detail_armor:
                                            value_armor = role_Chart_detail_armor["ARMOR"]
                                        else:
                                            value_armor = 0
                                        self.role_entries_roll[roles].delete("1.0", tk.END)
                                        self.role_entries_roll[roles].insert("1.0", f"ARMOR:{value_armor}")

            else:
                if role == "DiceBot":
                    pass
                else:
                    result_ = self.trpg_module.roll(expression, role)
                    if result_ and "d100" in expression.lower():
                        self.jrrp_record(role, result_ + "###" + expression, "solo")
                        if "扣除" in result_ and "SAN" in result_:
                            self.SAN_[role] = int(result_.split("扣除")[1].split("点")[0])
                            #self.SAN[role] -= int(result_.split("扣除")[1].split("点")[0])
                            self.SAN[role] += int(result_.split("扣除")[1].split("点")[0])
                            self.san_cal_status(role)
                    # 妙语
                    if role != "DiceBot" and "NOC_name" not in role:
                        rand_num = random.random()  # 生成0到1之间的随机数
                        if rand_num >= 1 - mav_prob:
                            if expression in bot_personality["妙语"]:
                                _mav_list = []
                                if self.role_entries_name[role] in bot_personality["妙语"]:
                                    _mav_list = bot_personality["妙语"][expression] + \
                                                bot_personality["妙语"]["通用"]
                                else:
                                    _mav_list = bot_personality["妙语"][expression]
                                mav_words_ = random.choice(_mav_list)
                                self.chat_log.insert(tk.END,
                                                     f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n{mav_words_}\n\n')
                                self.chat_log.yview(tk.END)
                    if any(op in expression.upper() for op in ["HP", "MP", "MOV", "SAN"]):
                        expression = ""
                        reason = ""
                        # message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】因【{reason}】掷骰{SANC}{adv_comment}){result}{expressionUPP}={parts_[0]}\n\n'
                        # self.chat_log.insert(tk.END, message)
                        # self.chat_log.yview(tk.END)
                        return
                    if result_:
                        parts_ = result_.split('：')
                        print(parts_)
                    SANC = ""
                    expressionUPP = expression.upper()
                    if re.compile(r'^[+\-*/]').match(expressionUPP):
                        pattern = re.compile(r'([+\-*/]+)(.*)')
                        # 使用正则表达式进行匹配
                        match = pattern.match(expressionUPP)
                        # 提取匹配的结果
                        if match:
                            expressionUPP = match.group(2)
                    if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                        expressionUPP = "1D100"
                        if ("sc" or "SC" or ".sc" or "。sc") in expression:
                            SANC = "{SAN CHECK" + expression.split("sc")[1].upper() + "}"
                        else:
                            SANC = "{" + expression.upper() + "}"
                    result = ""
                    if len(parts_) > 1:
                        if "大成功" in parts_[1]:
                            result = "[大成功]"
                        elif "极难成功" in parts_[1]:
                            result = "[极难成功]"
                        elif "困难成功" in parts_[1]:
                            result = "[困难成功]"
                        elif "大失败" in parts_[1]:
                            result = "[大失败]"
                        elif "成功" in parts_[1]:
                            result = "[成功]"
                        elif "失败" in parts_[1]:
                            result = "[失败]"
                        else:
                            result = ""
                    if multi_num == 1:
                        if len(parts_) > 0:
                            final_words = final_words + f"{result}{expressionUPP}={parts_[0]}"
                        if "NPC_name" in role:
                            if role.split("NPC_name")[1]:
                                name_ = role.split("NPC_name")[1]
                            else:
                                name_ = "NPC"
                            if reason == "":
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{name_}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{name_}】因【{reason}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                        else:
                            if reason == "":
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                            else:
                                message = f'【骰子】 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n(【{self.role_entries_name[role]}】因【{reason}】掷骰{SANC}{adv_comment}){final_words}\n\n'
                        if is_multiDice:
                            message = message.replace("【骰子】", "【多轮掷骰】")
                        self.chat_log.insert(tk.END, message)
                        self.chat_log.yview(tk.END)
                    else:
                        final_words = final_words + f"{result}{expressionUPP}={parts_[0]};\n"
                        # final_words_roles_comment = final_words_roles_comment + f"{parts_[1]}\n"

                    weapon_list = {}
                    if len(parts_) > 1:
                        if parts_ and "成功" in parts_[1]:
                            if "NPC_name" in role:
                                role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                            else:
                                role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                            for skill, value in role_Chart_detail.items():
                                if "#" in skill:
                                    weapon_list[skill.replace("#", "")] = value
                            DB_ = role_Chart_detail["DB"]
                            DB_ = re.findall(r'\((.*?)\)', DB_)[0].replace("0", "")
                            if ("D" not in DB_) and ("-" not in DB_):
                                DB_ = "+" + DB_
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    self.role_entries_roll[role].delete("1.0", tk.END)
                                    self.role_entries_roll[role].insert("1.0", f"{value.replace('+DB', DB_)}")
                                    if f"[{weapon}伤害]" not in self.role_entries[role].get("1.0", tk.END):
                                        self.role_entries[role].insert(tk.END, f"[{weapon}伤害]{random.choice(hurt_position)}")
                                    for role_armor in self.roles:
                                        if role_armor != role:
                                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                                            if "ARMOR" in role_Chart_detail_armor:
                                                value_armor = role_Chart_detail_armor["ARMOR"]
                                            else:
                                                value_armor = 0
                                            self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                            self.role_entries_roll[role_armor].insert("1.0", f"ARMOR:{value_armor}")
                                    break
                                    # print("sadadd:" + value)
                            if "急救" in expression:
                                self.role_entries[role].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                            if "医学" in expression:
                                self.role_entries[role].insert("1.0", f"[医学恢复]1D3 HP\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d3")
                            if "精神分析" in expression:
                                self.role_entries[role].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d3")
                        if parts_ and "大失败" in parts_[1]:
                            if "精神分析" in expression:
                                self.role_entries[role].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                                self.role_entries_roll[role].delete("1.0", tk.END)
                                # self.role_entries_roll[role].insert("1.0", f"1d6")
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    for role_armor in self.roles:
                                        if role_armor != role:
                                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                                            if "ARMOR" in role_Chart_detail_armor:
                                                value_armor = role_Chart_detail_armor["ARMOR"]
                                            else:
                                                value_armor = 0
                                            self.role_entries_roll[role_armor].delete("1.0", tk.END)
                                            self.role_entries_roll[role_armor].insert("1.0", f"ARMOR:{value_armor}")
                        elif parts_ and "失败" in parts_[1]:
                            role_Chart_detail_armor = role_Chart.get(role, {}).copy()
                            for weapon, value in weapon_list.items():
                                if weapon in expression:
                                    if "ARMOR" in role_Chart_detail_armor:
                                        value_armor = role_Chart_detail_armor["ARMOR"]
                                    else:
                                        value_armor = 0
                                    self.role_entries_roll[role].delete("1.0", tk.END)
                                    self.role_entries_roll[role].insert("1.0", f"ARMOR:{value_armor}")

            if len(parts_) > 1 and role != "全员":
                self.role_entries[role].insert(tk.END, parts_[1])

                weapon_list__ = {}
                if len(parts_) > 1:
                    if parts_ and "成功" in parts_[1]:
                        role_Chart_detail__ = role_Chart.get(role, {}).copy()
                        for skill, value in role_Chart_detail__.items():
                            if "#" in skill:
                                weapon_list__[skill.replace("#", "")] = value
                        for weapon, value in weapon_list__.items():
                            if weapon in expression:
                                if f"[{weapon}伤害]" not in self.role_entries[role].get("1.0", tk.END):
                                    self.role_entries[role].insert("1.0", f"[{weapon}伤害]{random.choice(hurt_position)}\n")
                                break
                        if "急救" in expression:
                            # self.role_entries[role].insert("1.0", f"HP+1，若濒死请继续骰[医学]\n")
                            self.role_entries_roll[role].insert("1.0", f"hp+1")
                        if "医学" in expression:
                            # self.role_entries[role].insert("1.0", f"[医学恢复]1D3 HP\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"hp+1d3")
                        if "精神分析" in expression:
                            # self.role_entries[role].insert("1.0", f"[精神分析恢复]1D3 SAN\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"san+1d3")
                    if parts_ and "大失败" in parts_[1]:
                        if "精神分析" in expression:
                            # self.role_entries[role].insert("1.0", f"[精神分析损失]1D6 SAN\n")
                            # self.role_entries_roll[role].delete("1.0", tk.END)
                            self.role_entries_roll[role].insert("1.0", f"san-1d6")
            multi_num -= 1

    def roll_dice_silent(self, role, expression, reason):
        global reason_silent_string_list
        multi_num = 1
        pattern_multi = re.compile(r'[\d+]\*[\u4e00-\u9fa5a-zA-Z]+')
        if pattern_multi.match(expression):
            multi_num = int(expression.split("*")[0])
            expression = expression.split("*")[1]
            print("多轮掷骰" + str(multi_num))
        pattern = re.compile(r'[\u4e00-\u9fa5]')
        SANC = ""
        self.role_entries[role].delete("1.0", tk.END)
        while multi_num > 0:
            if reason == "":
                # 从列表中随机选择一个字符串
                reason = random.choice(reason_silent_string_list)
            if re.compile(r'^[+\-*/]').match(expression):
                pattern = re.compile(r'([+\-*/]+)(.*)')
                # 使用正则表达式进行匹配
                match = pattern.match(expression)
                # 提取匹配的结果
                if match:
                    expression = match.group(2)
            if bool(pattern.search(expression)) or ("sc" or "SC" or ".sc" or "。sc") in expression:
                if ("sc" or "SC" or ".sc" or "。sc") in expression:
                    SANC = "[SAN CHECK" + expression.split("sc")[1].upper() + "]"
                else:
                    SANC = "[" + expression.upper() + "]"
            if self.role_entries_roll["DiceBot"].get("1.0", tk.END).strip().lower() == "" or self.role_entries_roll[
                "DiceBot"].get("1.0", tk.END).strip().lower() == "1d100":
                SANC = ""
            if reason == "":
                message = f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【暗骰】{self.role_entries_name[role]}进行了一次{SANC}暗骰。\n\n'
            else:
                message = f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【暗骰】{self.role_entries_name[role]}因{reason}进行了一次{SANC}暗骰。\n\n'
            self.chat_log.insert(tk.END, message)
            self.chat_log.insert(tk.END,
                                 f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【音效】掷骰\n\n')
            self.chat_log.yview(tk.END)
            result = self.trpg_module.roll(expression, role)
            # jrrp录入
            if result:
                self.jrrp_record(role, result + "###" + expression, "silent")
                if "扣除" in result and "SAN" in result:
                    self.SAN_[role] = int(result.split("扣除")[1].split("点")[0])
                    #self.SAN[role] -= int(result.split("扣除")[1].split("点")[0])
                    self.SAN[role] += int(result.split("扣除")[1].split("点")[0])
                    self.san_cal_status(role)
            self.role_entries[role].insert(tk.END, result)
            multi_num -= 1

    def auto_complete_entry(self, root, entry, suggestion_list):
        #listbox = tk.Listbox(root, width=24)
        # 创建一个 Toplevel 窗口用于显示下拉列表
        top_level = tk.Toplevel(root)
        top_level.wm_overrideredirect(True)  # 隐藏窗口边框
        top_level.withdraw()  # 初始时隐藏 Toplevel 窗口
        listbox = tk.Listbox(top_level, width=24)
        listbox.pack()

        def show_suggestions(*args):
            typed_text = entry.get()
            if typed_text == "":
                #listbox.grid_forget()
                top_level.withdraw()  # 隐藏 Toplevel 窗口
            else:
                matches = [word for word in suggestion_list if typed_text.lower() in word.lower()] #联想前缀：word.lower().startswith(typed_text.lower())
                if matches:
                    listbox.delete(0, tk.END)
                    for match in matches:
                        listbox.insert(tk.END, match)
                    #listbox.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                    #listbox.place(x=entry.winfo_x(), y=entry.winfo_y() + entry.winfo_height())
                    # 获取 Entry 的位置
                    entry_x = entry.winfo_rootx()
                    entry_y = entry.winfo_rooty() + entry.winfo_height()

                    # 设置 Toplevel 窗口的位置
                    top_level.geometry(f"+{entry_x}+{entry_y}")
                    top_level.deiconify()  # 显示 Toplevel 窗口
                else:
                    #listbox.grid_forget()
                    top_level.withdraw()  # 隐藏 Toplevel 窗口

        def complete(event):
            if listbox.size() > 0:
                entry.delete(0, tk.END)
                entry.insert(0, listbox.get(tk.ACTIVE))
                #listbox.grid_forget()
                top_level.withdraw()  # 隐藏 Toplevel 窗口
                entry.icursor(tk.END)

        def select_suggestion(event):
            entry.delete(0, tk.END)
            entry.insert(0, listbox.get(tk.ACTIVE))
            #listbox.grid_forget()
            top_level.withdraw()  # 隐藏 Toplevel 窗口
            entry.icursor(tk.END)

        entry.bind("<KeyRelease>", show_suggestions)
        entry.bind("<Right>", complete)
        listbox.bind("<Button-1>", select_suggestion)
        listbox.bind("<Right>", complete)

    def new_roles_NPC(self):
        global career_list
        global trait_list
        global motive_list
        self.file_path = ""
        name_list = ["无预设", "自定义..."]
        global role_Chart_at_name
        for name, chart in role_Chart_at_name.items():
            name_list.append(name)
        self.new_roles_NPC_window = tk.Toplevel(root, takefocus=True)
        self.new_roles_NPC_window.title(f"生成新的NPC")
        # Create widgets
        self.roles_NPC_frame = tk.Frame(self.new_roles_NPC_window)
        self.roles_NPC_frame.pack()

        self.type_label = tk.Label(self.roles_NPC_frame, text="预设:")
        self.type_label.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        self.type_var = tk.StringVar()
        self.type_var.set("请选择预设")  # Default value
        self.type_menu = ttk.Combobox(self.roles_NPC_frame, textvariable=self.type_var, values=name_list)
        self.type_menu.bind("<<ComboboxSelected>>", lambda event: self.random_entry_for_new_roles_NPC_by_mock(event))
        #self.type_menu = tk.OptionMenu(self.roles_NPC_frame, self.type_var, *name_list,
                                       #command=self.random_entry_for_new_roles_NPC_by_mock)
        self.type_menu.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        self.type_random_var = tk.StringVar()
        self.type_random_var.set("请选择随机预设")  # Default value
        self.type_random_menu = tk.OptionMenu(self.roles_NPC_frame, self.type_random_var, "无随机预设", "人类", "战场经历", "警务经历",
                                              "罪犯经历", "医务经历", "教育经历", "艺术经历", "神话经历", "邪教徒", "小型野兽", "中型野兽", "大型野兽",
                                              "小型怪物", "中型怪物", "大型怪物", "古神",
                                              command=self.random_entry_for_new_roles_NPC_by_mock)
        self.type_random_menu.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")

        self.NPC_image_button = tk.Button(self.roles_NPC_frame, text="选择立绘",
                                          command=self.select_image_for_new_roles_NPC)
        self.NPC_image_button.grid(row=0, column=3, padx=5, pady=5, sticky="nsew")

        self.HP_label = tk.Label(self.roles_NPC_frame, text="HP值", fg="red")
        self.HP_label.grid(row=0, column=4, padx=5, pady=5, sticky="nsew")

        self.MP_label = tk.Label(self.roles_NPC_frame, text="MP值", fg="blue")
        self.MP_label.grid(row=0, column=5, padx=5, pady=5, sticky="nsew")

        self.name_label = tk.Label(self.roles_NPC_frame, text="姓名(必填)")
        self.name_label.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        self.name_entry = tk.Entry(self.roles_NPC_frame)
        self.name_entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        self.auto_complete_entry(self.roles_NPC_frame, self.name_entry, name_list)

        self.all_label2 = tk.Label(self.roles_NPC_frame, text="总值")
        self.all_label2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")

        self.all_label = tk.Label(self.roles_NPC_frame, text="总值")
        self.all_label.grid(row=1, column=3, padx=5, pady=5, sticky="nsew")

        self.allwithluck_label2 = tk.Label(self.roles_NPC_frame, text="总值(包括幸运)")
        self.allwithluck_label2.grid(row=1, column=4, padx=5, pady=5, sticky="nsew")

        self.allwithluck_label = tk.Label(self.roles_NPC_frame, text="总值(包括幸运)")
        self.allwithluck_label.grid(row=1, column=5, padx=5, pady=5, sticky="nsew")

        self.STR_label = tk.Label(self.roles_NPC_frame, text="力量(STR)")
        self.STR_label.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

        self.STR_text = tk.Entry(self.roles_NPC_frame)
        self.STR_text.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        self.CON_label = tk.Label(self.roles_NPC_frame, text="体质(CON)")
        self.CON_label.grid(row=3, column=0, padx=5, pady=5, sticky="nsew")

        self.CON_text = tk.Entry(self.roles_NPC_frame)
        self.CON_text.grid(row=3, column=1, padx=5, pady=5, sticky="nsew")

        self.SIZ_label = tk.Label(self.roles_NPC_frame, text="体型(SIZ)")
        self.SIZ_label.grid(row=4, column=0, padx=5, pady=5, sticky="nsew")

        self.SIZ_text = tk.Entry(self.roles_NPC_frame)
        self.SIZ_text.grid(row=4, column=1, padx=5, pady=5, sticky="nsew")

        self.DEX_label = tk.Label(self.roles_NPC_frame, text="敏捷(DEX)")
        self.DEX_label.grid(row=2, column=2, padx=5, pady=5, sticky="nsew")

        self.DEX_text = tk.Entry(self.roles_NPC_frame)
        self.DEX_text.grid(row=2, column=3, padx=5, pady=5, sticky="nsew")

        self.INT_label = tk.Label(self.roles_NPC_frame, text="智力/灵感(INT)")
        self.INT_label.grid(row=3, column=2, padx=5, pady=5, sticky="nsew")

        self.INT_text = tk.Entry(self.roles_NPC_frame)
        self.INT_text.grid(row=3, column=3, padx=5, pady=5, sticky="nsew")

        self.APP_label = tk.Label(self.roles_NPC_frame, text="外貌(APP)")
        self.APP_label.grid(row=4, column=2, padx=5, pady=5, sticky="nsew")

        self.APP_text = tk.Entry(self.roles_NPC_frame)
        self.APP_text.grid(row=4, column=3, padx=5, pady=5, sticky="nsew")

        self.POW_label = tk.Label(self.roles_NPC_frame, text="意志(POW)")
        self.POW_label.grid(row=2, column=4, padx=5, pady=5, sticky="nsew")

        self.POW_text = tk.Entry(self.roles_NPC_frame)
        self.POW_text.grid(row=2, column=5, padx=5, pady=5, sticky="nsew")

        self.EDU_label = tk.Label(self.roles_NPC_frame, text="教育(EDU)")
        self.EDU_label.grid(row=3, column=4, padx=5, pady=5, sticky="nsew")

        self.EDU_text = tk.Entry(self.roles_NPC_frame)
        self.EDU_text.grid(row=3, column=5, padx=5, pady=5, sticky="nsew")

        self.LUCK_label = tk.Label(self.roles_NPC_frame, text="幸运(LUCK)")
        self.LUCK_label.grid(row=4, column=4, padx=5, pady=5, sticky="nsew")

        self.LUCK_text = tk.Entry(self.roles_NPC_frame)
        self.LUCK_text.grid(row=4, column=5, padx=5, pady=5, sticky="nsew")

        self.description_label = tk.Label(self.roles_NPC_frame, text="技能")
        self.description_label.grid(row=5, column=0, padx=5, pady=5, sticky="nsew")

        self.description_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.description_text.grid(row=5, column=1, columnspan=1, sticky="nsew")
        self.description_text.insert(tk.END, "技能一10 技能二30 技能三70 @武器鉴定技能1D6+DB")

        self.trait_label = tk.Label(self.roles_NPC_frame, text="扮演要点")
        self.trait_label.grid(row=6, column=0, padx=5, pady=5, sticky="nsew")
        self.trait_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.trait_text.grid(row=6, column=1, columnspan=5, sticky="nsew")
        self.trait_text.insert(tk.END, "开始随机以获取个人描述参考")

        self.trait2_label = tk.Label(self.roles_NPC_frame, text="扮演要点补充")
        self.trait2_label.grid(row=7, column=0, padx=5, pady=5, sticky="nsew")
        self.trait2_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.trait2_text.grid(row=7, column=1, columnspan=5, sticky="nsew")
        self.trait2_text.insert(tk.END, "开始随机以获取个人描述参考补充")

        self.motive_label = tk.Label(self.roles_NPC_frame, text="动机")
        self.motive_label.grid(row=5, column=2, padx=5, pady=5, sticky="nsew")
        self.motive_text = tk.Text(self.roles_NPC_frame, height=5, width=30, undo=True)
        self.motive_text.grid(row=5, column=3, columnspan=3, sticky="nsew")
        self.motive_text.insert(tk.END, "开始随机以获取个人动机")

        self.random_button = tk.Button(self.roles_NPC_frame, text="...随机生成",
                                       command=self.random_entry_for_new_roles_NPC)
        self.random_button.grid(row=9, column=0, columnspan=2, sticky="nsew")

        self.edit_button = tk.Button(self.roles_NPC_frame, text="修正旧NPC?", command=self.edit_entry_for_new_roles_NPC)
        self.edit_button.grid(row=9, column=2, columnspan=2, sticky="nsew")

        self.save_button = tk.Button(self.roles_NPC_frame, text="保存", command=self.save_json_for_new_roles_NPC)
        self.save_button.grid(row=9, column=4, columnspan=2, sticky="nsew")

        self.new_roles_NPC_window.protocol("WM_DELETE_WINDOW", self.on_closing_new_window_new_roles_NPC)

    def on_closing_new_window_new_roles_NPC(self):
        self.new_combat_window = tk.Toplevel(root)
        name = self.name_entry.get().strip()
        self.new_roles_NPC_window.destroy()
        self.Add_NPC(pass_=name)

    def select_image_for_new_roles_NPC(self):
        image_preview = tk.Label(self.roles_NPC_frame, image="", relief=tk.FLAT)
        self.file_path = filedialog.askopenfilename(title="Select Image",
                                                    filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                    initialdir="Images/AvatarImages")
        if self.file_path:
            image = Image.open(self.file_path)  # 替换为你的图片路径
            # 获取图像的宽和高
            width, height = image.size
            image = image.resize((int(width / 5), int(height / 5)), Image.LANCZOS)
            photo = ImageTk.PhotoImage(image)
            self.image_references_PC.append(photo)
            image_preview = tk.Label(self.roles_NPC_frame, image=photo, relief=tk.FLAT)
            image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")

    def random_entry_for_new_roles_NPC(self):
        trait_desc = []
        motive_desc = {}
        global drink_list
        global sweet_list
        global trait_mec_list
        global mbti_list
        global app_list
        global everyday_list
        # xp列表_sm分表_完全权力交换分表
        xp_sm_tpe = [
    "项圈：一些奴隶佩戴项圈作为饰品以表示归属。主人可能会在一个佩戴仪式上赠送项圈，这可以是在私人场合，也可以是在生活方式圈子中的公开场合。项圈可能是定制的，并包含代表关系或主人的符号或首字母。一些人用不太明显的珠宝或饰品代替项圈，或在特殊场合佩戴更精致的项圈，而日常使用简单的珠宝。网络别名也适用。",
    "高潮/自慰控制：主人规定奴隶何时以及如何进行性活动，包括自慰。他决定奴隶何时可以高潮，甚至可能强制高潮。你甚至可以尝试一些高潮控制游戏或尝试破坏他的高潮。",
    "洗手间控制：奴隶可能需要请求使用洗手间的许可，甚至穿尿布。注意，阻止使用洗手间可能导致健康问题。",
    "财务控制：主人可能控制奴隶赚的钱，并用它支付账单、购买物品或储蓄/投资。他也可能不允许奴隶在家外工作。主人可能满足奴隶的所有需求，使奴隶依赖于主人。",
    "分手控制：在一些完全权力交换关系中，奴隶被剥夺结束关系的能力。",
    "睡眠控制：主人可能决定奴隶何时以及如何睡觉。一些奴隶可能睡在笼子或宠物床里。他们可能需要许可才能和主人一起睡，并可能睡在床尾。",
    "姿势和位置：在完全权力交换中，主人可能要求奴隶在主人进入房间时采取特定姿势，并且必须在主人面前跪下。奴隶可能需要倒退离开主人，以免背对他们。",
    "外貌：奴隶可能在穿着或外貌上听从女主人的决定。化妆、鞋子和配饰可能都由主人决定。",
    "服务：当奴隶服务主人时，她可能会提供食物和饮料、他最喜欢的书、按摩、口交或任何其他他命令的服务。主人会指定服务的方式，例如跪下服务。",
    "眼神接触：在一些完全权力交换关系中，主人要求奴隶将目光保持在地面，除非另有指示。",
    "时间：主人可以规定奴隶如何使用她的时间以及她必须优先处理的事项。",
    "安全词的取消：许多相信完全权力交换的人不使用安全词，因为这违背了完全放弃所有控制的理念。然而，并不是所有的D/s情侣都同意取消安全词。"
]
        # xp列表_sm分表_kink分表
        xp_sm_kink = ["Abasiophilia: attraction to people in neck braces, wheelchairs, casts, or other devices that impair mobility that was documented for the first time as occurring in a woman in the late 80s. It may be part of a medical fetish or enjoyed because it restricts movement.",
    "Abduction as seduction: a kink where the abductor/kidnapper treats the victim in a loving manner.",
    "Abrasions: people who enjoy this fetish like giving or receiving cuts and scrapes.",
    "Acarophilia: arousal from scratching. Scratching is often an element incorporated into rough sex.",
    "Accidental stimulation: refers to accidental physical stimulation and situations that arouse adrenaline and cause arousal.",
    "Acrotomophilia: fetish for amputees. Fetishists may prefer a specific type of amputee (arm, leg, etc). A person with a fetish for *being* an amputee has apotemnophilia. There may be overlap with morphophilia.",
    "Actirasty: arousal by the rays of the sun. This may be enjoyed through sex outside.",
    "Agalmatophilia: a person with this fetish is aroused by statues, mannequins or other figurative representations. This may be related to Pygmalionism, an attraction to items of one’s own creation.",
    "Age play: role play in which one or both partners pretends to be a different age/stage. Types of age play include infantilism, Daddy/daughter play, and diaper play, among others. Some kinksters differentiate between DD/lg and age play.",
    "Agoraphilia: fetish dedicated to sex in public places.",
    "Aliens: kinksters fetishize about having sex with aliens, often in an abduction and forced scenario.",
    "Altocalciphilia: a fetish for high heels, usually worn by women but not always.",
    "Amazons and authoritarians: fetish dedicated to physically strong women like Amazons, women with strong personalities, or women in positions of authority.",
    "Amaurophilia: kink for being unable to see, blinded or blindfolded during sex.",
    "Anal penetration: a fetish for anal penetration with foreign objects (not sex toys or penises). Inserting objects that are not designed for anal safety (porous, without a flared base, with sharp edges) can cause damage.",
    "Anal sex: both giving and receiving anal sex can be a kink or fetish. Giving to a male with a strap-on is also known as pegging.",
    "Anal toys worn under clothing: a fetish for using/wearing anal toys such as using butt plugs during the day and not just during sex activity. It may be a command of a submissive by a dominant, part of anal training to take bigger items or penises and/or as part of foreplay.",
    "Anal training: the practice of preparing one’s anus for inserting large items.",
    "Anasteemaphilia: a fetish for people over extreme sizes, ie a giant or a dwarf. It can be used to refer to attraction to partners of differing heights even if those people aren’t especially gigantic or tiny.",
    "Anonymous sex: a kink revolving around anonymous sexual encounters where one or both parties is unaware of the other’s identity. Gloryholes are a common form of anonymous sex but they are not the only form.",
    "Aquaphilia: fetish for water and having sex in or around water. This can extend to a fetish for swimwear or posing in water even if it doesn’t involve sexual activity.",
    "Asphyxiation: a highly danerous kink dedicated to choking, smothering and strangulation. Autoerotic asphyxiation is self-choking. To be clear, asphyxiation is very dangerous and has led to injuries and deaths. See also breath play.",
    "Autogynephilia: a kink where men present/dress as women (gynemimetophilia refers to men impersonating women). Autoandrophilia is arousal at the idea of being a man. Note that this term was coined as an improvement on cross-dressing kink and has been used to describe transgendered individuals and has been used as an argument that trans people are mentally ill. Many prefer not to use this term, which is often transphobic. However, some people may have a fetish for crossdressing or becoming another gender that does not relate to their gender identity.",
    "Autofellatio: a kink where a man performs a blowjob on himself.",
    "Autoplushophilia: a type of plushophilia where a person is aroused by the idea being a stuffed animal, especially a cartoonish one.",
                      "Barebacking: sex without a condom. Barebacking is especially common in the gay community, but this act can be dangerous and lead to STI transmission or pregnancy.",
                      "Bathroom control: when the dominant person controls when, how and where the submissive can urinate or defecate. Extreme bathroom control can be dangerous.",
                      "Begging: kink for begging and pleading (to have sex, for release/orgasm, to perform an act, etc.). Begging is submissive in nature.",
                      "Belonephilia: affinity to pins, needles and sharp objects. Belonephilia can be quite dangerous. See also knife play.",
                      "Bestiality: sex with animals.",
                      "Bimbofication: The process of making someone into a bimbo or being turned into a bimbo themselves. This might be a fun “punishment” for a bratty sub.",
                      "Blindfolds: a type of bondage that blocks a person’s vision. See also amaurophilia.",
                      "Body Inflation: The practice of inflating or pretending to inflate a part of one’s body, often for sexual gratification.",
                      "Bondage: restraint of a person, either by physical item (cuffs, rope, etc.) or instruction (known as mental bondage). Restraint can be full-body (vacuum beds, suspension) or involve a single body part such as the eyes (blindfold), mouth (ball gag), wrists or even thumbs. Bondage may include furniture like and devices like handcuffs. Reddit has a number of subreddits dedicated to the subject.",
                      "Body modification: kink for a variety of body modifications. This may mean anything that changes the appearance of a body from tattoos to piercings to saline injections, but this kink may also only refer to specific body mods such as lip sewing.",
                      "Branding: marking someone with a symbol, word, etc. Typically uses a heated object (such as a metal hanger) to produce the brand. Branding is dangerous.",
                      "Breath play: choking and limiting breath. Being aroused by this is known as hypoxyphilia This kink is a type of edge play that is dangerous.",
                      "Breast/nipple torture: the breast equivalent of CBT. Torture may include hitting, pinching, bondage, and other methods of inflicting pain onto breasts.",
                      "Breast/nipple worship: the act of worshipshipping someone’s breasts or nipples.","Caning: the act of hitting someone with a rod known as caning.  Fleshy areas such as the back of the thighs and butt are advised, but some people enjoy caning the bottoms of feet. Canes are traditionally made from wood, but modern canes may be made from plastic, metal or other semi-flexible materials. Caning is a form of impact play that is more extreme than typical flogging and may be dangerous if done improperly. Sadists are usually the most common type of domthat enjoy caning their sub.",
    "Castration: An extreme fetish involving removal of all or part of a man’s genitals. Actual castration is incredibly dangerous. Most kinksters obsess over it without actually going through with it. This kink goes hand in hand with emasculation fetishes as well as the ball busting, in which a man’s balls are crushed.",
    "CBT: Cock and ball torture (CBT) is pain applied to a man’s genitals. It may be a form of punishment. CBT can involve shoes, sounding, stretching, impact implements and other tools. CBT can be dangerous.",
    "Chasmophilia: aroused by crevices, caverns, or valleys.",
    "Chastity: a fetish where someone’s access to their genitals is blocked. Women wear chastity belts, and men wear cock cages that prevent erection and release. Also known as forced abstinence or forced celibacy. Chastity can be used as a form of self-denial or orgasm control, including ruined orgasms.",
    "Choking: blood choking is the act of choking someone until they pass out. It is incredibly dangerous and can lead to brain damage. Choking is a type of edge play",
    "Claustrophilia: this fetish is the opposite of claustrophobia. A person becomes aroused or experiences orgasm through confinement to small spaces. This is a type of bondage.",
    "Clothed sex (endytophilia): the affinity for sex while fully or partially clothed. You can enjoy this kink while lifting your skirt or dress, so your man penetrates you. Pushing underwear to the side can also be a form of this fetish.",
    "Cock and/or ball fetishization: an obsession with cock and balls.",
    "Cock worship: similar to breast worship. This fetish involves verbal, physical and mental adoration of a penis – including fake ones (strap-ons).",
    "Collaring: for many types of submissive, the act of wearing a collar shows submission, loyalty and/or devotion to a dominant. A collar may be seen as purely sexual or also romantic (similar to an engagement/wedding ring). Collars may be placed on in public or private collaring ceremonies, and dominants may provide instructions for wearing collars. The collar may be an actual collar purchased from a pet store, one that is hand-tooled or a safe-for-work necklace or choker that can be worn in non-kinky spaces.",
    "Consensual nonconsent: situations where one or both parties have given prior consent for activities that may appear to be or actually involve nonconsent. Rape play is a common form. The “victim” has given prior consent to this type of play but seems to resist. Couples should negotiate boundaries beforehand, including a safe word. Consensual nonconsent should never be spontaneous. If negotiations are avoided or safe words ignored, consensual nonconsent can lead to real trauma or even become sexual assault.",
    "Corsetry: the act of wearing a corset, sometimes to the extent of changing the shape and size of one’s body. Tight-lacing a corset enables one to successfully waist-train.  Some dominants may use tight-lacing to limit breathing. It’s not just limited to your abs and tummy either.",
    "Cross-dressing: dressing like a member of the opposite sex. For many people, it’s not necessarily sexual while it is for others. Cross-dressing can involves clothing, accessories, makeup, and wigs.",
    "Crurophilia: A kink related to legs.",
    "Crush fetish: a particular fetish relating to crushing small animals or objects. Squashing kink is a similar obsession.",
    "Cunnilingus: this kink can be geared towards receiving oral sex as a woman or giving it either as a man or woman. Cunnilingus plays well with pussy worship. If your partner has a kink for licking pussy, you won’t need to convince him to go down on.",
    "Cupping: small cups or jars are applied upside down to the body, usually the back. Fire or a hand-pump creates suction that results in temporary bruising and a tight feeling. Extreme cupping can break the skin, but cupping is considered safe (the flame is only used for suction and doesn’t burn the skin).",
                      "Dacryphilia: arousal caused by tears or crying.",
                      "Degradation: if you like when your man talks down to you during sex, you might be into degradation. This is one of those kinks that works especially well with domination and submission. Just because you like doing it (giving or receiving) during sex doesn’t mean you think any less of your partner. However, not everyone likes degradation, and that’s okay.",
                      "Dendrophilia: also known as Arbophilia. A sexual attraction to trees, either because they are phallic-shaped or because of the texture. May overlap with xylophilia.",
                      "Diapers: this fetish is usually part of infantilism – but not always.",
                      "Discipline: giving or receiving punishment for perceived or defined infractions. Discipline is a major part of many power exchange relationships and something typically desired by masochists and administered by sadists.",
                      "Dirty talking: having a kink for talking dirty during sex is pretty tame. Some people might not even consider it a fetish! See also narratophilia.",
                      "Doraphilia: playing with skin, leather, or fur. Hyphephilia is a similar fetish for touching hair, fur, skin and certain fabrics.",
                      "Double penetration: penetration of a woman’s vagina and ass via a combination of toys, penises or both. Double penetration may be part of a group sex scenario (MFM), which often occurs in the swinging lifestyle.",
                      "Dracophilia: a fetish for dragons. Fantasy fetish companies such as Bad Dragon make dragon dildos, including those that ejaculate!",
                      "DVP: stands for double vaginal penetration. Unlike double penetration (DP), which is simultaneous anal and vaginal penetration, DVP involves two penises or one penis and one toy in the vagina. It can be satisfying for all parties; although, it requires lube and preparation. In DVP, only one partner may have enough room to thrust.",
                      "Edge play: Any kink or fetish that is considered more risky or extreme. Examples include choking, breath play, knife play, fire play, and any activity that results in bleeding.",
                      "Elastophilia: a fetish for stretchy materials including spandex, latex, silicone, etc. Elastophiles often enjoy bouncing on these materials or sinking deep down into something stretchy.",
                      "Electric play: playing with uncontrolled electricity is very dangerous and can even lead to heart failure. However, most people (aside from those with pacemakers, heart issues, and other implants), can safely play with TENS units or violet wands to explore this kink.",
                      "Enemas (klismaphilia) : inserting a tube into the anus and using a liquid (typically water, but other solutions may be utilized including urine) to clean out the rectum. Enemas may be used to prepare for anal activities, but this is not necessary. An enema could be a form of punishment or control.",
                      "Enkuopoiphilia: fetish for impregnantion or breeding.",
                      "Eproctophilia: arousal from flatulence (farts). It’s a type of olfactophilia",
                      "Exhibitionism: a common fetish for being naked and performing sexually in front of a person or persons. Masturbating for your partner is a mild form of this kink, but performing in sex windows or at BDSM shows and parties is a safe way to explore this fetish. Sex in public is partly exhibitionism. Related to agrexophilia, which is arousal when other people know about your sexual activities, and autagonistophilia, exposing oneself while on stage and being photographed. The counterpart of voyeurism.",
                      "Exoticism: fetishizing members and elements of Far Eastern culture (Japan, China, etc.), including fictional worlds inspired by these locations. A preoccupation with Geishas is common in the Western world, for example. See also Otherness.",
                      "Face fucking: an extreme form of blowjob where a man roughly fucks a partner’s mouth. This kink isn’t inherently dangerous, but it can be uncomfortable and lead to tears, gagging and even vomiting.",
                      "Face sitting: the act of a woman sitting on a man’s face while he performs oral. Face sitting can include mild suffocation but doesn’t have to. It’s incredibly dominant.",
                      "Face slapping: a slap across the face brings you to attention and corrects your mistakes. You’re unlikely to enjoy this fetish unless you’re a bit of a masochist, but it’s not as far out as some items on our list of kinks.",
                      "Fat fetishism: The sexual attraction to overweight or obese people due to their weight and size. Gaining or feederism (mentioned below as “Forced feeding”) is a variation of fat fetishism where the sexual attraction/gratification is not solely gained from the “fatness” but more from the process of gaining weight/getting fat.",
                      "Fellatio: Not usually deemed a fetish or kink, but it can be for some.",
                      "Figging: using ginger root to create a burning sensation. It must be peeled before it can be inserted anally or vaginally.",
                      "Fighting/Wrestling: play fighting and wrestling is sexy because your body proximity as you struggle to maintain control. Even if you lose, you don’t *really* lose! If you’re turned on by a fight between other people, you’re not alone, either.",
                      "Fire play: a form of edge play that involves flames and fire. Kinksters should be careful with hair, which can burn off and smell terrible (consider shaving first). Fire/heat may be contrasted with cold/ice. Fire play can be dangerous.",
                      "Fisting: the act of penetration with a full hand. Unlike the name suggests, your partner should start with your hand straight and thumb tucked under his fingers like a duck bill. After he inserts his knuckles – the widest part of his hand – he can curl his fingers into a fist/ball shape. Fisting requires time, patience, trust and lots of lube.",
                      "Flogging (flagellation): hitting someone with a multi-tailed tool known as a flogger. Depending upon the strength of the swing, flogging can range from warm-up to harsh impact that draws blood. Floggers tails come in many materials: fur, leather, suede, rubber, silicone, and ball-chain to name a few.",
                      "Food play: incorporating food into sex. This may mean using someone as a dish or table, covering your partner’s body with food and licking it off (think whipped cream or chocolate sauce, but you can get creative!). Food play can be fun, but beware that playing with food near your vagina could contribute to a yeast infection. More on that [here](https://badgirlsbible.com/yeast-infections-causes-symptoms-treatment). A fetish for food is known as sitophilia.",
                      "Foot fetish (podophilia): a foot fetishist enjoys feet sexually. This may involve footjobs, licking and sucking, massaging. Foot worship in a power exchange scene can take the form of polishing shoes or boots even with a tongue or worshipping feet!",
                      "Forced feeding: a kink for forcing someone to eat, potentially until they gain weight. This fetish is a type of body modification fetish. Feederism sometimes specifically refers to men feeding women but can be used without any distinction.",
                      "Formicophilia: arousal by insects or by insects crawling on and nibbling the body. The fetish for bees and wasps specifically is known as melissophilia while an attraction to spiders is known as arachnophilia.",
                      "Frotting: rubbing of two penises together. One man may hold the penises together during this act. Similar activities include frottage (rubbing while clothed for sexual stimulation) and frotteurism (rubbing or fondling an unsuspecting/non-consenting person).",
                      "Furries: this kink is hot, literally. Furries dress as animals or humanoid animal creatures, sometimes decked head-to-toe in fur. They often don animalistic dildos via strap-ons to enhance their furry play. Many furries engage in role playing games and cosplay as part of their lifestyle, which can become quite expensive. Note that some furries engage only in costumes and roleplay only and no sexual activity (although some people do not see a distinction). To differentiate, “yiffy” refers to a sexualized furry fetish.",
                      "Gags: a form of mouth bondage. Gags come in many forms, but ball gags are the most common. They may also take the form of bit, cleave, pacifier, penis or spider gag, among others. Mouth gags aren’t usually dangerous, but they can be uncomfortable. Make sure to fit the gag properly to your (or your partner’s) mouth.",
                      "Gerontophilia: attraction to someone from a much older age group. May-December relationships can fall into this kink if the members of the couple specifically fetishize the age difference.",
                      "Golden showers: See watersports.",
                      "Group sex (Polyiterophilia): group sex and multiple party scenarios can be quite hot, but they can also be uncomfortable. Threesomes are one of the more common arrangements (and a fascination with three-person sex is known as triolism/troilism). Wanna try a threesome yourself?",
                      "Haematomania aka hematolagnia : lust for blood and bleeding. May include wounds, vampirism or biting to draw blood. It goes without saying that this one is obviously quite dangerous.",
                      "Harpaxophilia: the fetish for being robbed. Can be played as a role in consensual non-consent. Chrematistophilia is a similar kink for being forced to pay for sex.",
                      "Helplessness: any role in which someone is helpless. They may be the victim to their roleplay partner (robber, kidnapper, etc), or their partner may act as a savior (think of a princess who needs saving or an inept housewife).",
                      "Homeovestism: attraction to the clothing of one’s own gender or by people wearing the clothing accepted as appropriate for their gender by society.",
                      "Hybristophilia: arousal by the knowledge that one’s partner has committed a heinous act or crime. This can include cheating, lying, robbery, or murder. This is sometimes known as Bonnie and Clyde Syndrome after the American bank-robbing and murdering duo. One partner is turned on by the other’s bad deeds. Some people find themselves attracted to criminals who are in prison.",
                      "Hypnotism: in an erotic situation, hypnosis could be a form of consensual nonconsent. Try out this kink with some sexy magician/assistant role play.",
                      "Hypoxia: paraphilia for being submerged under water to restrict breathing, a type of erotic asphyxiation. This can be fatal.",
                      "Immobility: a kink involving bondage and forced feeding.",
                      "Impact play: any activity involving hitting, either with body parts or other tools. Hitting, punching, spanking, flogging, whipping and paddling are just a few forms of impact play, and intensity varies with the tool and effort.",
                      "Impregnation: the fascination with making someone pregnant/conception during sex, typically from a man’s point of view.",
                      "Imprisonment: obsession with being locked inside cages, cells, coffins or other areas.",
                      "Infantilism: a specific type of age play where someone plays an infant/baby. This can involve pacifiers, diapers, bottles, etc. A second person may act as a nanny or parent.",
                      "Internal cumshots: similar to a semen fetish but arousal is due to being ejaculated into rather than on. If you’re trying to avoid pregnancy, anal sex is the only safe way to engage in this kink. But STIs can be transmitted through semen even during anal sex.",
                      "Intercrural or interfemoral sex: thrusting between someone’s thighs without penetration.",
                      "Intoxication: taking drugs or alcohol during or before a sex scene. Intoxication can lead to poor decision-making, risky behavior and mistakes that could be dangerous or even fatal, especially when mixed with edge play.",
                      "Jerk off instructions (JOI): Being instructed to told to to masturbate.",
                      "Katoptronophilia: a fetish for having sex in front of mirrors. Some people are simply turned on by seeing themselves in a mirror.",
                      "Keraunophilia: a sexual fascination with thunder and lightning – similar to arousal from thunderstorms (brontophilia). You can’t incorporate it into your sex, but a thunderstorm makes a good backdrop for sexy times! Many people find their levels of desire increase during storms.",
                      "Kigurumi: this fetish is all about wearing anime masks, specifically men who wear masks of women.",
                      "Knife play: a type of edge play activity that involves actual knives or blades or the implication of. Breaking someone’s skin during kinky sex could be quite dangerous.",
                      "Lactation: a lactation fetishist is all about lactating mammaries, that is, boobs producing milk. Many women enjoy the sensation of nipple suckling, and their partners enjoy breastfeeding. Lactation fetishists may encourage lactation when it wouldn’t naturally occur because the milk specifically is their kink (lactophilia), or engage in breastfeeding without milk.",
                      "Latex/rubber: latex, rubber, PVC and similar materials attract our eyes with their sheen. They make for perfect fetish photography, too. Fortunately, you can get your kink on with the help of many retailers that specialize in latex gear and clothing.",
                      "Lesbophilia: men with this kink enjoy lesbian sex more than your typical male. Some may go so far as to imagine themselves as women in girl-on-girl scenarios.",
                      "Lithophilia: a kink for rocks, stones, or gravel. This can be used nonsexually.",
                      "Macro Fetish: people with this kink enjoy partners who are giant. This may mean plus-sized, but it can mean giants in the realm of fantasy roleplaying and writing.",
                      "Macrogenitalism: a fetish for genitals that are particularly large. This isn’t limited just to penises.",
                      "Maiesiophilia: sexual attraction to pregnant women or giving birth.",
                      "Maschalagnia: a fetish dedicated to armpits, including, kissing, licking and smelling. This kink may also involve inserting penises in the armpit for stimulation.",
                      "Masochism: enjoyment of pain, punishment, and torture. Someone who feels this is known as a masochist. Masochists are often but not always submissive.",
                      "Mechanophilia: sexual attraction to and arousal by machines. While other fetishes objectify robots, this one can include a wider variety and may also go along with the desire to have sex in or on a machine such as a car, bike, plane, etc.",
                      "Medical play: role play involving medical scenarios, medical implements (scalpels, needles, speculums, etc) and/or medical uniforms. Medical play often involves an examination of one person by the “doctor,” who may take advantage of the situation. Play piercing is also common in medical play. Any play that breaks the skin can be dangerous if an infection occurs.",
                      "Menophilia: an obsession with menstrual blood. Fetishists of this type don’t mind period sex. In fact, they may prefer it. And they might like going down on a woman when she has her period.",
                      "Merinthophilia: the fetish for bondage. See also vincilagnia.",
                      "Mess fetish (hygrophilia): if you would rather avoid the wet spot on the bed, then this kink probably isn’t for you. Mess fetishists enjoy the mess created by sexual fluids, both male and female fluid. They may use the fluids as lubes, to drink, to “paint” on their partner’s body or passing it back and forth orally (snowballing).",
                      "Micro fetish: the opposite of a macro fetish. Kinksters enjoy when partners are much smaller than them or being the smaller partner. Those who fall into the latter group may enjoy the feeling of being crushed during sex.",
                      "Military: a military fetish that often goes hand in hand with a uniform fetish.",
                      "Mixophilia: a kink related to watching yourself having sex. Recording sex and mirrors are two ways to enjoy this kink.",
                      "Morphophilia: people with this fetish are attracted to bodies and body parts that are different from the norm. They might enjoy amputees, dwarves or people with other deformations.",
                      "Mummification: a kink where someone is bound entirely or nearly entirely to prevent almost all movement. A vacuum bed can achieve full mummification as can plastic wrap, but it can be dangerous if bindings prevent airflow. Mummification can also involve extreme temperatures, so hydration is a must to do it safely.",
                      "Muscles: some people have a fetish for defined or large muscles. Muscle worship is one variant of this kink.",
                      "Mysophilia: this fetish is for dirt and items that have been dirtied, especially by bodily fluids during sex. Used underwear is a common example.",
                      "Narratophilia: a fetish shared by those who enjoy telling and listening to dirty stories, talking about sex or incorporating dirty talk into sex.",
                      "Nasolingus: a fetish for sucking on someone’s nose.",
                      "Nasophilia: fetish for noses.",
                      "Necrophilia: the fetish for human corpses.",
                      "Necrozoophilia: fetish for deceased animals.",
                      "Needle play:  playing with needles can involve breaking the skin and temporary piercing. Needles can also be used to scratch.",
                      "Nonconsensual: a kink for sex without consent (rape). All nonconsensual sexual activities and play are forms of sexual assault or rape. This is illegal, traumatizing and can be dangerous.",
                      "Nullification: kink for removing any body part. This is very dangerous.",
                      "Nullo: an extreme kink for removal of genitals. In practice, nullo is very dangerous and can even be fatal.",
                      "Nyctophilia: if you love the night, you might have this fetish. It can also refer to fetishizing darkness. Scotophilia has the same meaning.",
                      "Objectophilia (Objectum Sexuality): also known as fetishism. This refers specifically to arousal by and sexual activity with an inanimate object such as shoes.",
                      "Oculolinctus: desire to lick eyeballs.",
                      "Oculophilia: an obsession with the eyes.",
                      "Odaxelagnia: kink for biting or being bitten. May or may not involve blood.",
                      "Odontophilia: the general fetish for teeth, which can include biting, licking teeth or even removing them.",
                      "Olfactophilia: attraction to smells, especially pungent body odors. Osmolagnia is the fetish for sweat or gaseous emissions specifically.",
                      "Omorashi: the Japanese word for a fetish related to having a full bladder and urinating on oneself. Often shortened to “omo.”",
                      "Orgasm denial: type of play where someone’s orgasm is denied entirely, limited/ruined or delayed.",
                      "Otherness: sexual attraction to someone from other places, including aliens. See all xenophilia and exoticism.",
                      "Parthenophilia: a fetish for virginal partners.",
                      "Partialism: sexual obsession for specific body parts and not the whole. Eyes, faces, forearms, and feet are all common objects of obsession, but any body part will do.",
                      "Pecattiphilia: fetish for sinning and breaking religious rules.",
                      "Pediophilia: fetish for dolls, especially sex dolls.",
                      "Penis Humiliation: a kink involving insulting a man’s penis, including size, appearance, and performance.",
                      "Peodeiktophilia: showing one’s penis to others (flashing).",
                      "Pet play: any kink where someone acts like a domesticated pet. Cats and dogs are especially common with leashes, collars and food/water dishes used as props.",
                      "Phalloorchoalgolagnia: arousal from pain directed toward male genitals. See also cock and ball torture (CBT).",
                      "Phallophilia: obsession with large penises.",
                      "Phobophilia: sexual obsession with being afraid. This fetish can be directed toward hate as well as fear.",
                      "Phygephilia: fetish for being a fugitive on the run.",
                      "Pictophilia: fetish for watching pornography, especially of the same actor.",
                      "Play piercing (Piquerism, Picquerism): play piercing is performed for temporary decoration as well as for the sensation of breaking the skin.",
                      "Plushophilia: fetish for stuffed animals. These people may have a kink specifically for teddy bears, and they may be furries. Reddit has numerous communities on stuffed animals.",
                      "Pony play: a kink for acting like a pony or its master. “Ponies” can wear everything from blinders to bits to bridles to fake ears and hooves. Ponies are trained by their masters and may even do manual labor.",
                      "Psychrophilia: arousal by being cold or watching others be cold. Having sex in freezers or meat lockers or around ice might fulfill this kink. In other contexts, a psychrophile is an organism such as bacteria that grows in extreme temperatures such as the poles or deep ocean.",
                      "Pregnancy: this kink goes beyond a woman’s pregnant glow. Some people just can’t get enough of a pregnant woman’s powerful and sexy body. It’s so common that there are three different names for it: preggophilia, and maieusophoria. Your partner may even be surprised by how turned on he is when you’re pregnant – and your hormones might have you wanting more sex, too.",
                      "Psychrocism: fetish dedicated to being cold, having sex with a cold partner or using cold objects (ice cubes, cold dildos, etc) during sex.",
                      "Pteronphilia: kink for being tickled specifically by feathers.",
                      "Pubephilia: obsession with pubic hair. A love for pubic hair has been expressed in literature and art.",
                      "Pygmalionism: sexual obsession with human-like images, especially when you made it yourself. This fetish may lead to stimulating oneself with statues or mannequins.",
                      "Pygophilia: partialism to butts and seeing, touching and playing with them.",
                      "Pyrolagnia: sexual arousal from watching or setting fires. Playing with fire is dangerous. At least one study has been done on the subject.",
                      "Pyrophilia: a fascination with fire. Setting fires and using fire during sex can be dangerous. However, massage candles can be used safely because of the wax’s low melting point, and fire cupping is not usually risky.",
                      "Quirofilia: fetish for hands. Some people fetishize certain parts of the hand such as the fingers or fingernails. Others may prefer hands of a certain size or shape. Still others with this fetish may enjoy seeing hands performing certain actions. It could be masturbation or something nonsexual such as washing the dishes.",
                      "Rape fantasy: a fetish for acting out a pretend rape (consensual nonconsent). This fantasy can occur on both the victim or perpetrator’s sides. Arousal at the idea of rape is known as raptophilia.",
                      "Revving: kink for watching someone rev an engine, especially when they wear heels. Also known as “pedal pushing” or “pedal pumping.” There are plenty of videos on pornography sites and even Youtube featuring women in bare feet or high heels pushing the gas pedal. Sometimes these women are referred to as gas pedal honeys.",
                      "Retifism: the fetish for shoes and footwear. Also known as altocalciphilia.",
                      "Rhabdophilia: a fetish for receiving physical beatings such as flogging or whipping.",
                      "Robotism: kink for androids (male robots) or gynoids (female robots) or cyborgs.",
                      "Ropework: a kink for rope as used as the specific type of bondage. Popular types of ropework include the Japanese-inspired shibari, more correctly called “Kinbaku”.",
                      "Rimming: a kink for giving or receiving rim jobs. Aka. Oral sex in and around the anus.",
                      "Sadism: the kink for providing pain. Masochists and sadists often come together to meet one another’s kinky needs.",
                      "Savantophilia: fetish for people who have a cognitive impairment or delay.",
                      "Scatophilia a fetish for fecal matter. Also known as coprophilia.",
                      "Sensation play: a light kink where partners exchange sensations on the skin. Items with different textures (soft, hard, bumpy, smooth, cold, hot, etc) can be run across the skin. Pain isn’t involved, but you can alternate between pain and sensation during light BDSM play.",
                      "Sensory deprivation: any play that prevents someone from using one of their five senses. Blindfolds block sight, gloves prevent touch, earmuffs deprive the sense of hearing, etc.",
                      "Siderodromophilia: a fetish for trains or engaging in sexual activity on a train.",
                      "Slime fetish: a kink for slime and slimy things. Tentacles are a prime example of a slime fetish in popular media. This fetish is closely related to the mess fetish.",
                      "Sneezing Fetish: a kink for watching someone else sneeze. This person is usually naked. Sneezing elicits a bodily response somewhat similar to orgasm. People with a sneeze fetish might also participate in tickling and forced urinating kinks.",
                      "Snuff: a fantasy fetish for killing someone or being killed. Snuff is often considered to be an urban legend, and it’s an obviously dangerous and illegal in practice.",
                      "Somnophilia: the fetish for sexual partners who are asleep. It is a rare fetish. People with this fascination may enjoy the “sleeping princess” trope. In reality, a partner should specify prior consent to sexual activity that happens or begins while they are asleep because sleeping people cannot give consent. Definitions differ, however.",
                      "Sounding: a kink for inserting thin tubes, usually made of glass or metal, into the urethra. This is one of the most common forms of urethral play. Kinksters often use medical sounds or similar tools, and sounding can be part of medical play. Sounding can be dangerous, especially if the item inserted breaks off internally or is not sanitized beforehand.",
                      "Spanking: this is a fetish that many people have tried in the bedroom. A firm hand comes into play as punishment or enticement in many power exchange relationships, including domestic discipline relationships and schoolgirl roleplay. You might enjoy spanking from time to time even if you don’t consider yourself all that kinky, but spanking can also be quite extreme.",
                      "Stigmatophilia: the fetish for piercings and sometimes tattoos. See body modification fetish.",
                      "Stockings: items that are often fetishized. Some people like all of them. Others prefer those that are lace-topped, hooked to a garter belt or with a visible seam down the back.",
                      "Strap-on: fetish specifically for using strap-ons. Anal, oral or vaginal penetration can be achieved. Anally penetrating a male with a strap-on is known as pegging.",
                      "Stygiophilia: arousal by thoughts of hell and eternal damnation.",
                      "Stuffing: eating until the point of physical pain.",
                      "Suspension: the practice of suspending someone from the ground or being suspended yourself. Suspension can be accomplished with ropes, harnesses and other devices and items.",
                      "Symphorphilia: fetish for watching car accidents or other traumatic incidents.",
                      "Taphephilia: fetish for being buried alive. This may be connected to an imprisonment kink.",
                      "Teasing (Tantalolagnia): To enjoy teasing as sexual gratification. This may be prolonged sexual teasing or teasing in the form of insults and ribbing.",
                      "Technophilia: a fetish for any technology such as robots, AI and sex machines. Kinks for cybernetic enhancements fall into this category, and some may fetishize the idea of amputations.",
                      "Teleiophilia: the erotic preference for persons between the age of physical maturity and the onset of middle-age.",
                      "Telephonicophilia: the fetish for phone sex and dirty talking over the phone.",
                      "Tentacle fetish: fetish for tentacles. Many people enjoy animated erotica/pornography with tentacles, and tentacles dildos also lend to this fantasy.",
                      "Teratophilia: attraction to people with bodily deformities. This umbrella term includes several other fetishes on this list including stigmatophilia, morphophilia, and acrotomophilia. However, it may also refer to a sexual attraction to “actual” monsters.",
                      "Thesauromania: kink for collecting women’s clothing. The collector may focus on specific items/categories such as underwear.",
                      "Tickling (Knismolagnia, Knismo, Titillagnia): while tickling can be a form of teasing, it’s a kink in its own right for some people. Those who enjoy tickling may enjoy surrendering control or struggling to retain it. Tickling to the point of urinating is also one flavor of this fetish. Tickle torture is a kink for tickling or being tickled while bound.",
                      "Transformation fetish: kink for transforming into other people or even non-human creatures. TF is common in hentai and some written erotica.",
                      "Trichophilia: hair fetish. Hair pulling during sex.",
                      "Triolism: a fetish for threesomes. This may include a kink for watching your partner have sex with someone else.",
                      "Tripsolagnophilia: massage fetish. Even if you don’t have a fetish, a sensual massage can be relaxing and it’s good foreplay!",
                      "Underwear fetish: the fascination with underwear, usually women’s underwear. Men with this fetish will collect, wear or smell underwear.",
                      "Uniforms: many women love a man in uniform, but not every couple incorporates this into their sex lives. Those who do just might have a uniform fetish. Uniforms, of course, can make someone seem like a powerful person (military, police and firefighter uniforms are some of the most popular) or help you get into the role of a naif (schoolgirl, waitress, Playboy bunny) and a well-fitted uniform shows off a person’s body in just the right way. If your job requires a uniform, you’re in luck. Otherwise, you can hit up a costume shop or even buy uniform-inspired lingerie.",
                      "Ursusagalmatophilia: kink for teddy bears or dressing up as a teddy bear/animal.",
                      "Urtication: using the nettle plant to sting a partner’s skin.",
                      "Vaccinophilia: vaccination fetish. See also medical play and belonephilia.",
                      "Vicarphilia: being sexually vicarious, specifically related to enjoying other’s stories of sexual activity.",
                      "Vincilagnia: kink for being tied up and at the mercy of another person. This is a type of bondage fetish.",
                      "Vomit Fetish (Emetophilia): a sexual obsession with the act or substance of vomit.",
                      "Vore/Vorarephilia : sexual desire to be eaten alive or to eat someone while they are still alive. Vore would incredibly dangerous and illegal if attempted in reality, but it remains a fantasy for most people. You’ll find plenty of art and stories dedicated to vore on DeviantArt, Tumblr, and Reddit.",
                      "Voyeurism: a kink for watching someone else while naked or engaged in sexual activity. Voyeurs and exhibitionists make excellent pairings. Non-consensual voyeurism may be against the law. Ecouteurism is a related kink for listening to someone have sex without permission. The fetish is also known as scopophilia.",
                      "Watersports (urophilia): A relatively popular fetish, watersports are also known as golden showers. This kink involves playing with urine, being peed on or urinating on another person. Want to know more about golden showers? A particular form of this is wetting: urinating in one’s underwear and clothing.",
                      "Wax play: using wax during sex. Wax comes in the form of massage candles, which are relatively safe. But other types of wax may have a higher melting point and be more dangerous. Flames used to melt wax also pose a risk.",
                      "Weapon fetish: sexual arousal due to weapons. This appears in some erotic media.",
                      "Wet and messy (WAM) fetish: being turned on by being soiled by things other than bodily fluids. Also known as sploshing. This can include food.",
                      "Xenophilia: sexual attraction to exotic people or objects.",
                      "Xylophilia: fetish for wood. It may also be described as an attraction to nature, sexual or in general.",
                      "Yeastiality: sexual activity involving bread, especially warm dough. This may be an alleged kink. Introducing yeast to the genitals can lead to an infection.",
                      "Yiffing: sex with stuffed animals or a furry.",
                      "Zelophilia: arousal due to jealousy, either your own or someone’s jealousy over you. Cuckhold fantasies are one such example where men know – and sometimes watch – their wives engaging in affairs.",
                      "Zentai: wearing skintight suits while grinding against others in similar suits.",
                      "Zoophilia: dressing like an animal for sex or feeling romantic attraction to animals.",
                      "Zoosexual: sexual attraction to animals. See bestiality.",
                      "Zwischenstufe: the sexual obsession with people of the same sex."
                      ]
        # xp列表_sm分表_sm type分表
        xp_sm_type = [
            "【DOM】爸爸/妈妈型支配者：关怀和保护，使其成为那些脆弱、敏感或需要关心的顺从者的好伴侣。养育型的支配者通常喜欢顺从者的顽皮、可爱和天真，甚至是他们的天真，并认真对待顺从者的福祉。责骂 – 当顺从者犯错时；体罚– 当他们越界时；安慰 – 拥抱你的顺从者并告诉他们他们是乖女孩或乖男孩；保护 –他们顺从者的感情；表扬 –表扬他们的伴侣听话和服从（如果你有表扬癖，这会非常好）",
            f"【DOM】主人/女主人：“主人”和“奴隶”常常进行24/7的权力交换，这也被称为完全权力交换（TPE，total-power-exchange)。在TPE中，权力交换从未停止；相反，它渗透到情侣生活的方方面面，主人或女主人掌控他们共同生活的全部或大部分方面，可能剥夺奴隶争辩或拒绝的能力。提供许可 – 例如，允许顺从者自慰、进食、上厕所、触碰自己或说话；施加惩罚 – 当命令没有被准确遵循时；承担责任 – 为奴隶的身体、心理、情感和经济福祉负责。最显著的TPE条款：{random.choice(xp_sm_tpe)}",
            "【DOM】顽童调教者：如你所料，调教淘气鬼者是淘气鬼的对手。淘气鬼是以叛逆和顽固著称的顺从者。调教淘气鬼者必须同样强大，以赢得淘气鬼的顺从，并理解这种行为的本质。当调教淘气鬼者对他们的顺从者使用惩罚或武力时，这种关注最终会让淘气鬼感到被渴望、被关心，甚至是安全。成功的调教淘气鬼者所需的耐心和冷静并不是每种支配者都具备的特质。一些支配者更喜欢不会顶嘴的顺从者。然而，许多调教淘气鬼者发现，调教淘气鬼的挑战和行为是有趣的。身体束缚和压制 – 如果淘气鬼反抗，捆绑可以帮忙；下达命令 – 可能会被忽视或反抗；提供惩罚 – 在必要时，但不会失去冷静；展示力量 – 应对淘气的行为，退缩或显得软弱不是淘气鬼想要的；保持耐心和尊重 – 向淘气鬼展示他们并不是难以应对的，并且受到关心",
            "【DOM】绳艺主导/绳艺师：在BDSM中，绳艺主导或绳艺师是特别或仅对绳缚感兴趣的支配者。他们可能涉猎从悬吊到胸部束缚到捆绑等各种技巧。绳艺师有时可以在玩乐派对、地牢或会议上找到，他们的伴侣甚至可以完全穿着衣服。严肃的绳艺主导通常会拍摄他们的作品，包括他们自己发明的捆绑方式。准备 – 绳子和配件如快挂；关注顺从者 – 在开始之前讨论任何伤害或问题，绑缚时关注身体反应等；仔细捆绑 – 确保绳子不扭曲或摩擦皮肤；不拉扯绳子穿过皮肤或让松散的绳子击打顺从者；确保顺从者的安全 – 检查绳子是否有磨损，悬吊是否能承重，避免对器官/压点施压，听从安全词，并在紧急情况下迅速解开或放下顺从者；练习 – 绑结可以通过观看视频、阅读书籍或网站，以及参加工作坊来进行练习",
            "【DOM】财务支配者：这种类型的支配者是财务顺从者（有时称为支付猪）的对手。“Fin”代表财务，但财务权力交换不应与传统的性工作混淆，性工作者提供性刺激以换取金钱。相反，财务支配者以某种方式控制他们的顺从者的金钱。知道有人控制他们的财务对财务顺从者来说是一种吸引力。由于控制的是财务而不是身体，这种安排非常适合异地恋。限制对金钱和账户的访问 – 包括信用卡、银行账户等；提供金钱访问权限 – 即津贴；从财务顺从者那里接收钱 – 作为服务的报酬；羞辱玩法 – 例如言语羞辱（这是某些但不是所有财务支配关系的重要组成部分）",
            "【DOM】服务型主导：如果你是那种喜欢通过提供感觉和刺激来满足伴侣需求的支配者，你可能是服务型主导。服务型主导可能并不认为支配是他们性格的一部分；相反，他们在BDSM场景中扮演积极角色，因为他们喜欢为他人服务。这种角色在场景结束时也随之结束，他们的理想伴侣可能是受方，但不一定是顺从者。服务型主导可以被视为从下而上的支配者的一种对立面。一些专业的支配者，包括专业女支配者，也可以被视为一种服务型主导。绑缚顺从者 – 使用绳子、手铐、眼罩或其他束缚工具；进行冲击玩法 – 如打屁股、鞭打、拍打、鞭笞等；提供刺激 – 温度玩法、刀片、拍打、电击等；协助其他支配者或主导者 – 进行惩罚等；与受方协商– 在场景前；注意安全词 – 在场景中",
            "【DOM】宠物主人：一些顺从者会扮演宠物的角色，比如狗、猫和马等。他们的支配伴侣通常是主人。这些情侣共同模仿动物与主人之间的关系，行为因具体动物而异。例如，马匹玩法可能涉及比其他类型的宠物玩法更多的训练和体力劳动。宠物玩法为独特的配饰和性玩具创造了许多机会，包括项圈、口套、牵引绳、马具等。训练 – 他们的马、狗、猫或其他宠物；准备配饰和装备 – 项圈、马具、口套；梳理他们的宠物 – 梳毛和洗澡；提供其他照顾 – 如水、食物和关注",
            "【DOM】女支配者（Domme）：“Domme”是“dom”的女性化版本，因此它指的是女性支配者，发音相同。为伴侣提供刺激和感觉 – 快感、疼痛、感官支配、束缚等；下达命令和惩罚 – 可以包括羞辱或女性化（sissification），或布置顺从任务；关心伴侣的福祉 – 身体、心理和情感方面；反向插入– 使用绑带进行肛门插入，可以刺激前列腺",
            "【DOM】原始型支配者：原始型支配者喜欢野性和动物性的虐恋与BDSM，这在许多人看来属于边缘玩法（风险更高的癖好）。这与温和的支配者表现出的行为截然不同。原始行为可以通过伴侣（有时称为猎物）的抓挠、刮伤、咬等动作触发。一些原始型支配者更喜欢依靠身体的力量，而不是束缚和其他工具。偶尔，一些原始型支配者会与其他原始型支配者或首领一起玩耍，权力交换来回流动，这在其他类型的支配者中较少见。追捕 – 并压制顺从者；进行粗野性爱 – 咬、抓、扯头发等‘’发出动物般的声音 – 包括低吼；利用感官 – 尤其是嗅觉",
            "【DOM】白骑士型支配者：白衣骑士是一种将自己视为顺从者的拯救者，纠正错误并与敌人作战的支配者类型。许多人将自己视为和被视为利他主义者。骑士精神通常是他们信仰和个性的基石。当遇到无法解决的问题时，白衣骑士可能会感到沮丧，并且可能过分关注拯救人们，选择脆弱或受伤的伴侣。这种类型的支配者通常是男性。解决问题 – 尤其是为了他们的顺从者；保护 – 他们的伴侣和家人；宠爱顺从者 – 他/她是公主（或王子），而支配者是国王（或皇后）",
            "【DOM】施虐者：施虐者是一种喜欢制造疼痛的支配者类型。他们喜欢想出独特的方法来给他们的伴侣带来痛苦。这种痛苦可以是身体的，也可以是心理的，比如羞辱和屈辱。当然，我们仍在谈论BDSM，必须要有同意，所以这并不是真正会伤害伴侣的施虐者。发火把愤怒发泄在伴侣身上，或忽视顺从者的福祉的人不是安全的支配者。造成痛苦 – 身体和心理（羞辱）；提供后续照料 – 处理顺从者掉落和游戏过程中造成的身体伤害",
            "【DOM】皮革型支配者：这种类型的支配者是更大的皮革亚文化的一部分，起源于军队成员，主要由男同性恋组成。因此，一些皮革型支配者（和顺从者）可能不认为自己是BDSM社区的一部分，也不认为自己拥有D/s关系。展现阳刚气概 – 通过皮革服装（顶部人物通常会戴穆尔帽），个人风格以及参加摩托车俱乐部来展现；参加皮革活动 – 如Folsom街市等游行和比赛；实践传统 – 通常基于军事礼仪",
            "【DOM】快感型支配者：这是一个相对较新的术语，实际上在现实中并没有得到广泛使用。快感型支配者通过满足伴侣的性需求来获得性满足感。他们能给予的快感越多，就越好。快感型支配者通常是男性，而他们的顺从者是女性。一些人不同意这是一种支配者类型，因为可能没有任何权力交换。快感支配可能被认为是服务型主导的一个方面。让伴侣悬于性高潮边缘 – 多次将顺从者带到高潮边缘然后再次停止；拒绝高潮 – 通过物理动作或口头命令，可能破坏高潮；用高潮折磨 – 刺激伴侣尽可能多地达到高潮，甚至在感觉不舒服之后",
            "Top：场景中的主动参与者，与Bottom相对应。他们不一定是支配者，可能只在一个古怪的场景中扮演主动角色，也许是为了取悦伴侣，而没有支配的个性或真正参与权力交换。你不会真正听到有人被描述为“支配的Top”，因为这种差异。但是，你可以把他们看作是“Bottom支配者”。打顺从者 – 或进行其他冲击游戏；用绳子、口球、眼罩或其他工具束缚他们的伴侣；尊重安全词 – 在使用时暂停或停止游戏；了解他们的工具 – 以安全和正确地使用它们",
            "【DOM】喂食者：这绝对是一种较不常见的支配者类型。喂食主义是一种非常特定的恋物，在这种恋物中，人们通过吃东西（或喂食他人）到导致不适的程度来获得满足感。被喂食者或增重者是吃东西的人，而喂食者通过提供食物参与其中。喂养伴侣 – 包括准备食物和鼓励超出舒适范围的进食；恋物（肥胖）体 – 当体型变大时，会变成一种恋物；可以包括身体崇拜（特别是涉及胃部的）",
            "【DOM】导师：支配性导师并不是另一种支配者，而是一个在这种生活方式和可能的社区中经验丰富的支配者，这使他们能够指导那些对这些事情新手的人。顺从者也可以成为导师。在导师方面，有些支配者会指导其他支配者，帮助他们学习他们需要引导（未来）顺从者的技能。一些顺从者出于同样的原因寻求顺从者导师。然而，一个支配者可以指导一个顺从者，以提供有关顺从者无法获得的BDSM的信息和专业知识。支配性导师和顺从性学员不会像在D/s关系中那样交换权力。利用指导新顺从者的人可能更像是一个伪支配者。倾听学员 – 排解、担忧、问题；给予建议 – 无论是对具体问题的回答还是更普遍的建议； 表现耐心 – 对于对BDSM/kink新手；教学 – 如何使用工具、沟通、阅读身体语言等；提供结构 – 通过任务或作业，如果有助于学员学习的话；帮助 – 学员找到他们自己的支配或古怪的风格，而不是把自己的支配类型强加给对方",
            "【DOM】温和/柔和型支配者：柔和型或温和型支配者可能不喜欢与顽皮的人或其他顺从者类型一起玩，他们更叛逆。一些柔和型支配者完全避免任何会造成疼痛的事物，而另一些则会包括轻微的活动，比如打屁股。培育伴侣 – 而不是期望严格的顺从者规则或惩罚；鼓励成长和自爱 – 在伴侣身上；严肃讨论 – 而不是惩罚；强调事后关怀 – 在场景之后",
            "【DOM】生育者：在生育者恋物社区内对这个术语的使用似乎没有达成共识，这可能有点令人困惑。一些人对成为父母或使某人怀孕的想法感到非常兴奋。这可能仅限于角色扮演，其中使用淫秽语言和未察觉的避孕措施。然而，有些人则将其扩展到实际怀孕。关于“生育者”的两个常见定义包括对这种恋物感兴趣的*任何人*或是使别人（男性）怀孕的人。当涉及到让别人怀孕时，确实可能存在一些支配性行为。讨论恋物 – 表达他们有多么想让某人怀孕；插入并射精 – 没有避孕套/保护措施（这可能导致性传播感染以及怀孕）；恋物化 – 他们伴侣怀孕或具有生育能力的身体（也许享受怀孕期间的性生活），潜在地将其视为自己的财产",
            "【DOM】假支配者：假支配者完全是为了满足自己的需求，而不关心伴侣或认真对待支配者的责任。很少有人会称这种支配者类型为关心的支配者。他们可能会更关注性行为而不是亲密权力交换的其他方面，忽视安全预防措施，比如事后关怀，期望任何顺从者服从，而不尊重需要时间了解潜在伴侣的事实，无论你是否古怪。真正的支配者尊重安全和你的界限，并理解如果你需要慢慢进行或者在玩耍或建立关系之前彼此审核。",
            "【sub】顽童顺从者；对于外人来说，顽童顺从者可能看起来不太听话或不太顺从。然而，仔细观察会发现，这种类型的顺从者喜欢挑战权威，但这一切都是在游戏中进行的。这样做会让顽童引起伴侣的注意，通常被称为顽童驯服者。对于顽童来说，这种关注是最终的奖励。顶嘴 – 当受到责备时；不服从命令 – 当被要求做某事时；抵抗 – 当你的支配者束缚你时",
            "【sub】服务型顺从者：服务型顺从者是最常见的顺从者类型之一，他们专注于为他们的支配性伴侣执行任务。服务可以采取实际的形式，如做家务、办差事和支付账单。然而，服务型顺从者也被期望在性方面为他们的伴侣提供服务，并且可能需要以特定方式执行任务。充当人类家具、跪着或为他们的支配性伴侣着装都是服务型顺从或BDSM更为独特的例子。做饭 – 并为伴侣服务，让他们先吃或选择菜单；为伴侣或客人 – 服务和加满饮料；可以品尝饮料以确保正确；性服务 – 为伴侣或客人提供性服务；清洁 – 家庭、商业、车辆、衣物，甚至给支配者洗澡；照顾孩子 – 可以是关系中的一部分；筹划 – 派对、假期或其他活动；为为支配者所做的任务 – 感到自豪",
            "【sub】顺从的公主：顺从的公主通常希望被崇拜和膜拜。只有在这种情况下，她才会将控制权交给她的支配者。这并不是因为她不尊重她的伴侣；她只是对自己评价很高。这与“枕头公主”不同，后者是指在LGBTQ+社区内主要用于指代更喜欢接受而不是给予快乐的女性。希望得到照顾和呵护 – 与她们对自己的看法相符；略微抗拒 – 用撅嘴和哭闹；期待 – 被像皇室成员一样对待，包括从她们的支配者那里受到呵护",
            "Bottom：Bottom接受刺激，但这种刺激可能只持续一段时间。通常，Bottom享受刺激，但并不是顺从的，因此他们对于D/s关系或接受命令并不感兴趣。接受刺激和刺激 – 柔和的或更痛苦的感觉；要求刺激 – 并不一定涉及权力游戏；在场景结束后重新获得控制权；在场景之前协商限制 – （BDSM合同可能会有所帮助）",
            "【sub】受虐狂：受虐狂是指那些真正喜欢疼痛的人，也许实际上是如此。受虐狂中最极端的形式是痛苦荡妇，他们喜欢强烈的疼痛。受虐狂可能不会把心理控制权交给他们的伴侣。不听话或反抗 – 以鼓励身体惩罚；享受游戏中的惩罚 – 打屁股，Impact play等等；尝试痛苦的癖好 – 穿针引线、刀具游戏、火游戏等；要求更多 – 强度或刺激",
            "【sub】聪明受虐者（SAM）：聪明的受虐者或SAM在某种程度上是痛苦荡妇和顽劣者的结合。他们展现了一种好玩的一面，通常只对他们的伴侣展现，而不对其他人展现。然而，SAM比顽劣者走得更远，因为他们是渴望痛苦的受虐者，无论是身体上还是情感上。回嘴 – 开玩笑、嘲笑他们的支配者、质疑他们，总是嘴硬；做鬼脸 – 微笑等；转身背对 – 当他们的伴侣在讲话或要求关注时",
            "【sub】求虐型顺从者：虽然顽劣者可能只是反抗，而聪明的受虐者则挑衅他们的伴侣以引发他们的愤怒，但“求虐型”顺从者完全是关于身体上的斗争。他们有时被称为好斗的底部。足够强大、聪明和迅速的支配者将“征服”这个人，从而引出他们的顺从；抵抗 – 直到被制服；反抗 – 推搡，可能踢，打等；逃跑 – 逃离他们的伴侣",
            "【sub】模特型顺从者：模特型顺从者喜欢打扮漂亮并展示自己。他们可能会避开那些会留下痕迹的活动，因为这会破坏他们的美丽，反而更倾向于那些能增强美感或让他们看到自己的活动。这些人可能根本不是真正的顺从者。有些人喜欢在镜头前表现得像模特，但往往不服从、不接受疼痛或不参与其他形式的束缚。当然，一个人可以既是模特，又是活跃的顺从者。 打扮 – 穿着性感装备；摆姿势 – 为相机拍摄；购买或借用装备 – 用于拍摄；被束缚 – 为拍照目的；参加活动 – 与品牌、其他模特或摄影师合作；推广 – 品牌、产品或服务；在社交媒体上发布 – 推广自己并分享作品；可能包括出售视频或图片；观察 – 在镜子或屏幕上；记录 – 他们的活动，即使他们不打算以后观看",
            f"【sub】奴隶：奴隶从未停止过顺从，他们将所有的控制权都交给了他们的伴侣。奴隶通常涉及24/7或完全权力交换(TPE)关系。请求许可 – 常见的请求包括手淫、高潮、吃饭、说话或上厕所；服从命令 – 包括明确的和隐含的命令；完全交出控制权；随时性地可用。最显著的TPE条款：{random.choice(xp_sm_tpe)}",
            "【sub】宠物：宠物可以包括小马女孩和男孩、小狗、小猫等。他们像动物一样行动并与主人建立联系。每种宠物顺从类型都有其自己的规范和期望，因此在进一步了解这种顺从类型时，请记住这一点。穿戴服装/配饰 – 项圈、马具、耳朵、尾巴、口罩、骑具、皮革或毛皮装备等；摆姿势/移动 – 用四肢走路、在牵引绳上、连接到拴马桩等；饮食 – 用碟子、水碗等；服从 – 接受常给动物的简单命令，包括对骑马鞭的回应等；睡觉 – 在狗窝里、床边、地板上等；发出动物叫声 – 嘶鸣、喵喵叫、吠叫或用爪子拍打；自我清洁 – 舔自己，即使只是装装样子；玩耍 – 用球或其他宠物会喜欢的玩具",
            "【sub】家庭纪律Bottom：家庭纪律（Domestic Discipline，简称DD）是一种生活方式，在许多方面与BDSM有重叠，但许多人并不认为它是BDSM。相反，家庭纪律是一种使家庭运转顺畅的方式，通常由男性/丈夫/父亲控制他的妻子/伴侣和孩子。即使没有其他BDSM活动，打屁股在家庭纪律中也很常见。DD是一种传统且相对保守的生活方式，可能与家庭的宗教信仰相辅相成，其中丈夫是家庭精神健康的守护者。照顾 – 家庭和孩子；接受惩罚 – 特别是打屁股；服从 – 她的丈夫；祈祷 – 虔诚地",
            "【sub】卧室顺从者：卧室顺从者对BDSM生活方式或关系不感兴趣。他们只是在卧室内享受放弃权力，而在卧室外恢复“正常”。只要有时间限制，顺从是可以的。任何卧室外的顺从期望都是不受欢迎的。这也被称为性顺从者。被束缚 – 出于性目的；接受刺激和冲击 – 包括感官支配、Impact play等；接受命令 – 仅在场景期间；提供性快感 – 通过口交、阴道交、手交或肛交",
            "【sub】财务顺从者：财务顺从者（finsub）将他们的财务控制权交给他们的财务主导（findom或findomme）。有时使用“付款猪”（paypig）一词，通常指的是与女性财务主导在一起的男性财务顺从者。财务支配可以很容易地在线进行或在异地关系中进行。支付给主导者 – 以现金、商品、服务、债务偿还、住房等形式；服从 – 财务主导者的命令；被羞辱 – 由财务主导者进行，包括其他羞辱游戏和言语虐待；提供访问权限 – 财务账户等；请求 – 使用自己的钱，类似于津贴或零花钱",
            "【sub】绳子兔子：喜欢被绳子绑起来的顺从者有时被称为绳兔子。他们为绳子在皮肤上的感觉而活。通常，绳子兔子是女性，而他们的绳子Top（常称为“索具师”）是男性，但这并不总是如此。被束缚 – 长时间的绑缚需要极大的耐心；摆姿势 – 供拍照；使用安全词 – 在任何有问题的迹象出现时",
            "【sub】我家主子永远是对的型顺从者：这种类型的顺从者与其说是他们如何对待他们的主子，不如说是他们在其他人面前的表现。这类顺从者认为他们的主子拥有世界上所有的经验和知识。这种看法可能源于顺从者自身缺乏经验或天真。有时，主子也缺乏经验。这种类型的关系有点像新关系能量——令人兴奋但可能误导。拥有这种顺从性格的人有时会让人烦恼。不停地谈论他们的主子 – 不断重复讲述主子的故事；完全奉献 – 完全投入到他们的伴侣中；隐瞒自己的意见 – 或接受主子的意见；无视他人的论点 – 没有过多的“证据”。这种类型的顺从者容易成为虐待者的牺牲品。这种关系只要主子对顺从者好就能维持，但顺从者很容易忽视警示信号，陷入危险境地。",
            "【sub】比你更奴性：你不需要猜测某人是否是这种类型的顺从者，因为他们会直接告诉你。他们是24/7的顺从者——或奴隶——并认为其他人也应该这样。否则，这些人就不是*真正的*顺从者。不喜欢被称为顺从者 – 而不是奴隶；大声且频繁地宣称24/7顺从是最好的 – 常常认为自己比别人更顺从，牺牲更多；避免使用安全词 – 因为他们认为“真正的顺从者”应该没有安全词；可能根本不会设定安全词",
            "【sub】真正的顺从者：那些完全展现所有常见顺从特质的顺从者有时会得到这个昵称。这些顺从者通常缺乏经验，并且急于证明自己，这可能导致一些问题。服务主子 – 或任何人，而不仅仅是他们自己的主子；忽视警示信号 – 因为他们渴望成为顺从者；将他人的需求置于自己的需求之上 – 即使他们应该优先考虑自己；表现得胆怯或温顺 – 使他们容易被控制或虐待；避免互动 – 或者通过隔离自己来试图顺从，不想冒犯任何人",
            "【sub】训练中的顺从者：训练中的顺从者可以有多种含义，并不完全与某种特定的顺从性格类型有关。首先，这可以是关系初期，主子教授他们的期望。训练中的顺从者也可能在与非关系中的人学习如何顺从，为未来的关系做准备。无论哪种情况，都有很大的重叠性。学习 – 了解一般的BDSM社区、礼仪和他人的期望，通过媒体等途径获取信息；尝试 – 不同类型的顺从，以了解自己属于哪种类型的顺从者；因错误而受罚；在犯错后改进 – 这些错误是难免的；观察其他顺从者/关系 – 如果可能的话；自我反思 – 找到自己的需求、目标和内在力量；寻求保护 – 来自他们的主子或训练者；制定训练计划 – 包括时间表、具体步骤和练习空间；记日记 – 记录感受和经历，可能允许主子阅读"
            ]
        # xp列表
        xp_list = ["叙述猛烈的感谢之语",
                   "净说讽刺的话",
                   "对对方的话肯定然后又否定",
                   "嗤笑然后道歉",
                   "不听人说话光顾着自己说",
                   "「不能不考虑到这个吧」",
                   "「还是说，有隐藏着什么吗？」",
                   "「真是奇妙」",
                   "「大体上已经明白了」",
                   "「保持沉默」",

                   "随便将搜查对象的包或者抽屉打开搜查",
                   "横插一脚进警察的搜查",
                   "为了搜查非法入室或者黑客",
                   "进入禁止进入的地方",
                   "偷听或者偷看警察的搜查",
                   "没有许可就拆解证据",
                   "欺骗搜查对象问出情报",
                   "随便碰触助手/同伴的随身物品",
                   "随便将证据拿走",
                   "随便就开始了鉴定",

                   "隐藏自己身份和关联者说话",
                   "隐瞒情报的同时询问",
                   "和搭档/他人一起以演技问出情报",
                   "假装路过的人偷听关联者的对话",
                   "假装偶然拿到证物",
                   "故意一直做作地装傻",
                   "以演技故意惹怒关联者来引出情报",
                   "轻微威胁关联者",
                   "主张自己有遗失物品在现场寻找证物",
                   "对关联者诱导询问",

                   "用搭档/他人的身体重现事件",
                   "解开谜题后很开心地笑",
                   "废寝忘食搜查后突然倒下",
                   "考虑事情时谁的声音都听不见",
                   "开始在附近的地上或者墙壁上画事件的相关图",
                   "不断冒出和事件相关的句子难以停止",
                   "完全没考虑除了解决事件之外的事情",
                   "开始连绵不断地说事件的流程",
                   "踏入事件现场进行调查",
                   "就算在用餐也不断说着事件的话",

                   "老实不客气地接受搭档/他人的信任",
                   "丢下搭档/他人先走了",
                   "质问搭档/他人对事件的看法",
                   "对搭档/他人自我炫耀",
                   "关于事件对搭档/他人出题",
                   "和搭档/他人因为细枝末节的事情吵架",
                   "对搭档/他人摆出一副老师的样子",
                   "以搭档/他人会跟上的前提随意行动",
                   "对搭档/他人进行详尽仔细的事件说明",
                   "突然开始在搭档/他人的耳边说话",

                   "阅读大量书籍",
                   "大声放喜欢的音乐",
                   "在解什么算式",
                   "吃大量喜欢的东西",
                   "一直对着电脑或者手机屏幕调查着什么",
                   "解小谜题",
                   "指点国际象棋或者将棋",
                   "坐在饮茶店等着什么",
                   "一直在睡觉，突然起来了",
                   "暂时什么都不干",

                   "在进餐的时候突然就解开了谜",
                   "和助手/同伴闲聊的时候突然就解开了谜",
                   "听到聊天内容的时候突然就解开了谜",
                   "洗澡的时候突然就解开了谜",
                   "梦中突然就解开了谜",
                   "风吹过的东西解开了迷",
                   "看书时找到了事件的启发",
                   "再次访问场景的时候灵光一闪",
                   "确认资料的中途灵光一闪",
                   "和关系者交谈中途灵光一闪",

                   "突然哭泣",
                   "突然愤怒",
                   "突然笑出声来",
                   "突然变得情绪高涨",
                   "突然高兴",
                   "突然大声喊叫",
                   "突然开始嗤笑",
                   "突然开始讲述事件的悲伤",
                   "淡然行事",
                   "机械一样只是在做已经决定好的事情",

                   "做会被叫停的事情",
                   "消失一段时间又回来了",
                   "从预想外的地方（地下或者空中等）登场",
                   "想到什么突然跑了起来",
                   "责怪自己不中用",
                   "在不知道的时候就解开了事件的一个谜",
                   "一副知道事件相关事件的样子但是对谁都不说",
                   "有留下便条或者邮件报告但是看不到人影",
                   "看到钟表突然开始行动",
                   "阅读和事件看来没什么关系的报纸记事",

                   "读取人心，完成那人所想(拜托)的事",
                   "与他人的悲喜同步，同喜或同悲 ",
                   "时常不忘笑容，用平稳的话语使周围的人安心",
                   "通过饮食，与人打好关系",
                   "准确地将知识引用发挥出来，得到周围人的尊敬",
                   "通过计算推导感情，理解人心",
                   "考虑被害者的心情，慨叹着已失去的人或物",
                   "讲述自己打算要做的事，促进他人理解",
                   "谈论故乡或双亲的话题，尝试从源头上了解那个人",
                   "认同助手/同伴所说的话",

                   "过分地读取人心，引起不适",
                   "想与他人同喜同悲却做过头，让人害怕",
                   "虽然总是挂着笑容，但笑得太假反而让人不适",
                   "虽想通过饮食打好关系，用餐方式却很奇怪",
                   "展示学识时却炫耀起罕有人知的知识范畴，引人害怕",
                   "想装作理解感情的样子，却没能理解关键之处 ",
                   "慨叹已失去的人或物时，只能用数字来表达",
                   "做事想有人情味，结果却采取了乍看很难懂的行动 ",
                   "想要谈论故乡或双亲，却合不上话题",
                   "装作认同助手/同伴所说的话，却被看穿",

                   "将搭档/他人的小物件调包（调换） ",
                   "向食物中加入大量调味料",
                   "披着床单现身吓人",
                   "变装打扮后登场 ",
                   "对休息中的搭档/他人恶作剧，让对方理睬自己",
                   "唐突地戳一戳搭档/他人的脸 ",
                   "不经意地试着触碰搭档/他人",
                   "试着撒很难懂的谎 ",
                   "试着撒很明显的谎",
                   "试着开始躲猫猫（捉迷藏）",

                   "露出知晓事件相关重要事项的表情，却不肯说 ",
                   "“这样啊，原来是这么一回事啊”",
                   "得意洋洋地点头，却不明说详情 ",
                   "做出仿佛已预知未来的言行",
                   "扬言已有关于犯人/敌人的头绪，却不细说",
                   "让一无所知的周围群众看到自己不耐烦的样子",
                   "一言一行摆起架子",
                   "每次遇到人都露出冷笑",
                   "一瞬间露出悲伤神色，马上又变回平常的表情",
                   "“还没得到确信”",

                   "快要想起什么，却想不起来",
                   "在助手/同伴或客座的提醒下想起自己有话还没说 ",
                   "有想说的内容，却因时机不佳说不出口",
                   "跟不上话题/情节的发展 ",
                   "滔滔不绝，却不说关键的部分",
                   "发出“啊——！”的大叫，却不肯说为何 ",
                   "表露出因不遂愿而急躁不爽的样子 ",
                   "想起稍早前不顺利的事而闷闷不乐 ",
                   "表露出对搭档/他人抱持着焦躁心绪的样子",
                   "有话想对搭档/他人说，却最终都没说出口",

                   "吐血或流鼻血",
                   "抱住助手/同伴",
                   "开始引用古典诗歌或小说 ",
                   "毫无关系的前提下突然开始谈论兴趣话题",
                   "吟诵诗歌（念诗） ",
                   "突然开始回想有关回忆之物的事",
                   "事到如今重新想起上次事件时发生的事",
                   "撒娇表示哪里都不想去",
                   "突然开始挥霍游玩并把账都推给助手/同伴付",
                   "重新考虑与搭档/他人之间的关系",

                   "对没有集中精力在事件上的搜查相关人员发火",
                   "对犯人/敌人感到非常气愤",
                   "试图推理搭档/他人的想法",
                   "过于集中精神地思考谜题的各种可能性",
                   "直接用「这样不行」这样的话否定别人",
                   "在聊着别的话题时，突然开始说关于事件的事",
                   "短时间内，只吃喜欢吃的东西",
                   "一直在玩游戏或者进行兴趣活动",
                   "没什么干劲",
                   "突然冒出干劲",

                   "不等获得许可就拿走别人的东西",
                   "谈话或调查的途中就突然开始移动",
                   "没有铺垫也不打招呼，唐突向人打听事件的事",
                   "说着「对了！」的同时拽着搭档/他人的手开始移动",
                   "突然对人说出「你就是犯人/敌人吧」",
                   "装成突然想起搭档/他人曾经欲言又止的话并追究",
                   "不作任何说明直接给出结论",
                   "比搭档/他人更快地展开行动",
                   "做出难以理解的行动，也不给任何说明",
                   "指示大家的行动，但不解释理由或目的",

                   "使用「能做到是当然的啊」这种说话方式",
                   "使用「连这种事都做不到吗」这种说话方式",
                   "做出一副无语的样子",
                   "对做不到的事感到绝望，也不再理会",

                   "了解了想知道的事情后对之后的内容失去兴趣",
                   "毫不避讳地在人前说起别人的失误或失败",
                   "不会直说，但摆出一副搭档/他人或搭档/他人的物品是自己的所有物的态度",
                   "拜托别人帮忙，不等回应就自顾自地行动",
                   "态度傲慢地使唤别人，也不道谢",
                   "无自觉地采取高高在上的态度",

                   "无论遇上什么事，都想要霸占搭档/他人身旁的位置",
                   "搭档/他人跟别人说话时露骨地表现不爽",
                   "当搭档/他人集中于思考事件而忽视自己就会发火",
                   "总是站在搭档/他人的身后，监视其一举一动",
                   "当搭档/他人想要做什么的时候吵嚷着吸引其注意力",
                   "不跟搭档/他人以外的人说话",
                   "唐突地准备搭档/他人喜欢的东西",
                   "没有任何预兆地感到不安，尽量地靠近搭档/他人",
                   "担心会失去搭档/他人而感到不安",
                   "拼命引导搭档/他人说出能让自己安心的话",

                   "非常认真地搜查",
                   "好好地听事件相关人员的话",
                   "认真地听搭档/他人说话",
                   "与人闲聊而不跑题",
                   "不抱怨地认真工作",
                   "好好休息",
                   "阅读搜查资料",
                   "在行动前会先说明理由",
                   "体谅搭档/他人",
                   "难过的时候会说难过，开心的时候会说开心",

                   "任性地对搭档/他人提出想吃到自己喜欢的食物，在要求被回应前不会进行任何行动",
                   "对搭档/他人提出自己失去干劲了，要求其做点什么能让自己拿出干劲的事情",
                   "收集癖爆发，在把现在正在收集的收藏道具集齐前不会进行其他行动",
                   "任性地让搭档/他人快去做点什么有趣的事",
                   "每当遇上什么事都会说任性的话",
                   "直截了当地重复自己的欲求，在欲求被达成前都会不停地重复",
                   "试图将事情向着自己所想的方向诱导，如果失败就会摆出一张臭脸",
                   "试图隐藏自己的欲求，但无法完全藏住",
                   "在自己的任性行为被满足前会一直发脾气",
                   "说出任性的话。不管有没有得到解决，都会继续说别的任性的话",

                   "对嫌疑人、搭档/他人、同伴进行诱导询问",
                   "目的不明地让搭档/他人或同伴去刺探",
                   "在指示下达之前就抵达了现场",
                   "不管怎样先全力以赴地探查相关者的情况",
                   "将相关资料全部阅览完毕",
                   "自己对事件情况进行了假设",
                   "向搭档/他人说明现阶段对事件的见解",
                   "总而言之先探索眼下可见的东西",
                   "将可疑的物件或人物记录在笔记里",
                   "将类似的过往案例作为参考引证",

                   "把搭档/他人撂下一个人去了现场",
                   "一言不发的拉着搭档/他人一起出去",
                   "留下写有目的地的纸条先走了",
                   "突然开始找东西",
                   "好像想到了什么但是什么都不说",
                   "意味深长地点点头",
                   "浮现出意味深长的笑容",
                   "「……好」",
                   "「就这么做吧」",
                   "「我理解了」",

                   "优雅地喝茶",
                   "优雅地下国际象棋或者将棋",
                   "听古典音乐",
                   "阅读和工作无关的书",
                   "看报纸",
                   "开始整理身边的东西",
                   "用端正优美的姿势落座",
                   "转瞬之间完成了文书工作",
                   "开始冥想",
                   "开始预约餐食",

                   "不让人看见脸或者表情",
                   "目测他人脚的尺寸",
                   "判别他人的话语是否为谎言",
                   "学习说话的方式与动作",
                   "探查是否违法",
                   "调查是否有可疑的人物或者证物",
                   "擅长聆听",
                   "嗅闻气味",
                   "用地图确定场所位置",
                   "确认监视摄像头的位置",
                   "怪癖：单箭头",
                   "怪癖：间谍被同化",
                   "怪癖：愚忠",
                   "怪癖：走上歧途",
                   "怪癖：自卑",
                   "怪癖：狼狈为奸",
                   "怪癖：真小人",
                   "怪癖：假君子",
                   "怪癖：替身",
                   "怪癖：貌合神离",
                   "怪癖：一人独活",
                   "怪癖：团灭结局",
                   "怪癖：意难平",
                   "怪癖：由恨生爱",
                   "怪癖：由爱生恨",
                   "怪癖：嫉妒",
                   "怪癖：互相背叛",
                   "怪癖：一方背叛",
                   "怪癖：NTR",
                   "怪癖：小妈",
                   "怪癖：骨科",
                   "怪癖：绑架幻想",
                   "XP：生理性xx",
                   "怪癖：父子",
                   "XP：边做边骂（？？？？？）",
                   "XP：痴汉变态",
                   "XP：角色的加冕与脱冕（Power Play）",
                   "XP：调教",
                   "XP：只有一个人的PWP（Porn Without Plot）",
                   "XP：蒙眼",
                   "XP：捆绑",
                   "XP：PWP（Porn Without Plot）（请自行决定各种不堪入耳的细节和名词...）",
                   "XP：醉酒",
                   "XP：道具",
                   "XP：制服（名词）",
                   f"XP：BDSM。一个{random.choice(xp_sm_type)}，性癖是{random.choice(xp_sm_kink)}。",
                   f"XP：BDSM。一个{random.choice(xp_sm_type)}，性癖是{random.choice(xp_sm_kink)}。",
                   f"XP：BDSM。一个{random.choice(xp_sm_type)}，性癖是{random.choice(xp_sm_kink)}。",
                   f"XP：BDSM。一个{random.choice(xp_sm_type)}，性癖是{random.choice(xp_sm_kink)}。",
                   f"XP：BDSM。一个{random.choice(xp_sm_type)}，性癖是{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   f"XP：{random.choice(xp_sm_kink)}。",
                   "XP：野外",
                   "XP：奴隶试用期",
                   "XP：奴隶交换",
                   "XP：镜面",
                   "XP：下药",
                   "XP：克苏鲁（？）",
                   "XP：生子/怀孕",
                   "XP：跨种族",
                   "XP：兽化",
                   "XP：公共场合",
                   "XP：窒息",
                   "XP：Mob",
                   "XP：战损",
                   "XP：乱伦",
                   "XP：主仆",
                   "XP：绝对不可以欺负小孩子",
                   "XP：Gore",
                   "XP：异装",
                   "XP：囚禁",
                   "XP：边做边打（？？？）",
                   "XP：恶堕：洗脑（调教、药物污染、精神改造）",
                   "XP：恶堕：改造（身体、大脑）",
                   "XP：恶堕：同步（连锁恶堕）",
                   "XP：恶堕：凭依（夺舍、附体）",
                   "XP：恶堕：绝望（人为、故意造成的绝望，挫折、私仇、不惜一切、生存危机、个中缘由、其他日常）",
                   "XP：恶堕：同化（收留、融合）",
                   "XP：恶堕：寄生",
                   "XP：恶堕：怨灵化",
                   "XP：恶堕：尸体操纵",
                   "XP：恶堕：(被)觉醒",
                   "XP：恶堕：人格改变",
                   "XP：恶堕：地位（尊卑）改变",
                   "怪癖：打死不说",
                   "怪癖：工具人",
                   "怪癖：一见误终身",
                   "怪癖：守寡",
                   "怪癖：生错阵营",
                   "怪癖：道德绑架",
                   "怪癖：心理阴影",
                   "怪癖：夜不能寐",
                   "怪癖：小孩子气",
                   "怪癖：泥塑",
                   "怪癖：护短，但失败了",
                   "怪癖：至死都蒙在鼓里",
                   "怪癖：不该愈合的伤口",
                   "怪癖：为了某项原则拍案而起，昭告天下，之后却发现自己是错的。",
                   "XP：触手（及其衍生）"
                   ]
        # 音乐列表
        music_list = [f"原声带：{random.choice(['游戏', '电影', '史诗', '氛围', '游戏、电影'])}",
                      f"电音：{random.choice(['House', 'Trance', 'Techno', '氛围', 'Dubstep', 'Drum&Bass', 'EDM', 'Trap', '改编'])}",
                      "流行",
                      "嘻哈/说唱/DJ慢摇",
                      "民谣",
                      "东方：古风",
                      "爵士",
                      f"金属/朋克：{random.choice(['死亡金属', '独立', '英伦', '流行'])}",
                      f"古典：{random.choice(['交响', '四重奏', '独奏', '改编'])}、{random.choice(['巴洛克', '古典主义', '浪漫主义', '宗教'])}",
                      f"轻音乐/纯音乐：{random.choice(['钢琴', '民乐', '吉他', '改编', '长笛', '古筝', '小提琴', '弦乐'])}",
                      "另类/独立/实验性",
                      "同人/二次元",
                      "布鲁斯/蓝调",
                      "雷鬼/摇滚",
                      "曲艺/戏曲",
                      "乡村",
                      "舞曲",
                      "宗教/唱诗"]
        # 爱好列表
        hobby_list = [
            "做分内事的人",
            "侦探",
            "愿意正视自己的人",
            "愿意喜欢上自己的人",
            "愿意理解自己的人",
            "与搭档/他人完全相反的人",
            "有钱人",
            "有地位的人",
            "一丝不苟的人",
            "像自己一样的人",
            "像搭档/他人一样的人",
            "随便谁都可以",
            "身体或脸长得好的人",
            "身体或脸符合喜好的人",
            "让人想引导的人",
            "让人放不下心的人",
            "能平稳心情的人",
            "能表现自我的人",
            "能变得平稳的人",
            "理性的人",
            "可靠的人",
            "大胆的人",
            "聪明的人",
            "充满刺激的人物",
            "并不愚蠢的人",
            "比自己厉害的人", "同人制作", "击剑",
            "魔术（真实）",
            "木工/木工",
            "石雕",
            "蜡烛制作",
            "皮革工艺",
            "骑马",
            "造船",
            "讲故事",
            "算命",
            "金属加工",
            "打造剑或武器锻造",
            "符文占卜和符文制作",
            "射箭",
            "草药学",
            "制作玩偶",
            "糖果制作",
            "缝纫",
            "制作甜品",
            "绘画",
            "珠宝制作",
            "调制鸡尾酒",
            "博客/视频博客",
            "制皂",
            "编织或钩织",
            "十字绣或刺绣",
            "削木/木雕",
            "折纸",
            "诗歌",
            "编写故事",
            "撰写文章",
            "解谜",
            "天文学/观星",
            "编程",
            "黑客攻击",
            "在大自然中散步",
            "骑自行车",
            "观看纪录片",
            "黑客活动主义（将计算机黑客作为抗议形式）",
            "学术研究",
            "塔罗牌",
            "平面设计",
            "电子游戏",
            "视频博客/视频制作",
            "数字艺术",
            "唱歌",
            "制作数字音乐",
            "人工智能",
            "陶艺或雕塑",
            "巫术",
            "时装设计",
            "化妆/脸部彩绘",
            "真人扮演（Cosplay）",
            "冲浪",
            "帆船",
            "滑雪",
            "跑步",
            "远足",
            "桌游",
            f"舞蹈：{random.choice(['交谊舞(法式民间舞；踢踏舞)', '宫廷舞(小步；华尔兹；波斯)', '古典舞(拉丁:探戈、恰恰；芭蕾；慢狐步)', '现代舞(爵士；迪斯科；Swing摇摆舞)', '当代舞(街舞；男女团)'])}",
            "室内设计",
            "体操",
            "武术",
            "健身",
            "活动主义",
            "公开演讲",
            "辩论",
            "团体运动",
            "演奏乐器",
            "皮划艇或划船",
            "拳击或格斗",
            "旅行",
            "钓鱼",
            "烹饪",
            "烘焙",
            "瑜伽",
            "观鸟",
            "收集某物（例如，书籍，小人物，填充玩具，纪念品）",
            "园艺",
            "剪贴簿",
            "听音乐",
            "分析书籍/诗歌/歌词",
            "人格类型学（例如，MBTI，九型人格）",
            f"学习新语言：{random.choice(['日语', '当地方言', '汉语', '英语', '俄语', '德语', '法语', '小语种', '韩语', '西班牙语', '古语言', '任选国家语言', '虚构语言'])}",
            "摄影",
            "看电视",
            "表演/戏剧",
            "唱歌",
            "高尔夫",
            "保龄球",
            "宾果游戏",
            "作为爱好写作",
            "阅读",
            "拿铁艺术",
            "学习魔术技巧",
            "木偶表演",
            "国际象棋",
            "标本制作（动植物、昆虫、化石等）",
            "啤酒酿造",
            "杂耍",
            "单口喜剧",
            "捉弄他人",
            "涂指甲",
            "气球艺术/搓绳",
            "绳结编织",
            "涂鸦",
            "书法",
            "养蜂",
            "露营",
            "模仿秀",
            "填字游戏",
            "跑酷",
            "滑轮溜冰",
            "车辆修复",
            "听播客",
            "溜冰",
            "志愿服务",
            "钢管舞",
            "撰写书评或影评",
            "日志/日记",
            "采摘鲜花",
            "野餐",
            "数独",
            "动画制作",
            "音乐列表收集",
            "出售他们创造的东西",
            "玩角色扮演游戏",
            "模特",
            "发型设计",
            "寻找和收集贝壳",
            "刺青",
            "蛋糕装饰",
            "化妆艺术",
            "节拍口技",
            "说唱",
            "极限运动（例如，跳伞或蹦极）",
            "插花",
            "哑剧"]
        type_mock = self.type_var.get()
        type_random = self.type_random_var.get()
        if self.description_text.get("1.0", tk.END).strip() == "" or self.description_text.get("1.0",
                                                                                               tk.END).strip() == "未查找到此条目！" or self.description_text.get(
            "1.0", tk.END).strip() == "技能一10 技能二30 技能三70 @武器鉴定技能1D6+DB":
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, f"信用{random.randint(1, 100)}")
        elif "信用" in self.description_text.get("1.0", tk.END):
            credit = self.description_text.get("1.0", tk.END).split("信用")[1].split(" ")[0]
            text_ = self.description_text.get("1.0", tk.END)
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, text_.replace("信用" + credit, f"信用{random.randint(1, 100)}"))
        replacemant = self.name_entry.get().split("=")[0] + "=" + random.choice(career_list)
        for index, itm in trait_list.items():
            if index == "描述":
                trait_desc.append(index + "是" + random.choice(itm))
                trait_desc.append(random.choice(itm))
                trait_desc.append(random.choice(itm))
            else:
                trait_desc.append(index + "是" + random.choice(itm))
        self.trait_text.delete("1.0", tk.END)
        self.trait2_text.delete("1.0", tk.END)
        self.trait_text.insert("1.0", "一位穿着" + random.choice(app_list) + "的" + random.choice(["欧洲", "亚裔", "非洲", "中国", "日本", "英国", "韩国", "美国", "德国", "法国", "俄罗斯", "印度", "意大利", "埃及", "丹麦", "澳大利亚", "未知国籍", "未知人种", "白人", "黄皮肤", "黑人", "混血人种", "东方", "西方"]) + random.choice(["男性", "女性", "非二元性别者", "跨性别者"]) + "，性取向是" + random.choice(
            ["双性", "同性", "异性", "无性", "跨种族", "恋物"]) + "，喜欢" + random.choice(
            xp_list) + "。最爱喝" + random.choice(drink_list) + "，吃" + random.choice(sweet_list) + "，听" + random.choice(music_list) + "音乐。喜欢并关注着" + random.choice(hobby_list) + "，总是" + random.choice(everyday_list) + "。\n" + random.choice(trait_mec_list) + "\n" + random.choice(mbti_list))
        self.trait2_text.insert("1.0", "，".join(trait_desc))

        for index, itm in motive_list.items():
            motive_desc[index] = random.choice(itm)
        motive_text = f"一个{motive_desc['_职业']} {motive_desc['_年龄']} 他的社会地位是{motive_desc['_社会地位']} 他让人很难忘记的特质是“{motive_desc['_令人难忘的怪癖']}” 他参与其中，现在是{motive_desc['_与情况的关系']}\n他若是【受害被利用之人】，他的理由是{motive_desc['_驱使他们的问题']}\n他若是【强力对手】，他的优势是{motive_desc['_他们在这一情况中的优势']}"
        if motive_desc['_年龄'] == "考虑到其岗位，异常年轻。":
            age_num = random.randint(7, 19)
        elif motive_desc['_年龄'] == "年轻的，也许是在其岗位上崭露头角的人。":
            age_num = random.randint(20, 35)
        elif motive_desc['_年龄'] == "在他们的岗位上已经年长或成熟。":
            age_num = random.randint(36, 59)
        elif motive_desc['_年龄'] == "衰朽的，也许已经过了以前的辉煌期，或者还在坚守。":
            age_num = random.randint(60, 90)
        else:
            age_num = random.randint(7, 90)
        if "年龄" in self.description_text.get("1.0", tk.END):
            age = self.description_text.get("1.0", tk.END).split("年龄")[1].split(" ")[0]
            age_text_ = self.description_text.get("1.0", tk.END)
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, age_text_.replace("年龄" + age, f"年龄{age_num}"))
        else:
            self.description_text.insert(tk.END, f" 年龄{age_num}")
        self.motive_text.delete("1.0", tk.END)
        self.motive_text.insert("1.0", motive_text)
        self.motive_text.yview(tk.END)

        self.name_entry.delete(0, tk.END)
        self.name_entry.insert(tk.END, replacemant)
        if type_mock == "请选择预设" or type_random == "请选择随机预设":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.APP_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.DEX_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.STR_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.INT_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.CON_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.POW_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.SIZ_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.LUCK_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))

        self.EDU = self.EDU_text.get()
        self.APP = self.APP_text.get()
        self.DEX = self.DEX_text.get()
        self.STR = self.STR_text.get()
        self.INT = self.INT_text.get()
        self.CON = self.CON_text.get()
        self.POW = self.POW_text.get()
        self.SIZ = self.SIZ_text.get()
        self.LUCK = self.LUCK_text.get()

        if type_mock != "无预设" and type_mock != "请选择预设" and type_mock != "自定义...":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str(int(self.EDU) + random.randint(-10, 10)))
            self.APP_text.insert(tk.END, str(int(self.APP) + random.randint(-20, 20)))
            self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(-20, 20)))
            self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(-20, 20)))
            self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(-10, 10)))
            self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(-20, 20)))
            self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(-20, 20)))
            self.SIZ_text.insert(tk.END, str(int(self.SIZ) + random.randint(-10, 10)))
            self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(-20, 20)))
        elif type_mock == "自定义...":
            pass

        if type_random != "无随机预设" or type_random != "请选择随机预设":
            # 人类：不变
            if type_random == "人类":
                pass
            # 战场经历：敏捷+1,10，力量+1,10，体质+1,10，意志+1,10，外貌-1,5，幸运+1，5
            elif type_random == "战场经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 10)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 10)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 5)))
                self.APP_text.insert(tk.END, str(int(self.APP) - random.randint(1, 5)))

            # 警务经历：敏捷+1,10，力量+1,9，体质+1,9，意志+1,4，智力+1,8
            elif type_random == "警务经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 9)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 9)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 4)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 8)))

            # 罪犯经历：敏捷+1,10，力量+1,10，体质+1,8，意志+1,8，智力+1,4，外貌-1,5，幸运+1,5
            elif type_random == "罪犯经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 8)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 10)))
                self.CON_text.insert(tk.END, str(int(self.CON) + random.randint(1, 8)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 4)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 5)))
                self.APP_text.insert(tk.END, str(int(self.APP) - random.randint(1, 5)))

            # 医务经历：敏捷+1,10，力量+1,5，意志+1,10，智力+1,15
            elif type_random == "医务经历":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(1, 5)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))

            # 神话经历：智力+1,10，意志+1,30
            elif type_random == "神话经历":
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 30)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 10)))

            # 艺术经历：敏捷+1,15，外貌+1,10，幸运+1,10，意志-1,10，智力+1,15
            elif type_random == "艺术经历":
                self.DEX_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.APP_text.insert(tk.END, str(int(self.APP) + random.randint(1, 10)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(1, 15)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(1, 10)))
                self.LUCK_text.insert(tk.END, str(int(self.LUCK) + random.randint(1, 10)))

            # 教育经历：智力+1,15，教育+1,15，意志+1,10
            elif type_random == "教育经历":
                self.EDU_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, str(int(self.EDU) + random.randint(1, 15)))
                self.INT_text.insert(tk.END, str(int(self.INT) + random.randint(1, 15)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(1, 10)))

            # 邪教徒：意志+(0, 50)，力量+(-10, 20)
            elif type_random == "邪教徒":
                self.STR_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(-10, 20)))
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(0, 50)))

            # 小型野兽：敏捷*(1,2)*1.5，力量/2，体质/2，体型/10，意志-(10, 15)
            elif type_random == "小型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 3, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(10, 15)))
                self.STR_text.insert(tk.END, str(round(int(self.STR) / 2, 0)).split(".")[0])
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) * random.randint(1, 2) * 1.5, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(round(int(self.SIZ) / 10, 0)).split(".")[0])
                self.CON_text.insert(tk.END, str(round(int(self.CON) / 2, 0)).split(".")[0])

            # 中型野兽：敏捷+(10, 30)，力量+(10, 30)，体质*2，意志-(-10, 10)
            elif type_random == "中型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 2, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(-10, 10)))
                self.STR_text.insert(tk.END, str(int(self.STR) + random.randint(10, 30)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) + random.randint(10, 30)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))

            # 大型野兽：敏捷/2，力量*(2,3)，体质*2，体型*(2,3)，意志-(-20, 5)
            elif type_random == "大型野兽":
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.EDU_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, "0")
                self.INT_text.insert(tk.END, str(round(int(self.INT) / 1.5, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) - random.randint(-20, 5)))
                self.STR_text.insert(tk.END, str(int(self.STR) * random.randint(2, 3)))
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) / 2, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(2, 3)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))

            # 小型怪物：敏捷*3，体型/5，意志+(20, 50)
            elif type_random == "小型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) + random.randint(20, 50)))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * 3))
                self.SIZ_text.insert(tk.END, str(round(int(self.SIZ) / 5, 0)).split(".")[0])
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 中型怪物：敏捷*(1,2)，力量*2，体质*2，意志*2
            elif type_random == "中型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) * 2))
                self.STR_text.insert(tk.END, str(int(self.STR) * 2))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * random.randint(1, 2)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 2))
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 大型怪物：敏捷/2，力量*(3,4)，体质*3，体型*(3,4)，意志*(1,3)
            elif type_random == "大型怪物":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.POW_text.insert(tk.END, str(int(self.POW) * random.randint(1, 3)))
                self.STR_text.insert(tk.END, str(int(self.STR) * random.randint(3, 4)))
                self.DEX_text.insert(tk.END, str(round(int(self.DEX) / 2, 0)).split(".")[0])
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(3, 4)))
                self.CON_text.insert(tk.END, str(int(self.CON) * 3))
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])

            # 古神：敏捷*2，力量*4，体质*(3,5)，体型*(3,5)，智力*(2,4)，意志*(3,5)
            elif type_random == "古神":
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.APP_text.insert(tk.END, str(round(int(self.APP) / 5, 0)).split(".")[0])
                self.POW_text.insert(tk.END, str(int(self.POW) * random.randint(3, 5)))
                self.STR_text.insert(tk.END, str(int(self.STR) * 4))
                self.DEX_text.insert(tk.END, str(int(self.DEX) * 2))
                self.SIZ_text.insert(tk.END, str(int(self.SIZ) * random.randint(3, 5)))
                self.CON_text.insert(tk.END, str(int(self.CON) * random.randint(3, 5)))
                self.INT_text.insert(tk.END, str(int(self.INT) * random.randint(2, 4)))
            else:
                pass
        else:
            pass

        self.all_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get())))
        self.allwithluck_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
        self.HP_label.config(text="HP: " + str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                             fg="red")
        self.MP_label.config(text="MP: " + str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")

    def random_entry_for_new_roles_NPC_by_mock(self, event):
        if self.description_text.get("1.0", tk.END) == "" or self.description_text.get("1.0",
                                                                                       tk.END) == "未查找到此条目！" or self.description_text.get(
            "1.0", tk.END) == "技能一10 技能二30 技能三70 @武器鉴定技能1D6+DB":
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, f"信用{random.randint(1, 100)}")
        elif "信用" in self.description_text.get("1.0", tk.END):
            credit = self.description_text.get("1.0", tk.END).split("信用")[1].split(" ")[0]
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, self.description_text.get("1.0", tk.END).replace(credit,
                                                                                                  f"信用{random.randint(1, 100)}"))
        replacemant = self.name_entry.get().split("=")[0] + "=" + random.choice(career_list)
        self.name_entry.delete(0, tk.END)
        self.name_entry.insert(tk.END, replacemant)
        type_mock = self.type_var.get()
        if type_mock == "无预设" or type_mock == "请选择预设":
            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.APP_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.DEX_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.STR_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.INT_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.CON_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.POW_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
            self.SIZ_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + 6) * 5))
            self.LUCK_text.insert(tk.END, str((random.randint(1, 6) + random.randint(1, 6) + random.randint(1, 6)) * 5))
        elif type_mock == "自定义...":
            pass
        else:
            mock_dic = role_Chart_at_name[type_mock].copy()
            if self.name_entry.get() == "":
                self.name_entry.insert(tk.END, type_mock)

            self.EDU_text.delete(0, tk.END)
            self.APP_text.delete(0, tk.END)
            self.DEX_text.delete(0, tk.END)
            self.STR_text.delete(0, tk.END)
            self.INT_text.delete(0, tk.END)
            self.CON_text.delete(0, tk.END)
            self.POW_text.delete(0, tk.END)
            self.SIZ_text.delete(0, tk.END)
            self.LUCK_text.delete(0, tk.END)
            self.EDU_text.insert(tk.END, mock_dic.get("教育"))
            self.APP_text.insert(tk.END, mock_dic.get("外貌"))
            self.DEX_text.insert(tk.END, mock_dic.get("敏捷"))
            self.STR_text.insert(tk.END, mock_dic.get("力量"))
            self.INT_text.insert(tk.END, mock_dic.get("智力"))
            self.CON_text.insert(tk.END, mock_dic.get("体质"))
            self.POW_text.insert(tk.END, mock_dic.get("意志"))
            self.SIZ_text.insert(tk.END, mock_dic.get("体型"))
            self.LUCK_text.insert(tk.END, mock_dic.get("幸运"))

        self.random_entry_for_new_roles_NPC()
        self.all_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get())))
        self.allwithluck_label.config(text=str(
            int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
        self.HP_label.config(text="HP: " + str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                             fg="red")
        self.MP_label.config(text="MP: " + str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")

    def edit_entry_for_new_roles_NPC(self):
        for pcname, pcdict in role_Chart_at_name.items():
            if self.name_entry.get() == pcname:
                mock_dic = role_Chart_at_name[pcname].copy()
                self.name_entry.delete(0, tk.END)
                self.name_entry.insert(tk.END, pcname)
                self.EDU_text.delete(0, tk.END)
                self.APP_text.delete(0, tk.END)
                self.DEX_text.delete(0, tk.END)
                self.STR_text.delete(0, tk.END)
                self.INT_text.delete(0, tk.END)
                self.CON_text.delete(0, tk.END)
                self.POW_text.delete(0, tk.END)
                self.SIZ_text.delete(0, tk.END)
                self.LUCK_text.delete(0, tk.END)
                self.EDU_text.insert(tk.END, mock_dic.get("教育"))
                self.APP_text.insert(tk.END, mock_dic.get("外貌"))
                self.DEX_text.insert(tk.END, mock_dic.get("敏捷"))
                self.STR_text.insert(tk.END, mock_dic.get("力量"))
                self.INT_text.insert(tk.END, mock_dic.get("智力"))
                self.CON_text.insert(tk.END, mock_dic.get("体质"))
                self.POW_text.insert(tk.END, mock_dic.get("意志"))
                self.SIZ_text.insert(tk.END, mock_dic.get("体型"))
                self.LUCK_text.insert(tk.END, mock_dic.get("幸运"))
                self.description_text.delete("1.0", tk.END)
                for skill, value in mock_dic.items():
                    if skill != "_AvatarPath" and skill != "#SAN":
                        if "#" in skill:
                            skill = skill + "@"
                        self.description_text.insert(tk.END, f"{skill}{value} ")
                if mock_dic.get("_AvatarPath"):
                    image = Image.open(mock_dic.get("_AvatarPath"))  # 替换为你的图片路径
                    self.file_path = mock_dic.get("_AvatarPath")
                    width, height = image.size
                    image = image.resize((int(width / 5), int(height / 5)), Image.LANCZOS)
                    photo = ImageTk.PhotoImage(image)
                    self.image_references_PC.append(photo)
                    image_preview = tk.Label(self.roles_NPC_frame, image=photo, relief=tk.FLAT)
                    image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")
                else:
                    image_preview = tk.Label(self.roles_NPC_frame, image="", relief=tk.FLAT)
                    image_preview.grid(row=0, column=6, padx=0, pady=0, rowspan=7, sticky="nsew")

                self.all_label.config(text=str(
                    int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                        self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                        self.POW_text.get()) + int(self.SIZ_text.get())))
                self.allwithluck_label.config(text=str(
                    int(self.EDU_text.get()) + int(self.APP_text.get()) + int(self.DEX_text.get()) + int(
                        self.STR_text.get()) + int(self.INT_text.get()) + int(self.CON_text.get()) + int(
                        self.POW_text.get()) + int(self.SIZ_text.get()) + int(self.LUCK_text.get())))
                self.HP_label.config(text="HP: " + str((int(self.CON_text.get()) + int(self.SIZ_text.get())) / 10).split(".")[0],
                                     fg="red")
                self.MP_label.config(text="MP: " + str(int(self.POW_text.get()) / 5).split(".")[0], fg="blue")
                break
            else:
                self.description_text.delete("1.0", tk.END)
                self.description_text.insert(tk.END, "未查找到此条目！")

    def save_json_for_new_roles_NPC(self):
        if self.name_entry.get() != "":
            if self.type_var.get() != "无预设" and self.type_var.get() != "请选择预设" and self.type_var.get() != "自定义...":
                self.role_skill_menu[self.name_entry.get()] = self.role_skill_menu[self.type_var.get()]
            else:
                self.role_skill_menu[self.name_entry.get()] = {'技能名[鉴定](要求)效果公式：描述': "skill",
                                                               '法术名[效果公式](消费)：描述': "spell",
                                                               '战技/特技名:效果[鉴定](要求)公式': "maneuver"}
            dict_skill = self.parse_input_skill(self.description_text.get("1.0", tk.END))
            file_path = "GameSaves/pl_Chart_at_name.json"
            self.name = self.name_entry.get()
            self.EDU = self.EDU_text.get()
            self.APP = self.APP_text.get()
            self.DEX = self.DEX_text.get()
            self.STR = self.STR_text.get()
            self.INT = self.INT_text.get()
            self.CON = self.CON_text.get()
            self.POW = self.POW_text.get()
            self.SIZ = self.SIZ_text.get()
            self.LUCK = self.LUCK_text.get()
            dict2 = {"EDU": int(self.EDU),
                     "APP": int(self.APP),
                     "DEX": int(self.DEX),
                     "STR": int(self.STR),
                     "INT": int(self.INT),
                     "CON": int(self.CON),
                     "POW": int(self.POW),
                     "SIZ": int(self.SIZ),
                     "LUCK": int(self.LUCK),
                     "教育": int(self.EDU),
                     "母语": int(self.EDU),
                     "外貌": int(self.APP),
                     "敏捷": int(self.DEX),
                     "闪避": int(str(int(self.DEX) / 2).split(".")[0]),
                     "力量": int(self.STR),
                     "智力": int(self.INT),
                     "体质": int(self.CON),
                     "灵感": int(self.INT),
                     "意志": int(self.POW),
                     "体型": int(self.SIZ),
                     "幸运": int(self.LUCK),
                     "HP": int(str((int(self.CON) + int(self.SIZ)) / 10).split(".")[0]),
                     "MP": int(str(int(self.POW) / 5).split(".")[0]),
                     "SAN": int(self.POW),
                     "理智": int(self.POW),
                     "_AvatarPath": self.file_path
                     }
            dict1 = role_Chart_detail_demo.copy()
            role_Chart_at_name[self.name_entry.get()] = {**dict1, **dict2}
            self.update_skills(role_Chart_at_name[self.name_entry.get()], dict_skill)
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(role_Chart_at_name, file, indent=4, ensure_ascii=False)

    def Combat_NPC(self):
        self.new_combat_window = tk.Toplevel(root, takefocus=True)
        #self.image_references = []
        self.Add_NPC()

    def Add_NPC(self, pass_=""):
        looptime = 0
        loopalltime = 0
        value__ = "NPC"
        namelist = []
        if pass_ != "" and self.dialog2 != "" and self.dialog2.result[
            "slot"] != "":  # and self.dialog2.result["slot"] != "KP":
            slot__ = self.dialog2.result["slot"]
            name__ = self.dialog2.result["新的预设..."]
            self.dialog2.result.clear()
            self.dialog2.result[pass_] = name__
            self.dialog2.result["slot"] = slot__
        else:
            self.dialog2 = LoadNPCDialog(self.root, f"选择要加载的NPC")
        result = self.dialog2.result
        # print(result)
        if result:
            for name, value in result.items():
                if name == "新的预设...":
                    self.new_roles_NPC()
                    self.new_combat_window.destroy()
                    return
            slot = result["slot"]
            if slot != "新窗口...":
                self.new_combat_window.destroy()
                name_type = ""
                for _name_, value in result.items():
                    if _name_ == "随机...":
                        name = simpledialog.askstring("输入随机怪物的共有名称", "输入随机怪物名称(请参考NPC列表):", initialvalue=f"邪教徒")
                        name_type = name
                        namelist = []
                        role_Chart_at_name_ = load_Chart_at_name().copy()
                        for role, chart in role_Chart_at_name_.items():
                            if name in role:
                                namelist.append(role)
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                    elif _name_ == "slot":
                        pass
                    else:
                        name = _name_
                        if value == "":
                            value = name
                        if name_type != "":
                            self.role_entries[slot].insert("1.0", f"正在使用{name_type}[{name}]的属性扮演【{value}】\n===\n")
                        else:
                            self.role_entries[slot].insert("1.0", f"正在使用[{name}]的属性扮演【{value}】\n===\n")
                        if name in self.infoCanvas_data_by_name:
                            self.infoCanvas_data[slot] = self.infoCanvas_data_by_name[name]
                        else:
                            print("该模板没有简卡图片！")
                        # 按名牌加载设置
                        # print(slot)
                        role_Chart[slot] = role_Chart_at_name[name].copy()
                        SAN = role_Chart_at_name[name].get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        HP = role_Chart_at_name[name].get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        MP = role_Chart_at_name[name].get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        MOV = role_Chart_at_name[name].get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        POW = role_Chart_at_name[name].get("POW")
                        DB = role_Chart_at_name[name].get("DB")
                        if "#SAN" in role_Chart_at_name[name]:
                            SAN_ = role_Chart_at_name[name].get("#SAN")
                        else:
                            SAN_ = 100
                        self.role_values_entry[slot].insert("1.0",
                                                            f'{SAN}/{SAN_}:S\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB\n===\n')
                        if f"===状态===" not in self.role_values_entry[slot].get("1.0", tk.END).strip():
                            self.role_values_entry[slot].insert(tk.END, f"\n===状态===\n无(永久)\n")
                        if name in self.role_items:
                            for key, value in self.role_items[name].items():
                                if value != "":
                                    for value_ in value:
                                        if value_ != "":
                                            self.role_values_entry[slot].insert(tk.END,
                                                                                f"\n==={key}===\n" + "\n".join(value))
                        self.chat_log.insert(tk.END,
                                             f'{self.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{value}】的状态：\n{self.role_values_entry[slot].get("1.0", "6.0").strip()}\n\n')
                        self.chat_log.yview(tk.END)
                    # print(result)
            else:
                if looptime == 0:
                    looptime = simpledialog.askinteger("输入生成数量", "输入生成数量(最小为1):", initialvalue=1, minvalue=1)
                    loopalltime = looptime
                name_type = ""
                for _name_, value in result.items():
                    if _name_ == "随机...":
                        name = simpledialog.askstring("输入随机怪物的共有名称", "输入随机怪物名称(请参考NPC列表):", initialvalue=f"邪教徒")
                        name_type = name
                        namelist = []
                        role_Chart_at_name_ = load_Chart_at_name().copy()
                        for role, chart in role_Chart_at_name_.items():
                            if name in role:
                                namelist.append(role)
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                    else:
                        name = _name_
                    while looptime > 0:
                        if len(namelist) > 0:
                            name = random.choice(namelist)
                        else:
                            print("不存在该名称！")
                        if looptime != loopalltime:
                            self.new_combat_window = tk.Toplevel(root, takefocus=True)
                        if _name_ == "slot":
                            pass
                        else:
                            if value == "":
                                value__ = ""
                            if looptime > 1 and value__ != "" and value != "":
                                value__ = simpledialog.askstring("输入名字", "输入名字(可留空):",
                                                                 initialvalue=name_type + "#" + str(
                                                                     len(self.new_combat_windows) + 1))
                            else:
                                value__ = value
                            if value__ == "":
                                value__ = name + "#" + str(len(self.new_combat_windows) + 1)
                            if value__ == name:
                                NPC_name = name + "NPC_name"
                            else:
                                NPC_name = name + "NPC_name" + value__
                            frame = tk.LabelFrame(self.new_combat_window, text="NPC", relief=tk.GROOVE)
                            # self.new_combat_window.bind("<Return>", lambda event: self.send_message(self.current_role.get()))
                            self.new_combat_window.bind("<Alt-Return>", lambda event: self.insert_newline())
                            self.new_combat_window.bind("<Control-Return>", lambda: self.newline_on_ctrl_enter)
                            frame.grid(row=0, column=0, padx=10, pady=10, sticky="nsew")
                            if NPC_name.split("NPC_name")[1] != "":
                                pass
                            else:
                                NPC_name += name + "#1"
                            if NPC_name in self.role_entries_frame:
                                _NPC_list = []
                                # for index, frame in self.role_entries_frame.copy().items():
                                # if NPC_name.split("#")[0] in index:
                                # _NPC_list.append("frame")
                                if NPC_name.split("NPC_name")[1] != "":
                                    NPC_name = NPC_name.split("#")[0] + "#" + str(len(self.new_combat_windows) + 1)
                                    NPC_name = NPC_name.split("#")[0] + "#" + str(len(self.new_combat_windows) + 1)
                                else:
                                    NPC_name = NPC_name.split("#")[0] + name + "#" + str(
                                        len(self.new_combat_windows) + 1)  # str(random.randint(1000, 9999))
                            self.new_combat_window.title("【NPC】" + NPC_name.split("NPC_name")[1])
                            self.role_entries_frame[NPC_name] = frame
                            self.role_entries_name_NPC[NPC_name] = NPC_name.split("NPC_name")[1]
                            # self.roles.append(NPC_name)
                            # 每个角色的消息框
                            entry = tk.Text(frame, wrap=tk.WORD, width=30, height=3, undo=True)
                            entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")
                            # entry.bind("<Button-3>", lambda event, r=NPC_name: self.add_menu(event, r))
                            if name_type != "":
                                if value__.split("#")[0] == name:
                                    entry.insert("1.0", f"野生的[{name_type}]【{value__}】出现了！\n")
                                else:
                                    entry.insert("1.0", f"野生的[{name_type}]{name}【{value__}】出现了！\n")
                            else:
                                entry.insert("1.0", f"野生的{name}【{value__}】出现了！\n")
                            self.role_entries[NPC_name] = entry
                            role_Chart_detail = role_Chart_at_name.get(NPC_name.split("NPC_name")[0],
                                                                       {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                            # 加载并显示头像
                            if "_AvatarPath" in role_Chart_detail:
                                self.role_avatar_paths[NPC_name] = role_Chart_detail["_AvatarPath"]
                            else:
                                self.role_avatar_paths[NPC_name] = ""
                            self.load_and_display_avatar(NPC_name, self.role_entries[NPC_name].master)
                            # self.load_and_display_icon(NPC_name.replace("NPC_name", ""), frame)
                            # 创建数值tag，显示数值
                            SAN = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            HP = role_Chart_detail.get("HP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            MP = role_Chart_detail.get("MP")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            MOV = role_Chart_detail.get("MOV")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            POW = role_Chart_detail.get("POW")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            DB = role_Chart_detail.get("DB")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                            if "#SAN" in role_Chart_detail:
                                _SAN = role_Chart_detail.get("#SAN")
                            else:
                                _SAN = 100
                            entry2 = tk.Text(frame, wrap=tk.WORD, width=10, height=6, undo=True)
                            entry2.grid(row=1, column=2, padx=5, pady=5, sticky="nsew")
                            value_tag = f"{NPC_name}_values_tag"
                            entry2.tag_config(value_tag, justify=tk.LEFT)
                            entry2.insert(tk.END,
                                          f'{SAN}/{_SAN}:SAN\n{HP}/{HP}:HP\n{MP}/{MP}:MP\n{MOV}/{MOV}:MOV\n{DB}:DB',
                                          value_tag)
                            if f"===状态===" not in entry2.get("1.0", tk.END).strip():
                                entry2.insert(tk.END, f"\n===状态===\n无(永久)\n", value_tag)
                            if NPC_name.split("NPC_name")[0] in self.role_items:
                                for key, keyvalue in self.role_items[NPC_name.split("NPC_name")[0]].items():
                                    if keyvalue != "":
                                        for value_ in keyvalue:
                                            if value_ != "":
                                                if f"==={key}===" not in entry2.get("1.0", tk.END).strip():
                                                    entry2.insert(tk.END, f"\n==={key}===\n" + "\n".join(keyvalue),
                                                                  value_tag)
                            entry2.bind("<Button-3>", lambda event, r="statuslog" + NPC_name: self.add_menu(event, r))
                            self.role_values_entry[NPC_name] = entry2
                            # 为每个文本框绑定焦点变化事件
                            entry2.bind("<FocusIn>", lambda event, r=NPC_name: self.update_health_bar(r))
                            entry2.bind("<FocusOut>", lambda event, r=NPC_name: self.update_health_bar(r))
                            # send_button = tk.Button(frame, text="发送", command=lambda role=NPC_name: self.send_message(role))
                            # send_button.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

                            label = tk.Label(frame, text=value__, relief=tk.FLAT,
                                             font=("Times New Roman", 16,
                                                   "bold"))  # flat, groove, raised, ridge, solid, or sunken
                            label.grid(row=0, column=1, pady=0, sticky="nsew")
                            label.bind("<Button-1>",
                                       lambda event, role=NPC_name, label=label: self.edit_role_name(event, role,
                                                                                                     label))
                            label.bind("<Button-3>", lambda event, role=NPC_name: self.on_avatar_click(role))
                            label.bind("<Enter>", lambda event, role=NPC_name: self.on_Namelabel_hover(role))
                            label.bind("<Leave>", lambda event, role=NPC_name: self.on_Namelabel_unfocus(role))

                            label = tk.Label(frame, text="@", relief=tk.FLAT)
                            label.grid(row=0, column=0, pady=0, sticky="nsew")
                            # label点击事件绑定
                            label.bind("<Button-1>", lambda event, role=NPC_name: self.on_at_click(role))
                            label.bind("<Button-3>", lambda event, role=NPC_name: self.on_at_right_click(role))

                            # 添加掷骰按钮和面数输入框
                            entry_roll = tk.Text(frame, wrap=tk.WORD, width=3, height=1, undo=True)
                            entry_roll.grid(row=0, column=2, padx=5, pady=5, sticky="nsew")
                            entry_roll.bind("<Button-3>",
                                            lambda event, r=NPC_name: self.add_menu_skills(event, NPC_name))
                            self.role_entries_roll[NPC_name] = entry_roll
                            # roll_button = tk.Button(frame, text="掷骰", command=lambda r=NPC_name: self.get_and_roll(r))
                            # roll_button.grid(row=2, column=2, padx=5, pady=5)
                            # self.role_roll_button[NPC_name] = roll_button
                            # 在 Text 组件中插入初始文本
                            initial_text = "1d100"
                            self.role_entries_roll[NPC_name].insert(tk.END, initial_text)
                            entry.bind("<FocusIn>",
                                       lambda event, role=NPC_name: self.bind_enter_to_send_message_NPC(event, role))
                            entry_roll.bind("<FocusIn>",
                                            lambda event2, role=NPC_name: self.bind_enter_to_send_roll_NPC(event2,
                                                                                                           role))
                            # 状态条（血量）
                            statusbar_health = tk.Label(frame, text=self.draw_health_bar(HP, HP, bar_length=18),
                                                        relief=tk.FLAT)
                            statusbar_health.grid(row=2, column=1, padx=0, pady=0, sticky="nsew")
                            statusbar_health.bind("<Enter>", lambda event, r=NPC_name: self.update_health_bar(r))
                            statusbar_health.bind("<Button-1>", lambda event, r=NPC_name: self.hide_health_bar(r))
                            self.role_statusbar_health[NPC_name] = statusbar_health
                            # 状态条（状态图标）
                            # 加载图像
                            # image = Image.open("Images/IconImages/20.png")  # 替换为你的图片路径
                            # image = image.resize((50, 50), Image.LANCZOS)
                            # photo = ImageTk.PhotoImage(image)
                            # self.image_references.append(photo)
                            statusbar_icon = tk.Label(frame, image="", relief=tk.FLAT)
                            statusbar_icon.grid(row=2, column=2, padx=0, pady=0, sticky="nsew")
                            statusbar_icon.bind("<Button-1>", lambda event: self.update_status_icon(event))
                            statusbar_icon.bind("<Enter>", lambda event, r=NPC_name: self.draw_status_icon_canvas(event, r))
                            statusbar_icon.bind("<Leave>", lambda event, r=NPC_name: self.destroy_status_icon_canvas(r))
                            self.role_statusbar_icon[NPC_name] = statusbar_icon
                            # 状态条（mp量）
                            statusbar_mp = tk.Label(frame, text="MP " + self.draw_health_bar(MP, MP, bar_length=5,
                                                                                             show_text=False),
                                                    relief=tk.FLAT, font=("Times New Roman", 7))
                            statusbar_mp.grid(row=2, column=0, padx=0, pady=0, sticky="nsew")
                            statusbar_mp.bind("<Enter>", lambda event, r=NPC_name: self.update_health_bar(r))
                            statusbar_mp.bind("<Button-1>", lambda event, r=NPC_name: self.hide_health_bar(r))
                            self.role_sstatusbar_mp[NPC_name] = statusbar_mp
                            if loopalltime - 1 != 0:
                                self.highlighted_role.set(NPC_name)
                                self.new_combat_window.protocol("WM_DELETE_WINDOW",
                                                                lambda: self.on_closing_new_NPC_window(
                                                                    self.highlighted_role.get()))
                            else:
                                self.new_combat_window.protocol("WM_DELETE_WINDOW",
                                                                lambda: self.on_closing_new_NPC_window(NPC_name))
                            self.new_combat_windows[NPC_name] = self.new_combat_window
                        looptime -= 1
        else:
            self.new_combat_window.destroy()

    def update_status_icon(self, event):
        self.current_path = ""
        self.new_status_edit_window = tk.Toplevel(root, takefocus=True)
        self.new_status_edit_window.title(f"增加状态")
        self.icon_data = self.status_icon
        icon_list = []
        for names, i in self.icon_data.items():
            icon_list.append(names)
        # Create widgets
        self.status_frame = tk.Frame(self.new_status_edit_window)
        self.status_frame.pack()

        self.status_label = tk.Label(self.status_frame, text="状态名称:")
        self.status_label.grid(row=0, column=0)

        self.status_entry = tk.Entry(self.status_frame)
        self.status_entry.grid(row=0, column=1)

        self.auto_complete_entry(self.status_frame, self.status_entry, icon_list)

        self.image_button = tk.Button(self.status_frame, text="选择Icon", command=self.select_image_for_status_icon)
        self.image_button.grid(row=0, column=2)

        self.description_label = tk.Label(self.status_frame, text="状态描述:")
        self.description_label.grid(row=1, column=0)

        self.description_text = tk.Text(self.status_frame, height=4, width=30, undo=True)
        self.description_text.grid(row=1, column=1, columnspan=2)

        self.add_button = tk.Button(self.status_frame, text="新状态...", command=self.add_entry_for_status_icon)
        self.add_button.grid(row=2, column=0)

        self.edit_button = tk.Button(self.status_frame, text="修正旧状态?", command=self.edit_entry_for_status_icon)
        self.edit_button.grid(row=2, column=1)

        self.save_button = tk.Button(self.status_frame, text="保存", command=self.save_json_for_status_icon)
        self.save_button.grid(row=2, column=2)

    def select_image_for_status_icon(self):
        file_path = filedialog.askopenfilename(title="Select Image",
                                               filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                               initialdir="Images/IconImages")
        if file_path:
            _, extension = os.path.splitext(file_path)
            filename, dot = os.path.splitext(os.path.basename(file_path))
            if os.path.exists(
                    'Images/IconImages/' + filename + extension):
                pass
            else:
                shutil.copyfile(file_path,
                                'Images/IconImages/' + filename + extension)
            if extension == ".apng" or extension == ".APNG":
                avatar_path = self.apng_to_gif(file_path, _ + ".gif")
            elif extension == ".gif" or extension == ".GIF":
                image = Image.open(file_path)
                # 获取图像的宽和高
                width, height = image.size
                #image = image.resize((80, 80), Image.LANCZOS)
                self.canvas_animate_icon_preview = tk.Canvas(self.status_frame, width=width, height=height)
                self.canvas_animate_icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
                self.frames_icon_preview = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for frame in
                                          ImageSequence.Iterator(image)]
                # 显示 GIF 图片的第一帧
                self.current_frame_icon_preview = self.canvas_animate_icon_preview.create_image(0, 0, anchor=tk.NW, image=
                self.frames_icon_preview[0])
                # 播放 GIF 动画
                self.animate(0, self.canvas_animate_icon_preview, self.current_frame_icon_preview, self.frames_icon_preview)
            else:
                image = Image.open(file_path)  # 替换为你的图片路径
                image = image.resize((80, 80), Image.LANCZOS)
                photo = ImageTk.PhotoImage(image)
                self.image_references_PC.append(photo)
                icon_preview = tk.Label(self.status_frame, image=photo, relief=tk.FLAT)
                icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")

        self.icon_data[self.status_entry.get()] = {"_path": file_path,
                                                   "des": self.description_text.get("1.0", tk.END)}
        self.current_path = file_path


    def add_entry_for_status_icon(self):
        if self.status_entry.get() != "":
            self.status_entry.delete(0, tk.END)
            self.description_text.delete("1.0", tk.END)
            icon_preview = tk.Label(self.status_frame, image="", relief=tk.FLAT)
            icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
            if self.status_entry.get() not in self.icon_data:
                self.icon_data[self.status_entry.get()] = {"_path": self.current_path,
                                                       "des": self.description_text.get("1.0", tk.END)}
            self.save_json_for_status_icon()

    def edit_entry_for_status_icon(self):
        if self.status_entry.get() in self.icon_data:
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, self.icon_data[self.status_entry.get()]["des"])
            if self.icon_data[self.status_entry.get()]["_path"]:
                self.current_path = self.icon_data[self.status_entry.get()]["_path"]
                file_path = self.current_path
                _, extension = os.path.splitext(file_path)
                if extension == ".apng" or extension == ".APNG":
                    avatar_path = self.apng_to_gif(file_path, _ + ".gif")
                elif extension == ".gif" or extension == ".GIF":
                    image = Image.open(file_path)
                    # 获取图像的宽和高
                    width, height = image.size
                    # image = image.resize((80, 80), Image.LANCZOS)
                    self.canvas_animate_icon_preview = tk.Canvas(self.status_frame, width=width, height=height)
                    self.canvas_animate_icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")
                    self.frames_icon_preview = [ImageTk.PhotoImage(frame.resize((width, height), Image.LANCZOS)) for
                                                frame in
                                                ImageSequence.Iterator(image)]
                    # 显示 GIF 图片的第一帧
                    self.current_frame_icon_preview = self.canvas_animate_icon_preview.create_image(0, 0, anchor=tk.NW,
                                                                                                    image=
                                                                                                    self.frames_icon_preview[
                                                                                                        0])
                    # 播放 GIF 动画
                    self.animate(0, self.canvas_animate_icon_preview, self.current_frame_icon_preview,
                                 self.frames_icon_preview)
                else:
                    image = Image.open(self.icon_data[self.status_entry.get()]["_path"])  # 替换为你的图片路径
                    image = image.resize((80, 80), Image.LANCZOS)
                    photo = ImageTk.PhotoImage(image)
                    self.image_references_PC.append(photo)
                    icon_preview = tk.Label(self.status_frame, image=photo, relief=tk.FLAT)
                    icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")

        else:
            self.description_text.delete("1.0", tk.END)
            self.description_text.insert(tk.END, "未查找到此条目！")
            icon_preview = tk.Label(self.status_frame, image="", relief=tk.FLAT)
            icon_preview.grid(row=3, column=1, padx=0, pady=0, sticky="nsew")

    def save_json_for_status_icon(self):
        if self.status_entry.get() != "":
            self.icon_data[self.status_entry.get()] = {"_path": self.current_path,
                                                           "des": self.description_text.get("1.0", tk.END)}
            file_path = "AppSettings/status_icon_settings.json"
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(self.icon_data, file, indent=4, ensure_ascii=False)

    def update_roles_skills(self, event, role):
        self.new_skills_edit_window = tk.Toplevel(root, takefocus=True)
        if "NPC_name" in role:
            self.new_skills_edit_window.title(f"【NPC】{role.split('NPC_name')[1]}的技能修改")
        else:
            self.new_skills_edit_window.title(f"{self.role_entries_name[role]}的技能修改")
        if "NPC_name" in role:
            self.role_skills_data = self.role_skill_menu[role.split('NPC_name')[0]]
        else:
            self.role_skills_data = self.role_skill_menu[self.role_entries_name[role]]
        # Create widgets
        self.status_frame = tk.Frame(self.new_skills_edit_window)
        self.status_frame.pack()

        self.type_label = tk.Label(self.status_frame, text="Type:")
        self.type_label.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
        self.type_var = tk.StringVar()
        self.type_var.set("请选择类型")  # Default value
        self.type_menu = tk.OptionMenu(self.status_frame, self.type_var, "Skill", "Maneuver", "Spell",
                                       command=self.update_fields_for_roles_skills)
        self.type_menu.grid(row=0, column=1, padx=5, pady=5, sticky="nsew")

        self.name_label = tk.Label(self.status_frame, text="请选择类型")
        self.name_label.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")

        self.name_entry = tk.Entry(self.status_frame)
        self.name_entry.grid(row=1, column=1, padx=5, pady=5, sticky="nsew")

        self.check_label = tk.Label(self.status_frame, text="请选择类型")
        self.check_label.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

        self.check_text = tk.Entry(self.status_frame)
        self.check_text.grid(row=2, column=1, padx=5, pady=5, sticky="nsew")

        self.require_label = tk.Label(self.status_frame, text="请选择类型")
        self.require_label.grid(row=3, column=0, padx=5, pady=5, sticky="nsew")

        self.require_text = tk.Entry(self.status_frame)
        self.require_text.grid(row=3, column=1, padx=5, pady=5, sticky="nsew")

        self.exp_label = tk.Label(self.status_frame, text="请选择类型")
        self.exp_label.grid(row=4, column=0, padx=5, pady=5, sticky="nsew")

        self.exp_text = tk.Entry(self.status_frame)
        self.exp_text.grid(row=4, column=1, padx=5, pady=5, sticky="nsew")

        self.description_label = tk.Label(self.status_frame, text="请选择类型")
        self.description_label.grid(row=5, column=0, padx=5, pady=5, sticky="nsew")

        self.description_text = tk.Text(self.status_frame, height=4, width=30, undo=True)
        self.description_text.grid(row=5, column=1, columnspan=2)

        self.add_button = tk.Button(self.status_frame, text="新技能...",
                                    command=lambda role=role: self.add_entry_for_roles_skills(role))
        self.add_button.grid(row=6, column=0)

        self.edit_button = tk.Button(self.status_frame, text="修正旧技能?", command=self.edit_entry_for_roles_skills)
        self.edit_button.grid(row=6, column=1)

        self.save_button = tk.Button(self.status_frame, text="保存",
                                     command=lambda role=role: self.save_json_for_roles_skills(role))
        self.save_button.grid(row=6, column=2)

    def add_entry_for_roles_skills(self, role):
        self.name_entry.delete(0, tk.END)
        self.check_text.delete(0, tk.END)
        self.require_text.delete(0, tk.END)
        self.exp_text.delete(0, tk.END)
        self.description_text.delete("1.0", tk.END)
        self.save_json_for_roles_skills(role)

    def edit_entry_for_roles_skills(self):
        for skillname, type in self.role_skills_data.items():
            if self.name_entry.get() in skillname.split("[")[0].split(":")[0] and self.type_var.get().upper() == type.upper():
                self.name_entry.delete(0, tk.END)
                self.check_text.delete(0, tk.END)
                self.require_text.delete(0, tk.END)
                self.exp_text.delete(0, tk.END)
                self.description_text.delete("1.0", tk.END)
                if self.type_var.get() == "Skill":
                    self.name_entry.insert(tk.END, skillname.split("[")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.exp_text.insert(tk.END, skillname.split(")")[1].split("：")[0])
                    self.description_text.insert(tk.END, skillname.split("：")[1])
                    break
                elif self.type_var.get() == "Spell":
                    self.name_entry.insert(tk.END, skillname.split("[")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.description_text.insert(tk.END, skillname.split("：")[1])
                    break
                else:
                    self.name_entry.insert(tk.END, skillname.split(":")[0])
                    self.check_text.insert(tk.END, skillname.split("[")[1].split("]")[0])
                    self.require_text.insert(tk.END, skillname.split("(")[1].split(")")[0])
                    self.exp_text.insert(tk.END, skillname.split(")")[1])
                    self.description_text.insert(tk.END, skillname.split(":")[1].split("[")[0])
                    break
            else:
                self.description_text.delete("1.0", tk.END)
                self.description_text.insert(tk.END, "未查找到此条目！")

    def save_json_for_roles_skills(self, role):
        if self.name_entry.get() != "":
            file_path = "GameSaves/skill_menu_by_name.json"
            for skillname, type in self.role_skills_data.items():
                if self.name_entry.get() in skillname.split("[")[0].split(":")[0] and self.type_var.get().upper() == type.upper():
                    self.role_skills_data.pop(skillname)
                    break
            if self.type_var.get() == "Skill":
                self.role_skills_data[
                    f"{self.name_entry.get()}[{self.check_text.get()}]({self.require_text.get()}){self.exp_text.get()}：{self.description_text.get('1.0', tk.END)}"] = "skill"
            elif self.type_var.get() == "Spell":
                self.role_skills_data[
                    f"{self.name_entry.get()}[{self.check_text.get()}]({self.require_text.get()})：{self.description_text.get('1.0', tk.END)}"] = "spell"
            else:
                self.role_skills_data[
                    f"{self.name_entry.get()}:{self.description_text.get('1.0', tk.END)}[{self.check_text.get()}]({self.require_text.get()}){self.exp_text.get()}"] = "maneuver"

            if "NPC_name" in role:
                self.role_skill_menu[role.split('NPC_name')[1]] = self.role_skills_data
            else:
                self.role_skill_menu[self.role_entries_name[role]] = self.role_skills_data
            with open(file_path, "w", encoding='utf-8') as file:
                json.dump(self.role_skill_menu, file, indent=4, ensure_ascii=False)

    def update_fields_for_roles_skills(self, event):
        skill_list = []
        m_list = []
        spell_list = []
        for skillname, type in self.role_skills_data.items():
            if type == "skill":
                skill_list.append(skillname.split("[")[0])
            elif type == "spell":
                spell_list.append(skillname.split("[")[0])
            else:
                m_list.append(skillname.split(":")[0])
        #print(skill_list)
        #print(m_list)
        #print(spell_list)
        # Clear previous data
        self.name_entry.delete(0, tk.END)
        self.description_text.delete("1.0", tk.END)
        self.require_text.delete(0, tk.END)
        # Update labels based on selection
        if self.type_var.get() == "Skill":
            self.name_label.config(text="技能名称:")
            self.check_label.config(text="所鉴定技能:")
            self.require_label.config(text="有什么要求？")
            self.exp_label.config(text="效果公式?")
            self.exp_text.config(state="normal")
            self.description_label.config(text="技能描述:")
            self.auto_complete_entry(self.status_frame, self.name_entry, skill_list)
        elif self.type_var.get() == "Spell":
            self.name_label.config(text="法术名称:")
            self.check_label.config(text="(伤害)效果公式:")
            self.require_label.config(text="消费?")
            self.require_text.insert(tk.END, "例:1MP 1SAN+可变SAN → M1 S1+?")
            self.exp_label.config(text="无需填写:")
            self.exp_text.config(state="disabled")
            self.description_label.config(text="法术描述:")
            self.description_text.insert(tk.END, "生效时长、持续时间、描写、说明等")
            self.auto_complete_entry(self.status_frame, self.name_entry, spell_list)
        elif self.type_var.get() == "Maneuver":
            self.name_label.config(text="战技/特技名称:")
            self.check_label.config(text="所鉴定技能?")
            self.require_label.config(text="有什么要求?")
            self.exp_label.config(text="效果公式?")
            self.exp_text.config(state="normal")
            self.description_label.config(text="效果描述:")
            self.auto_complete_entry(self.status_frame, self.name_entry, m_list)

    def update_health_bar(self, role):
        # self.draw_status_icon_canvas(role)
        # self.destroy_status_icon_canvas(role)
        global is_hiding_health_bar
        status_list_name = []
        status_list = {}
        if "NPC_name" in role:
            HP = self.role_values_entry[role].get("2.0", "3.0")
            _HP = int(HP.split("/")[0])
            HP_ = int(HP.split("/")[1].split(":")[0])
            MP = self.role_values_entry[role].get("3.0", "4.0")
            _MP = int(MP.split("/")[0])
            MP_ = int(MP.split("/")[1].split(":")[0])
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            for status in status_list_:
                if "(" in status:
                    status_list_name.append(status.split("(")[0])
                elif "（" in status:
                    status_list_name.append(status.split("（")[0])
                else:
                    status_list_name.append(status)
            for status2 in status_list_name:
                if status2 in self.status_icon:
                    _, extension = os.path.splitext(self.status_icon[status2]["_path"])
                    filename, dot = os.path.splitext(os.path.basename(self.status_icon[status2]["_path"]))
                    if extension == ".apng" or extension == ".APNG":
                        avatar_path = self.apng_to_gif(self.status_icon[status2]["_path"], _ + ".gif")
                    elif extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.status_icon[status2]["_path"])
                        # 获取图像的宽和高
                        width, height = image.size
                        self.canvas_animate_icon2 = tk.Canvas(self.ani_frame_icon[role], width=50, height=50)
                        self.canvas_animate_icon2.grid(row=3, column=2, padx=5, pady=5, sticky="nsew")
                        self.canvas_animate_icon2.bind("<Button-1>", lambda event: self.update_status_icon(event))
                        self.canvas_animate_icon2.bind("<Enter>",
                                                       lambda event, r=role: self.draw_status_icon_canvas(event, r))
                        self.canvas_animate_icon2.bind("<Leave>",
                                                       lambda event, r=role: self.destroy_status_icon_canvas(r))
                        self.frames_icon2 = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for
                                             frame in
                                             ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        self.current_frame_icon2 = self.canvas_animate_icon2.create_image(0, 0, anchor=tk.NW,
                                                                                          image=self.frames_icon2[0])
                        # 播放 GIF 动画
                        self.animate(0, self.canvas_animate_icon2, self.current_frame_icon2,
                                     self.frames_icon2)
                    else:
                        if self.canvas_animate_icon2 is not None:
                            self.canvas_animate_icon2.grid_forget()
                        image = Image.open(self.status_icon[status2]["_path"])  # 替换为你的图片路径
                        image = image.resize((50, 50), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references.append(photo)
                        self.role_statusbar_icon[role].config(image=photo)
                    break
                else:
                    self.role_statusbar_icon[role].config(image="")
            if is_hiding_health_bar:
                self.role_sstatusbar_mp[role].config(
                    text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5, show_text=False),
                    font=("Times New Roman", 1))
            else:
                self.role_sstatusbar_mp[role].config(
                    text="MP " + self.draw_health_bar(_MP, MP_, bar_length=5, show_text=False), font=None)
            #SAN = self.role_values_entry[role].get("1.0", "2.0")
            #_SAN = int(SAN.split("/")[0])
            #SAN_ = int(SAN.split("/")[1].split(":")[0])
            if is_hiding_health_bar:
                # self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=("Times New Roman", 1))
                self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=None)
            else:
                self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=None)
        else:
            HP = self.role_values_entry[role].get("2.0", "3.0")
            _HP = int(HP.split("/")[0])
            HP_ = int(HP.split("/")[1].split(":")[0])
            MP = self.role_values_entry[role].get("3.0", "4.0")
            _MP = int(MP.split("/")[0])
            MP_ = int(MP.split("/")[1].split(":")[0])
            if is_hiding_health_bar:
                self.role_sstatusbar_mp[role].config(text="HP " + self.draw_health_bar(_HP, HP_, bar_length=5,
                                                                                       show_text=False) + "\nMP " + self.draw_health_bar(
                    _MP, MP_, bar_length=5, show_text=False), font=("Times New Roman", 1))
            else:
                self.role_sstatusbar_mp[role].config(text="HP " + self.draw_health_bar(_HP, HP_, bar_length=5,
                                                                                       show_text=False) + "\nMP " + self.draw_health_bar(
                    _MP, MP_, bar_length=5, show_text=False), font=("Times New Roman", 7))
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            for status in status_list_:
                if "(" in status:
                    status_list_name.append(status.split("(")[0])
                elif "（" in status:
                    status_list_name.append(status.split("（")[0])
                else:
                    status_list_name.append(status)
                status_list[status] = {}
            for status2 in status_list_name:
                if status2 in self.status_icon:
                    if self.status_icon[status2]["_path"]:
                        _, extension = os.path.splitext(self.status_icon[status2]["_path"])
                        filename, dot = os.path.splitext(os.path.basename(self.status_icon[status2]["_path"]))
                        if extension == ".apng" or extension == ".APNG":
                            avatar_path = self.apng_to_gif(self.status_icon[status2]["_path"], _ + ".gif")
                        elif extension == ".gif" or extension == ".GIF":
                            image = Image.open(self.status_icon[status2]["_path"])
                            # 获取图像的宽和高
                            width, height = image.size
                            self.canvas_animate_icon2 = tk.Canvas(self.ani_frame_icon[role], width=50,
                                                                 height=50)
                            self.canvas_animate_icon2.grid(row=3, column=2, padx=5, pady=5, sticky="nsew")
                            self.canvas_animate_icon2.bind("<Button-1>", lambda event: self.update_status_icon(event))
                            self.canvas_animate_icon2.bind("<Enter>", lambda event, r=role: self.draw_status_icon_canvas(event, r))
                            self.canvas_animate_icon2.bind("<Leave>", lambda event, r=role: self.destroy_status_icon_canvas(r))
                            self.frames_icon2 = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for
                                                frame in
                                                ImageSequence.Iterator(image)]
                            # 显示 GIF 图片的第一帧
                            self.current_frame_icon2 = self.canvas_animate_icon2.create_image(0, 0, anchor=tk.NW,
                                                                                            image=
                                                                                            self.frames_icon2[
                                                                                                0])
                            # 播放 GIF 动画
                            self.animate(0, self.canvas_animate_icon2, self.current_frame_icon2,
                                         self.frames_icon2)
                        else:
                            if self.canvas_animate_icon2 != None:
                                self.canvas_animate_icon2.grid_forget()
                                self.canvas_animate_icon2 = None
                            image = Image.open(self.status_icon[status2]["_path"])  # 替换为你的图片路径
                            image = image.resize((30, 30), Image.LANCZOS)
                            photo = ImageTk.PhotoImage(image)
                            self.image_references_PC.append(photo)
                            self.role_statusbar_icon[role].config(image=photo)
                            # print(self.status_icon[status2]["des"])
                        break
                else:
                    self.role_statusbar_icon[role].config(image="")
                    # print(status2)
            SAN = self.role_values_entry[role].get("1.0", "2.0")
            _SAN = int(SAN.split("/")[0])
            SAN_ = int(SAN.split("/")[1].split(":")[0])
            if is_hiding_health_bar:
                # self.role_statusbar_health[role].config(text=self.draw_health_bar(_HP, HP_, bar_length=18), font=("Times New Roman", 1))
                self.role_statusbar_health[role].config(text=self.draw_health_bar(_SAN, SAN_, bar_length=18), font=None)
            else:
                self.role_statusbar_health[role].config(text=self.draw_health_bar(_SAN, SAN_, bar_length=18), font=None)

    def destroy_status_icon_canvas(self, role):
        # print("leave" + role)
        # 离开悬停事件处理
        # self.avatar_click_event = role
        # current_role = self.current_role.get()
        self.new_window_statusCanvas.destroy()

    def draw_status_icon_canvas(self, event, role):
        self.update_health_bar(role)
        # print("enter"+role)
        # 悬停事件处理
        self.new_window_statusCanvas = tk.Toplevel(root)
        x, y = event.x_root, event.y_root
        #window_width = self.new_window_statusCanvas.winfo_width()
        #window_height = self.new_window_statusCanvas.winfo_height()
        self.new_window_statusCanvas.geometry(f"+{x + 5}+{y + 5}")
        if "NPC_name" in role:
            if role.split("NPC_name")[1]:
                name_ = role.split("NPC_name")[1]
            else:
                name_ = "NPC"
            self.new_window_statusCanvas.title(f"NPC - {name_}的状态")
        else:
            self.new_window_statusCanvas.title(f"{role} - {self.role_entries_name[role]}的状态")
        # self.avatar_click_event = role
        current_role = self.current_role.get()
        status_list = {}
        if "NPC_name" in role:
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            length = len(status_list_)
            for status2 in status_list_:
                if "(" in status2:
                    status_list_name = status2.split("(")[0]
                elif "（" in status2:
                    status_list_name = status2.split("（")[0]
                else:
                    status_list_name = status2
                if status_list_name in self.status_icon:
                    _, extension = os.path.splitext(self.status_icon[status_list_name]["_path"])
                    filename, dot = os.path.splitext(os.path.basename(self.status_icon[status_list_name]["_path"]))
                    if extension == ".apng" or extension == ".APNG":
                        avatar_path = self.apng_to_gif(self.status_icon[status_list_name]["_path"], _ + ".gif")
                    elif extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.status_icon[status_list_name]["_path"])
                        # 获取图像的宽和高
                        width, height = image.size
                        self.canvas_animate_icon = tk.Canvas(self.ani_frame_icon, width=width, height=height)
                        self.canvas_animate_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                        self.frames_icon = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for
                                                    frame in
                                                    ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        self.current_frame_icon = self.canvas_animate_icon.create_image(0, 0,anchor=tk.NW,
                                                                                                        image=
                                                                                                        self.frames_icon[
                                                                                                            0])
                        # 播放 GIF 动画
                        self.animate(0, self.canvas_animate_icon, self.current_frame_icon,
                                     self.frames_icon)
                    else:
                        image = Image.open(self.status_icon[status_list_name]["_path"])  # 替换为你的图片路径
                        image = image.resize((50, 50), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references.append(photo)
                        width, height = image.size
                        canvas_icon = tk.Label(self.new_window_statusCanvas, image=photo, relief=tk.FLAT)
                        canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status2, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas,
                                          text="  " + self.status_icon[status_list_name]["des"], relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                else:
                    canvas_icon = tk.Label(self.new_window_statusCanvas, image="", relief=tk.FLAT)
                    canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status_list_name, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas, text="  " + status2, relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                length -= 1
        else:
            status_list_ = self.role_values_entry[role].get("1.0", tk.END).split("===状态===")[1].split("===")[
                0].strip().split("\n")
            length = len(status_list_)
            for status2 in status_list_:
                if "(" in status2:
                    status_list_name = status2.split("(")[0]
                elif "（" in status2:
                    status_list_name = status2.split("（")[0]
                else:
                    status_list_name = status2
                if status_list_name in self.status_icon:
                    if self.status_icon[status_list_name]["_path"]:
                        _, extension = os.path.splitext(self.status_icon[status_list_name]["_path"])
                        filename, dot = os.path.splitext(os.path.basename(self.status_icon[status_list_name]["_path"]))
                        if extension == ".apng" or extension == ".APNG":
                            avatar_path = self.apng_to_gif(self.status_icon[status_list_name]["_path"], _ + ".gif")
                        elif extension == ".gif" or extension == ".GIF":
                            image = Image.open(self.status_icon[status_list_name]["_path"])
                            # 获取图像的宽和高
                            width, height = image.size
                            self.canvas_animate_icon = tk.Canvas(self.new_window_statusCanvas, width=50,
                                                                 height=50)
                            self.canvas_animate_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                            self.frames_icon = [ImageTk.PhotoImage(frame.resize((50, 50), Image.LANCZOS)) for
                                                frame in ImageSequence.Iterator(image)]
                            # 显示 GIF 图片的第一帧
                            self.current_frame_icon = self.canvas_animate_icon.create_image(0, 0, anchor=tk.NW,
                                                                                            image=self.frames_icon[0])
                            # 播放 GIF 动画
                            self.animate(0, self.canvas_animate_icon, self.current_frame_icon,
                                         self.frames_icon)
                        else:
                            image = Image.open(self.status_icon[status_list_name]["_path"])  # 替换为你的图片路径
                            image = image.resize((50, 50), Image.LANCZOS)
                            photo = ImageTk.PhotoImage(image)
                            self.image_references_PC.append(photo)
                            width, height = image.size
                            canvas_icon = tk.Label(self.new_window_statusCanvas, image=photo, relief=tk.FLAT)
                            canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status2, relief=tk.FLAT,
                                               font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas,
                                              text="  " + self.status_icon[status_list_name]["des"], relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                else:
                    canvas_icon = tk.Label(self.new_window_statusCanvas, image="", relief=tk.FLAT)
                    canvas_icon.grid(row=length - 1, column=0, padx=0, pady=0, sticky="nsew")
                    canvas_name = tk.Label(self.new_window_statusCanvas, text=status_list_name, relief=tk.FLAT,
                                           font=("Times New Roman", 12, "bold"))
                    canvas_name.grid(row=length - 1, column=1, padx=0, pady=0, sticky="nsew")
                    canvas_des = tk.Label(self.new_window_statusCanvas, text="  " + status2, relief=tk.FLAT)
                    canvas_des.grid(row=length - 1, column=2, padx=0, pady=0, sticky="nsew")
                length -= 1

    def draw_health_bar(self, current_health, max_health, bar_length=10, show_text=True):
        if current_health == "(CON+SIZ)/10":
            current_health = 0
            max_health = 1
        if current_health == "POW/5":
            current_health = 0
            max_health = 1
        if current_health == "POW":
            current_health = 0
            max_health = 1
        if max_health > 0:
            filled_length = int(bar_length * current_health / int(max_health))
        else:
            filled_length = 0
        bar = '█' * filled_length + '▪' * (bar_length - filled_length)
        if show_text:
            return f"{bar} {current_health}/{int(max_health)}"
        else:
            return f"{bar}"

    def on_closing_new_NPC_window(self, key):
        self.search_and_delete_insert_symbol()

        # self.new_combat_window.destroy()
        if key not in self.new_combat_windows:
            return
        self.new_combat_windows.pop(key).destroy()
        self.role_entries.pop(key)
        if key.split("NPC_name")[1] == "":
            name = "NPC"
        else:
            name = key.split("NPC_name")[1]
        self.chat_log.insert(tk.END,
                             f'活字命令 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【角色退场】{name}\n\n')
        self.chat_log.yview(tk.END)
        # if len(self.new_combat_windows) > 0:
        # self.new_combat_window = self.new_combat_windows[len(self.new_combat_windows)-1]
        # self.role_entries_frame.pop(key).destroy()
        # self.roles.pop()

    def set_start_point(self, event):
        self.start_x = event.x
        self.start_y = event.y

    def draw(self, event):
        global isOpeningFiles
        if isOpeningFiles:
            pass
        else:
            if self.start_x is not None and self.start_y is not None:
                x, y = event.x, event.y
                self.canvas.tag_lower(self.canvas.create_line(self.start_x, self.start_y, x, y, width=2))
                self.start_x = x
                self.start_y = y

    def set_erase_point(self, event):
        self.start_x = event.x
        self.start_y = event.y

    def erase(self, event):
        if self.start_x is not None and self.start_y is not None:
            x, y = event.x, event.y
            self.canvas.tag_lower(self.canvas.create_line(self.start_x, self.start_y, x, y, width=5, fill="white"))
            self.start_x = x
            self.start_y = y

    def stop_drawing(self, event):
        # 鼠标松开时的事件处理函数
        self.start_x = None
        self.start_y = None

    def delete_information(self, role):
        # 获取选中的条目
        if role == "KP":
            selected_item = self.tree_main.selection()
            if selected_item is None:
                selected_item = self.tree_main.selection()
                # 如果有选中的条目
                if selected_item:
                    for l in selected_item:
                        # 更改选中条目的背景色为红色
                        # self.tree2_list[role].item(selected_item, tags=('red_background'))
                        self.tree_main.delete(l)
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree_list[role].item(selected_item, tags=('red_background'))
                    self.tree_main.delete(l)
        else:
            selected_item = self.tree_list[role].selection()
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree_list[role].item(selected_item, tags=('red_background'))
                    self.tree_list[role].delete(l)
            selected_item = self.tree2_list[role].selection()
            # 如果有选中的条目
            if selected_item:
                for l in selected_item:
                    # 更改选中条目的背景色为红色
                    # self.tree2_list[role].item(selected_item, tags=('red_background'))
                    self.tree2_list[role].delete(l)

    def on_double_click(self, event, role=None):
        # 获取双击的条目
        item = self.tree_list[role].selection()
        if item:
            # 获取条目的值
            values = self.tree_list[role].item(item, "values")
            # 创建一个弹出对话框，让用户输入新的记忆指数或内容
            new_memory_index = simpledialog.askinteger("修改记忆指数", f"{values[1]}\n\n当前记忆指数：{values[2]}\n请输入新的记忆指数：",initialvalue=values[2],
                                                       minvalue=-5,
                                                       maxvalue=100)
            new_memory_ = simpledialog.askstring("修改记忆内容", f"{values[1]}\n\n当前记忆指数：{values[2]}\n请输入新的记忆内容：",initialvalue=values[1]).replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
            if new_memory_index is not None:
                # 更新Treeview中的值
                self.tree_list[role].item(item, values=(values[0], values[1], new_memory_index))
                values = self.tree_list[role].item(item, "values")
            if new_memory_ is not None:
                # 更新Treeview中的值
                self.tree_list[role].item(item, values=(values[0], new_memory_, values[2]))
        sorted_ids = sorted(self.tree_list[role].get_children(), key=lambda x: self.tree_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree_list[role].insert("", "end", values=values)
            self.tree_list[role].delete(item_id)
            self.tree_list[role].update()

    def on_double_click2(self, event, role=None):
        # 获取双击的条目
        item = self.tree2_list[role].selection()
        if item:
            # 获取条目的值
            values = self.tree2_list[role].item(item, "values")
            # 创建一个弹出对话框，让用户输入新的记忆指数或内容
            new_memory_index = simpledialog.askinteger("修改记忆指数", f"{values[1]}\n\n当前记忆指数：{values[2]}\n请输入新的记忆指数：",
                                                       initialvalue=values[2],
                                                       minvalue=-5,
                                                       maxvalue=100)
            new_memory_ = simpledialog.askstring("修改记忆内容", f"{values[1]}\n\n当前记忆指数：{values[2]}\n请输入新的记忆内容：",
                                                 initialvalue=values[1]).replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
            if new_memory_index is not None:
                # 更新Treeview中的值
                self.tree2_list[role].item(item, values=(values[0], values[1], new_memory_index))
                values = self.tree2_list[role].item(item, "values")
            if new_memory_ is not None:
                # 更新Treeview中的值
                self.tree2_list[role].item(item, values=(values[0], new_memory_, values[2]))
        sorted_ids = sorted(self.tree2_list[role].get_children(), key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree2_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree2_list[role].insert("", "end", values=values)
            self.tree2_list[role].delete(item_id)
            self.tree2_list[role].update()

    def on_double_click_main(self, event):
        # 获取双击的条目
        item = self.tree_main.selection()
        if item:
            # 获取条目的值
            values = self.tree_main.item(item, "values")
            # 创建一个弹出对话框，让用户输入新的记忆内容
            comment = values[3].replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
            new_memory_ = simpledialog.askstring("修改记忆内容", f"{values[1]}\n\n{values[2]}：{comment}\n\n请输入新的记忆内容：",
                                                 initialvalue=values[1]).replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
            if new_memory_ is not None:
                # 更新Treeview中的值
                self.tree_main.item(item, values=(values[0], new_memory_, values[2], values[3]))

    def edit_callback(self, new_value, item, col_id, role):
        self.tree2_list[role].set(item, col_id, new_value)
        return True

    def add_information(self, role=None):
        self.information_sources = ["来源A", "来源B", "来源C"]  # 你的信息来源列表

        self.dialog = MemoryInfoDialog(self.new_window, f"为【{self.role_entries_name[role]}】添加信息",
                                       self.information_sources,
                                       role)
        result = self.dialog.result
        if result["评分"] == "遗忘":
            self.add_inference2self2(result["信息来源"], "[该信息已遗忘 - Ignorance is a bliss.]  " + result["信息内容"],
                                     result["记忆指数"], "×", role)
        else:
            self.add_inference2self(result["信息来源"], result["信息内容"], result["记忆指数"], role)

    def add_information_public(self, role=None):
        self.dialog = MemoryInfoDialog_public(self.new_window, f"为【公共信息池】添加信息", role)
        result = self.dialog.result
        self.add_inference2public(result["信息来源"], result["信息内容"], result["评论"], result["共享人"])

    def forget_information(self, role):
        # 实现遗忘信息的逻辑
        # 获取所有条目的ID
        all_items = self.tree_list[role].get_children()
        # 检查是否有条目
        if all_items:
            # 获取最后一个条目的ID
            last_item = all_items[-1]
            # 使用delete方法删除最后一个条目
            self.add_inference2self2(self.tree_list[role].item(last_item, "values")[0],
                                     self.tree_list[role].item(last_item, "values")[1],
                                     self.tree_list[role].item(last_item, "values")[2], "×", role)
            self.tree_list[role].delete(last_item)

    def upload_information(self, role=None):
        # 获取选中的条目
        if role == "KP":
            pass
        else:
            selected_item = self.tree_list[role].selection()
            # 如果有选中的条目
            if selected_item:
                for l in selected_item:
                    self.tree_main.insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.role_entries_name[role], self.thoughts[role].get("1.0", tk.END)))
                    print(self.tree_list[role].item(l, "values"))
                    self.tree2_list[role].insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.tree_list[role].item(l, "values")[2], "√"))
                    self.tree_list[role].delete(l)
                    # self.add_inference2public(l["信息来源"], "关于X的信息", "想法", role)
                    # self.add_inference2self2("玩家1", "关于X的信息", -4, "√", role)
                sorted_ids = sorted(self.tree2_list[role].get_children(),
                                    key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                                    reverse=True)
                # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
                for item_id in sorted_ids:
                    values = self.tree2_list[role].item(item_id, "values")
                    # 在这里进行你需要的操作，可以根据需要修改 values 的内容
                    self.tree2_list[role].insert("", "end", values=values)
                    self.tree2_list[role].delete(item_id)
                    self.tree2_list[role].update()
            else:
                list = self.tree_list[role].get_children()
                for l in list:
                    self.tree_main.insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.role_entries_name[role], self.thoughts[role].get("1.0", tk.END)))
                    print(self.tree_list[role].item(l, "values"))
                    self.tree2_list[role].insert("", "end", values=(
                        self.tree_list[role].item(l, "values")[0], self.tree_list[role].item(l, "values")[1],
                        self.tree_list[role].item(l, "values")[2], "√"))
                    self.tree_list[role].delete(l)
                    # self.add_inference2public(l["信息来源"], "关于X的信息", "想法", role)
                    # self.add_inference2self2("玩家1", "关于X的信息", -4, "√", role)
                sorted_ids = sorted(self.tree2_list[role].get_children(),
                                    key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                                    reverse=True)
                # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
                for item_id in sorted_ids:
                    values = self.tree2_list[role].item(item_id, "values")
                    # 在这里进行你需要的操作，可以根据需要修改 values 的内容
                    self.tree2_list[role].insert("", "end", values=values)
                    self.tree2_list[role].delete(item_id)
                    self.tree2_list[role].update()

    def clear_information(self, role=None):
        if role == "KP":
            self.tree_main.delete(*self.tree_main.get_children())
        else:
            self.tree_list[role].delete(*self.tree_list[role].get_children())
            self.tree2_list[role].delete(*self.tree2_list[role].get_children())

    def calculator(self):
        self.dialog = DiceRollDialog(self.new_window, f"信息扩散器 & 调查进度计算器")
        result = self.dialog.result

    def expand_information(self, role=None):
        _number = 0
        for role in self.roles:
            _number += 1
            _string = "PL " + str(_number + 2)
            if role == "PL 1" or role == "PL 4" or role == "PL 7":  # 最大支持到7个PL，后续可以用算式取代
                pass
            else:
                if self.info_toggle[role] == "off":
                    if role == "KP":
                        self.tree_main.grid_forget()
                        self.info_toggle[role] = "on"
                        # self.frames["KP"].grid_forget()
                    else:
                        self.tree_list[role].grid_forget()  # 缩进
                        self.tree2_list[role].grid_forget()
                        for r in self.roles:
                            if r != "KP":
                                self.thoughts[r].grid_forget()
                        self.info_toggle[role] = "on"
                else:
                    if role == "KP":
                        # self.frames["KP"].grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                        self.tree_main.grid(row=1, column=3, sticky="nsew")
                        self.KP_entry.grid(row=0, column=3, padx=0, pady=0, sticky="nsew")
                        self.info_toggle[role] = "off"
                    else:
                        self.tree_list[role].grid(row=0, column=4, sticky="nsew")
                        self.tree2_list[role].grid(row=2, column=4, sticky="nsew")
                        for r in self.roles:
                            if r != "KP":
                                self.thoughts[r].grid(row=1, column=4, padx=0, pady=0, sticky="nsew")
                        self.info_toggle[role] = "off"

    def add_inference2self(self, name, info, memory_index, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            return
        self.tree_list[role].insert("", "end", values=(name, info, memory_index))
        # 获取 Treeview 中所有条目的ID，并按记忆指数从大到小排序
        sorted_ids = sorted(self.tree_list[role].get_children(), key=lambda x: self.tree_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree_list[role].insert("", "end", values=values)
            self.tree_list[role].delete(item_id)
            self.tree_list[role].update()

    def add_inference2self2(self, name, info, memory_index, status, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            return
        self.tree2_list[role].insert("", "end", values=(name, info, memory_index, status))
        sorted_ids = sorted(self.tree2_list[role].get_children(), key=lambda x: self.tree2_list[role].set(x, "记忆指数"),
                            reverse=True)
        # 遍历排序后的条目ID，将它们插入到新的 Treeview 中
        for item_id in sorted_ids:
            values = self.tree2_list[role].item(item_id, "values")
            # 在这里进行你需要的操作，可以根据需要修改 values 的内容
            self.tree2_list[role].insert("", "end", values=values)
            self.tree2_list[role].delete(item_id)
            self.tree2_list[role].update()

    def add_inference2public(self, name, info, statement, role=None):
        # 在Treeview中添加一行数据
        if role == None:
            self.tree_main.insert("", "end", values=(name, info, "未知", statement))
        else:
            self.tree_main.insert("", "end", values=(name, info, self.role_entries_name[role], statement))

    def load_treeview_data(self, treeview, filename, role=None):
        try:
            with open(filename, 'r', encoding='utf-8') as file:
                data_ = json.load(file)
                if data_:
                    if role == "KP":
                        data = data_[role]
                        for item_data in data:
                            treeview.insert('', 'end', values=item_data)
                    else:
                        if role in data_:
                            data = data_[role]
                            for item_data in data:
                                treeview.insert('', 'end', values=item_data)
        except FileNotFoundError:
            print(f"文件 '{filename}' 不存在")

    def on_closing_new_window(self):
        with open('GameSaves/Deduction_infos_base.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree2_list[role].get_children():
                        values = self.tree2_list[role].item(item, 'values')
                        value_list.append(values)
                else:
                    for item in self.tree_main.get_children():
                        values = self.tree_main.item(item, 'values')
                        value_list.append(values)
                data[role] = value_list
            json.dump(data, file, indent=4,ensure_ascii=False)
        with open('GameSaves/Deduction_infos_new.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree_list[role].get_children():
                        values = self.tree_list[role].item(item, 'values')
                        value_list.append(values)
                    data[role] = value_list
            json.dump(data, file, indent=4,ensure_ascii=False)
        # self.new_window.destroy()

    def on_closing_new_window_close(self):
        global Is_Opened
        Is_Opened = False
        self.new_window_button = tk.Button(root, text="调查模块", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")
        with open('GameSaves/Deduction_infos_base.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree2_list[role].get_children():
                        values = self.tree2_list[role].item(item, 'values')
                        value_list.append(values)
                else:
                    for item in self.tree_main.get_children():
                        values = self.tree_main.item(item, 'values')
                        value_list.append(values)
                data[role] = value_list
            json.dump(data, file, indent=4,ensure_ascii=False)
        with open('GameSaves/Deduction_infos_new.json', 'w', encoding='utf-8') as file:
            data = {}
            for role in self.roles:
                value_list = []
                if role != "KP":
                    for item in self.tree_list[role].get_children():
                        values = self.tree_list[role].item(item, 'values')
                        value_list.append(values)
                    data[role] = value_list
            json.dump(data, file, indent=4,ensure_ascii=False)
        self.new_window.destroy()

    # 新窗口
    def open_new_window(self):
        global Is_Opened
        if Is_Opened:
            #messagebox.showwarning("调查模块已开启！", "请勿重复打开以免产生BUG！")
            self.new_window.focus_set()
            return
        self.new_window = tk.Toplevel(root)
        self.new_window.title("调查模块")

        # self.new_window.grid_rowconfigure(0, weight=1)
        # self.new_window.grid_columnconfigure(0, weight=1)
        self.info_add_button = {}
        self.thoughts = {}
        self.tree_list = {}
        self.tree2_list = {}
        self.info_upload_button = {}
        self.info_delete_button = {}
        self.info_expand_button = {}
        self.info_toggle = {}
        self.frames = {}

        num_cols = 3
        for idx, role in enumerate(self.roles):
            self.info_toggle[role] = "off"
            row = idx % num_cols
            col = idx // num_cols
            # 自动调整列宽
            for i in range(num_cols + 2):
                self.new_window.columnconfigure(i, weight=1)
            if role == "KP":
                frame = tk.LabelFrame(self.new_window, text="共享库", relief=tk.GROOVE)
                frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                self.frames["KP"] = frame
                clearKP_button = tk.Button(frame, text="清\n空\n信\n息", bg="red", fg="black",
                                           command=lambda role=role: self.clear_information(role))
                clearKP_button.grid(row=1, column=0, padx=5, pady=5, sticky="nsew")
                saveKP_button = tk.Button(frame, text="保\n存\n所\n有", bg="black", fg="white",
                                          command=self.on_closing_new_window)
                saveKP_button.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                deleteKP_button = tk.Button(frame, text="删\n除\n信\n息",
                                            command=lambda role=role: self.delete_information(role))
                deleteKP_button.grid(row=1, column=1, pady=5, sticky="nsew")
                # loadKP_button = tk.Button(frame, text="读\n取", command=self.load_treeview_data)
                # loadKP_button.grid(row=1, column=2, pady=5, sticky="nsew")
                map_button = tk.Button(frame, text="绘\n制\n地\n图", bg="green", fg="white",
                                       command=self.open_new_window_map)
                map_button.grid(row=0, column=1, pady=5, sticky="nsew")
                cal_button = tk.Button(frame, text="扩\n散\n计\n算", bg="blue", fg="white", command=self.calculator)
                cal_button.grid(row=1, column=2, pady=5, sticky="nsew")
                # frame.grid_rowconfigure(0, weight=1)
                # frame.grid_columnconfigure(0, weight=1)
                add_button = tk.Button(frame, text="添\n加\n信\n息",
                                       command=lambda role=role: self.add_information_public(role))
                add_button.grid(row=0, column=2, pady=5, sticky="nsew")
                self.info_add_button[role] = add_button
            else:
                if role == "DiceBot":
                    frame = tk.LabelFrame(self.new_window, text="NPC", relief=tk.GROOVE)
                    frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                    # frame.grid_rowconfigure(0, weight=1)
                    # frame.grid_columnconfigure(0, weight=1)
                else:
                    frame = tk.LabelFrame(self.new_window, text=f"{role} - {self.role_entries_name[role]}",
                                          relief=tk.GROOVE)
                    frame.grid(row=row, column=col + 2, padx=5, pady=5, sticky="nsew")
                self.frames[role] = frame
                # frame.grid_rowconfigure(0, weight=1)
                # frame.grid_columnconfigure(0, weight=1)

                forget_button = tk.Button(frame, text="遗\n忘\n信\n息",
                                          command=lambda role=role: self.forget_information(role))
                forget_button.grid(row=2, column=2, pady=5, sticky="nsew")
                upload_button = tk.Button(frame, text="分\n享\n信\n息",
                                          command=lambda role=role: self.upload_information(role))
                upload_button.grid(row=0, column=1, pady=5, sticky="nsew")
                add_button = tk.Button(frame, text="添\n加\n信\n息", command=lambda role=role: self.add_information(role))
                add_button.grid(row=0, column=2, pady=5, sticky="nsew")
                self.info_add_button[role] = add_button
                delete_button = tk.Button(frame, text="删\n除\n信\n息",
                                          command=lambda role=role: self.delete_information(role))
                delete_button.grid(row=2, column=1, pady=5, sticky="nsew")
                clear_button = tk.Button(frame, text="清\n空\n信\n息", bg="red", fg="black",
                                         command=lambda role=role: self.clear_information(role))
                clear_button.grid(row=2, column=0, padx=5, pady=5, sticky="nsew")

                expand_button = tk.Button(frame, text="展\n开\n收\n起",
                                          command=lambda role=role: self.expand_information(role))
                expand_button.grid(row=0, column=0, padx=5, pady=5, sticky="nsew")
                self.info_expand_button[role] = expand_button
            # 使用style修改Treeview的样式
            style = ttk.Style()
            style.configure("Treeview", font=(None, 10), rowheight=12, height=5, sticky="nsew",
                            maxheight=5)  # 设置表头的字体大小

            if role == "KP":
                self.KP_entry = tk.Text(frame, wrap=tk.WORD, width=10, height=10, undo=True)
                self.KP_entry.insert(tk.END, "← 关闭此窗口触发自动保存，也可以手动点击此按钮保存！\n此处可以自由编辑文本，对程序不存在任何影响")
                self.KP_entry.grid(row=0, column=3, padx=0, pady=0, sticky="nsew")
                # 创建Treeview
                self.tree_main = ttk.Treeview(frame, columns=("信息来源", "信息内容", "共享人", "共享想法"), show="headings",
                                              style="Treeview", height=8)
                self.tree_main.heading("信息来源", text="信息来源")
                self.tree_main.heading("信息内容", text="信息内容")
                self.tree_main.heading("共享人", text="共享人")
                self.tree_main.heading("共享想法", text="共享想法")
                self.tree_main.column("信息来源", width=100)
                self.tree_main.column("信息内容", width=200)
                self.tree_main.column("共享人", width=50)
                self.tree_main.column("共享想法", width=100)
                self.tree_main.grid(row=1, column=3, sticky="nsew")
                # 设置行和列的权重，使得Treeview可以随窗口的大小变化而调整
                self.tree_main.grid_rowconfigure(0, weight=1)
                self.load_treeview_data(self.tree_main, "GameSaves/Deduction_infos_base.json", role)
            else:
                entry2 = tk.Text(frame, wrap=tk.WORD, width=1, height=1, undo=True)
                entry2.grid(row=1, column=4, padx=0, pady=0, sticky="nsew")
                self.thoughts[role] = entry2
                # 创建Treeview
                if role == "PL 2":
                    self.tree = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数"), show="headings",
                                             style="Treeview", height=8)
                    self.tree_list[role] = self.tree
                    # 创建Treeview
                    self.tree2 = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数", "记忆状态"), show="headings",
                                              style="Treeview", height=8)
                    self.tree2_list[role] = self.tree2
                else:
                    self.tree = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数"), show="headings",
                                             style="Treeview", height=8)
                    self.tree_list[role] = self.tree
                    # 创建Treeview
                    self.tree2 = ttk.Treeview(frame, columns=("信息来源", "信息内容", "记忆指数", "记忆状态"), show="headings",
                                              style="Treeview", height=8)
                    self.tree2_list[role] = self.tree2
                # 添加标签以供后续使用
                self.tree2.tag_configure('red_background', background='red')
                self.tree2.bind("<Double-1>", lambda event, role=role: self.on_double_click2(event, role))
                self.tree.bind("<Double-1>", lambda event, role=role: self.on_double_click(event, role))
                self.tree_main.bind("<Double-1>", lambda event: self.on_double_click_main(event))

                # 创建Scrollbar
                # scrollbar = ttk.Scrollbar(self.new_window, orient="vertical", command=self.tree.yview)
                # 配置Treeview的yview和Scrollbar的command
                # self.tree.configure(yscrollcommand=scrollbar.set)
                # scrollbar.grid(row=0, column=1, sticky="ns")
                # self.tree.bind("<Double-1>", self.on_double_click())

                # 设置表头
                self.tree.heading("信息来源", text="来源")
                self.tree.heading("信息内容", text="内容")
                self.tree.heading("记忆指数", text="指数")
                self.tree2.heading("信息来源", text="来源")
                self.tree2.heading("信息内容", text="内容")
                self.tree2.heading("记忆指数", text="指数")
                self.tree2.heading("记忆状态", text="状态")

                # 设置列宽
                self.tree.column("信息来源", width=130)
                self.tree.column("信息内容", width=310)
                self.tree.column("记忆指数", width=10)
                self.tree2.column("信息来源", width=130)
                self.tree2.column("信息内容", width=300)
                self.tree2.column("记忆指数", width=10)
                self.tree2.column("记忆状态", width=10)

                # 将Treeview放置在窗口中，使用grid布局
                self.tree.grid(row=0, column=4, sticky="nsew")
                # 将Treeview放置在窗口中，使用grid布局
                self.tree2.grid(row=2, column=4, sticky="nsew")

                # 设置行和列的权重，使得Treeview可以随窗口的大小变化而调整
                self.tree.grid_rowconfigure(0, weight=1)
                self.tree.grid_columnconfigure(0, weight=1)
                self.tree2.grid_rowconfigure(0, weight=1)
                self.tree2.grid_columnconfigure(0, weight=1)

                self.load_treeview_data(self.tree2_list[role], "GameSaves/Deduction_infos_base.json", role)
                self.load_treeview_data(self.tree_list[role], "GameSaves/Deduction_infos_new.json", role)

                # 添加示例数据
                # self.add_inference2public("玩家1", "关于X的信息", "关于X的信息")
                if role == "DiceBot":
                    # self.add_inference2self("xxx", "xxx的可能性", 0, role)
                    pass
                # self.add_inference("玩家2", "关于Y的信息", 5, "√")
            # 配置可调整大小的框架
            # 绑定关闭事件
        self.new_window.protocol("WM_DELETE_WINDOW", self.on_closing_new_window_close)
        Is_Opened = True
        self.new_window_button = tk.Button(root, text="已开启！", background="red", command=self.open_new_window)
        self.new_window_button.grid(row=3, column=1, padx=10, pady=10, sticky="nsew")

    # update
    def update_map(self):
        global frame_Map
        global role_Chart_at_name
        self.time_label2.config(text=self.time_log.get("1.0", tk.END).strip())
        for _avatar in self.role_entries:
            if _avatar not in self.draggable_items:
                radius = 0.08
                x = 100
                y = 50
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    with open(self.role_avatar_paths[_avatar], "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_new_map[_avatar]= photo

                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[
                                         _avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"

                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]

                        current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         label=label_text,
                                                                         label2=label_text2, type="image_animate",
                                                                         frame=frame_Map)

                        self.draggable_items[_avatar] = current_frame_map[frame_Map]
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        frame_Map += 1
                    else:
                        draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, label=label_text,
                                                            label2=label_text2, type='image')
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        self.draggable_items[_avatar] = draggable_image
                else:
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[
                                         _avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    if _avatar in self.role_values_entry:
                        label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                    else:
                        label_text2 = f"H{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['HP'])} S{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['SAN'])} M{str(role_Chart_at_name[_avatar.split('NPC_name')[0]]['MOV'])}"

                    draggable_image = DraggableItem(self.canvas, x, y, 50, 50, fill='', outline='black',
                                                    label=label_text, label2=label_text2,
                                                    type="text")
                    y += 100
                    self.draggable_items[_avatar] = draggable_image
            if _avatar == "DiceBot":
                pass
            else:
                if "NPC_name" in _avatar:
                    if _avatar.split("NPC_name")[1]:
                        name_ = _avatar.split("NPC_name")[1]
                    else:
                        name_ = "NPC"
                    label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                else:
                    label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                if "===状态===" in self.role_values_entry[_avatar].get("1.0", tk.END):
                    status_list = self.role_values_entry[_avatar].get("1.0", tk.END).split("===状态===")[1].split("===")[0].split("\n")
                    for s in status_list:
                        if s.strip() != "":
                            label_text += " †" +s
                radius = 0.08
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        photo = frames_map[frame_Map][0]
                    else:
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        self.image_references_new_map[_avatar]= photo
                else:
                    photo = ""
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    self.draggable_items[_avatar].config(label=label_text, label2=label_text2, image=photo)
                else:
                    self.draggable_items[_avatar].config(label=label_text, label2=label_text2, image=photo)
        self.canvas.after(500, self.update_map)

    # 地图新窗口
    def open_new_window_map(self):
        # 启用内存监控
        root2 = tk.Tk()
        self.app2 = MemoryMonitorApp(root2)
        root2.protocol("WM_DELETE_WINDOW", self.app2.on_closing)

        global frame_Map
        new_window = tk.Toplevel(self.new_window)
        new_window.title("简易地图 - 过长运行可能闪退，注意右键LOG保存")

        self.image_references = []  # Add this list attribute to store references to images

        text = self.time_log.get("1.0", tk.END).strip()
        label = tk.Label(new_window,
                         text="地图即时使用，关闭即销毁: [右键]绘图/副本 | [右键角色/无图则❤]载入战斗图像 | [右键DiceBot]载入指示物 | [右键战斗图像]销毁 | [单击标签/❤]编辑 | [中键拖拽标签]缩放(仅限矩形和圆)")
        label.pack()

        self.time_label2 = tk.Label(new_window,
                          text=text)
        self.time_label2.pack()
        # 创建 Canvas 组件
        self.canvas = tk.Canvas(new_window, width=400, height=400, bg="white")
        self.canvas.pack(fill=tk.BOTH, expand=True)

        if os.path.exists('GameSaves/canvas_state.json'):
            # saver = CanvasSaver(self.canvas)
            # saver.load_canvas_state('GameSaves/canvas_state.json')
            # print("发现了保存State，读取旧地图...")
            pass
        else:
            print("无保存State，创建新地图...")

            # 记录鼠标位置
            self.start_x = None
            self.start_y = None

            # 绑定鼠标事件
            self.canvas.bind("<B3-Motion>", self.draw)
            self.canvas.bind("<Button-3>", self.set_start_point)

            # self.canvas.bind("<B1-Motion>", self.erase)
            # self.canvas.bind("<Button-1>", self.set_erase_point)

            self.draggable_items = {}
            radius = 0.08
            x = 100
            y = 50
            divide_col = int(len(self.role_entries) / 8)
            for _avatar in self.role_entries:
                if _avatar in self.role_avatar_paths and os.path.exists(self.role_avatar_paths[_avatar]):
                    with open(self.role_avatar_paths[_avatar], "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * radius), int(height * radius)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image

                    # Add label below the image
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"

                    # Bind label's movement with image
                    # label_below_image_canvas = self.canvas.create_window(x-50, y+60, window=label_below_image, anchor=tk.NW)
                    _, extension = os.path.splitext(self.role_avatar_paths[_avatar])
                    if extension == ".gif" or extension == ".GIF":
                        image = Image.open(self.role_avatar_paths[_avatar])
                        width, height = image.size
                        frames_map[frame_Map] = [
                            ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                            for frame
                            in ImageSequence.Iterator(image)]
                        # 显示 GIF 图片的第一帧
                        if _avatar == "DiceBot":
                            current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         type="DiceBotImage_animate",
                                                                         frame=frame_Map)
                        else:
                            current_frame_map[frame_Map] = DraggableItem(self.canvas, x, y, 10, 10,
                                                                         image=frames_map[frame_Map][0],
                                                                         label=label_text,
                                                                         label2=label_text2, type="image_animate",
                                                                         frame=frame_Map)

                        self.draggable_items[_avatar] = current_frame_map[frame_Map]
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        frame_Map += 1
                    else:
                        if _avatar == "DiceBot":
                            draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, type='DiceBotImage')
                        else:
                            draggable_image = DraggableItem(self.canvas, x, y, 10, 10, image=photo, label=label_text,
                                                            label2=label_text2, type='image')
                        y += 100
                        if len(self.draggable_items) != 0 and len(self.draggable_items) % 7 == 0:
                            y = 50
                            x += 50
                        self.draggable_items[_avatar] = draggable_image
                else:
                    if "NPC_name" in _avatar:
                        if _avatar.split("NPC_name")[1]:
                            name_ = _avatar.split("NPC_name")[1]
                        else:
                            name_ = "NPC"
                        label_text = name_ + "(" + "NPC" + ")"  # You can replace this with whatever text you want
                    else:
                        label_text = self.role_entries_name[_avatar] + "(" + _avatar + ")"  # You can replace this with whatever text you want
                    label_text2 = f"H{self.role_values_entry[_avatar].get('2.0', '3.0').split('/')[0].strip()} S{self.role_values_entry[_avatar].get('1.0', '2.0').split('/')[0].strip()} M{self.role_values_entry[_avatar].get('4.0', '5.0').split('/')[0].strip()}"
                    # Bind label's movement with image
                    # label_below_image_canvas = self.canvas.create_window(x-50, y+60, window=label_below_image, anchor=tk.NW)
                    draggable_image = DraggableItem(self.canvas, x, y, 50, 50, fill='', outline='black',
                                                    label=label_text, label2=label_text2,
                                                    type="text")
                    y += 100
                    self.draggable_items[_avatar] = draggable_image
            # Create draggable rectangle
            draggable_rectangle = DraggableItem(self.canvas, 150, 50, 100, 80, fill='', outline='black', label='标签',
                                                type='rectangle')
            draggable_rectangle = DraggableItem(self.canvas, 150, 100, 100, 100, fill='', outline='black', label='标签',
                                                type='circle')
            draggable_rectangle = DraggableItem(self.canvas, 150, 150, 100, 80, fill='', outline='black', label='标签',
                                                type='oval')
            draggable_rectangle = DraggableItem(self.canvas, 150, 200, 100, 80, fill='', outline='black', label='标签',
                                                type='polygon3')
            draggable_rectangle = DraggableItem(self.canvas, 150, 250, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon6')
            draggable_rectangle = DraggableItem(self.canvas, 150, 300, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon8')
            draggable_rectangle = DraggableItem(self.canvas, 150, 350, 50, 50, fill='', outline='black', label='标签',
                                                type='polygon5')
            draggable_rectangle = DraggableItem(self.canvas, 150, 400, 50, 50, fill='', outline='black', label='标签',
                                                type='polygonStar')
            # draggable_rectangle = DraggableItem(self.canvas, 150, 150, 100, 80, fill='white', outline='black', label='text',
            # type='line')
            draggable_rectangle = DraggableItem(self.canvas, 150, 450, 50, 50, fill='', outline='black', label='标签',
                                                type='text')
        # 绑定关闭事件
        new_window.protocol("WM_DELETE_WINDOW", self.on_close_map)
        self.new_window_map = new_window
        self.canvas.after(500, self.update_map)
        root2.mainloop()

    def on_close_map(self):
        #if messagebox.askokcancel("储存进度？", "要保存地图State吗？"):
            #saver = CanvasSaver(self.canvas)
            # Save canvas state to a JSON file
            #saver.save_canvas_state('GameSaves/canvas_state.json')
        #else:
            #if os.path.exists('GameSaves/canvas_state.json'):
                #os.remove('GameSaves/canvas_state.json')
        self.canvas.delete("all")
        self.draggable_items.clear()
        self.image_references.clear()
        self.new_window_map.destroy()
        self.app2.on_closing()

    def save_settings(self):
        global bot_personality_by_name
        # 保存小窗内容:
        with open("GameSaves/whisper_data.json", "w", encoding='utf-8') as file:
            json.dump(self.whisper_data, file, indent=4, ensure_ascii=False)
        # 保存一轮内丢失的总SAN值:
        with open("GameSaves/san_loss.json", "w", encoding='utf-8') as file:
            json.dump(self.SAN, file, indent=4, ensure_ascii=False)
        # 保存Weather FX
        with open("GameSaves/weather_FX_by_name.json", "w", encoding='utf-8') as file:
            json.dump(self.weather_FX_items, file, indent=4, ensure_ascii=False)
        # 保存初始化状态icon注册
        with open('AppSettings/status_icon_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.status_icon, file, indent=4,ensure_ascii=False)
        # 保存初始化物品栏
        with open('GameSaves/item_settings_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_items, file, indent=4,ensure_ascii=False)
        # 将角色luck统计保存到JSON文件
        with open('GameSaves/skill_menu_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_skill_menu, file, indent=4,ensure_ascii=False)
        # 将角色luck统计保存到JSON文件
        with open('Bots/luck_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.luck_by_name, file, indent=4,ensure_ascii=False)
        # 将角色codename保存到JSON文件
        with open('AppSettings/codename_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.codename_by_name, file, indent=4,ensure_ascii=False)
        # 将头像路径保存到JSON文件
        with open('AppSettings/avatar_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_avatar_paths, file, indent=4,ensure_ascii=False)
        # 将状态Icon路径保存到JSON文件
        with open('GameSaves/icon_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_Icon_paths, file, indent=4,ensure_ascii=False)
        # 将姓名牌路径保存到JSON文件
        with open('AppSettings/name_settings.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_entries_name, file, indent=4,ensure_ascii=False)
        # 将角色简卡路径保存到JSON文件
        with open('AppSettings/infoCanvas_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.infoCanvas_data, file, indent=4,ensure_ascii=False)
        # 将差分目录路径保存到JSON文件
        with open('AppSettings/avatar_dir_path.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_dir_path, file, indent=4,ensure_ascii=False)
        with open('AppSettings/infoCanvas_data_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.infoCanvas_data_by_name, file, indent=4,ensure_ascii=False)
        # 将角色可变数值保存到JSON文件
        with open('GameSaves/health_data.json', 'w', encoding='utf-8') as file:
            json.dump(self.health_data, file, indent=4,ensure_ascii=False)
        with open('GameSaves/health_data_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(self.health_data_by_name, file, indent=4,ensure_ascii=False)
        # 尝试保存自定义角色数值信息
        for role in self.roles:
            self.role_values_tags_text[role] = self.role_values_entry[role].get("1.0", tk.END).strip()
        with open('GameSaves/pl_info.json', 'w', encoding='utf-8') as file:
            json.dump(self.role_values_tags_text, file,indent=4, ensure_ascii=False)
        # 尝试保存地点时间天气信息
        with open('GameSaves/env_info.json', 'w', encoding='utf-8') as file:
            info = self.time_log.get("1.0", tk.END).strip()
            info = info.split("【时间】")[1]
            env["Date"] = info.split("【日期】")[1]
            env["Time"] = info.split("【地点】")[0]
            info = info.split("【地点】")[1]
            env["Place"] = info.split("【天气】")[0]
            info = info.split("【天气】")[1]
            env["Weather"] = info.split("【日期】")[0]
            json.dump(env, file, indent=4,ensure_ascii=False)
        # 保存自定义角色数值信息
        with open('GameSaves/pl_Chart.json', 'w', encoding='utf-8') as file:
            json.dump(role_Chart, file, indent=4,ensure_ascii=False)
        with open('Bots/bot_personality_by_name.json', 'w', encoding='utf-8') as file:
            json.dump(bot_personality_by_name, file,indent=4, ensure_ascii=False)
        # 保存自定义角色数值信息
        with open('GameSaves/PL_Chart_Save.txt', 'w', encoding='utf-8') as txt_file:
            for role, skills in role_Chart.items():
                txt_file.write(f"【{role}】-{self.role_entries_name[role]}\n.st")
                for skill, value in skills.items():
                    if skill == "_AvatarPath":  # or ("#" in skill) or (skill == "DB")
                        pass
                    else:
                        txt_file.write(f"{skill}{value} ")
                txt_file.write("\n\n\n")
        # 按姓名牌保存自定义角色数值信息
        self.save_role_skill_at_name()
        print("设置已保存！")

    def save_role_skill_at_name(self):
        global role_Chart_at_name
        with open('GameSaves/pl_Chart_at_name.json', 'w', encoding='utf-8') as file:
            dic = role_Chart_at_name.copy()
            for role, skills in role_Chart.items():
                dicSkill = {}
                for skill, value in skills.items():
                    dicSkill[skill] = value
                dicSkill["_AvatarPath"] = ""
                if role in self.role_avatar_paths:
                    # 保存头像路径
                    dicSkill["_AvatarPath"] = self.role_avatar_paths[role]
                if "PL " not in self.role_entries_name[role]:
                    dic[self.role_entries_name[role]] = dicSkill.copy()
            json.dump(dic, file, indent=4,ensure_ascii=False)

    def save_role_count(self):
        # 保存角色数量到配置文件
        config = configparser.ConfigParser()
        config['Settings'] = {'RoleCount': str(self.role_count)}
        config['Path'] = {'SavePath': str(self.last_save_path)}
        #print(self.last_save_path)
        with open('AppSettings/config.ini', 'w') as configfile:
            config.write(configfile)

    def quickSave(self):
        global log_file_last_name
        # 退出时quicksave
        timestamp = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
        # datestamp = datetime.now().strftime("%Y-%m-%d")
        filename = f"QuickSaves/{log_file_last_name}/{log_file_last_name}.QuickSave_{timestamp}.txt"
        create_folder(f"QuickSaves/{log_file_last_name}")
        self.last_save_path = filename
        self.search_and_delete_insert_symbol()
        chat_log_content = self.chat_log.get("1.0", tk.END)
        with open(filename, "w", encoding='utf-8') as file:
            file.write(chat_log_content)
        self.save_settings()

    def on_closing(self):
        # 在关闭窗口前保存设置
        self.quickSave()
        # 退出时保存当前角色数量
        self.save_role_count()
        self.root.destroy()

class MemoryMonitorApp:
    def __init__(self, root):
        self.root = root
        self.already_showed = False
        #self.ChatApp = chat_app_instance
        self.root.title("Memory Monitor")
        self.label = tk.Label(root, text=f"当前内存使用情况：")
        self.label.grid(row=0, column=0, sticky="nsew")
        self.memory_label = tk.Label(root, text="")
        self.memory_label.grid(row=1, column=0, sticky="e")
        self.warning_text = tk.Label(root, text=f"系统负荷过大！", fg="red")
        self.max_memory = self.get_total_memory()
        self.threshold_percentage = 0.8
        self.threshold = int(round(self.max_memory * self.threshold_percentage * 1024, 0)) # 设置内存使用警告的阈值，单位为MB * 1024
        self.check_interval = 1  # 检查内存使用的时间间隔，单位为秒

        self.running = True
        self.update_memory_usage()

    def get_total_memory(self):
        # 获取系统的虚拟内存信息
        virtual_memory = psutil.virtual_memory()
        # 获取总内存（以字节为单位）
        total_memory = virtual_memory.total
        # 将字节转换为GB
        total_memory_gb = total_memory / (1024 ** 3)
        return total_memory_gb

    def update_memory_usage(self):
        if self.running:
            # 获取当前进程的内存使用情况
            process = psutil.Process()
            memory_info = process.memory_info()
            memory_usage_mb = memory_info.rss / 1024 / 1024  # 将内存使用量转换为MB
            if memory_usage_mb >= 1024:
                self.memory_label.config(text=f"{memory_usage_mb/1024:.2f} GB/{self.max_memory:.2f} GB")
            else:
                self.memory_label.config(text=f"{memory_usage_mb:.2f} MB/{self.max_memory:.2f} GB")

            # 如果内存使用超过阈值，弹出警告
            if memory_usage_mb > self.threshold and self.already_showed == False:
                #self.ChatApp.quickSave()
                if self.threshold >= 1024:
                    messagebox.showwarning("内存警告", f"当前内存使用已经超过 {self.threshold/1024:.2f} GB! 请及时保存LOG！")
                else:
                    messagebox.showwarning("内存警告", f"当前内存使用已经超过 {self.threshold} MB! 请及时保存LOG！")
                self.warning_text.grid(row=2, column=0, sticky="nsew")
                self.already_showed = True
            elif self.already_showed == True:
                self.warning_text.grid(row=2, column=0, sticky="nsew")
            else:
                #self.already_showed = False
                self.warning_text.grid_forget()
            # 使用线程来定期更新内存使用情况
            threading.Timer(self.check_interval, self.update_memory_usage).start()

    def on_closing(self):
        self.running = False
        self.root.destroy()

class TRPGModule:
    def __init__(self, chat_app_instance, root):
        self.random_seed = None
        self.ChatApp = chat_app_instance
        self.root = root
        adv_comment = ""

    def skill_upgrade(self, info_, skill_name, role):
        if "NPC_name" in role:
            return ""
        upgrade = ""
        if "None" not in skill_name and "教育" not in skill_name and "魅力" not in skill_name and "力量" not in skill_name and "敏捷" not in skill_name and "外貌" not in skill_name and "智力" not in skill_name and "体质" not in skill_name and "灵感" not in skill_name and "意志" not in skill_name and "体型" not in skill_name and "信用" not in skill_name and "幸运" not in skill_name and "MOV" not in skill_name and "HP" not in skill_name and "MP" not in skill_name and "SAN" not in skill_name and "克苏鲁" not in skill_name and (
                f".st{skill_name}" not in self.ChatApp.role_values_entry[role].get("1.0",
                                                                                   tk.END).strip()) and skill_name != "" and "DB" not in skill_name:  # 成长检定
            # 执行d100掷骰
            rolls = [random.randint(1, 100) for _ in range(1)]
            result = sum(rolls)
            if result >= info_ or result >= 96:
                # 执行d10掷骰
                rolls = [random.randint(1, 10) for _ in range(1)]
                result2 = sum(rolls)
                upgrade = "[成长检定]【" + skill_name + "】技能获得了成长(1D100=" + str(result) + "/" + str(info_) + "):D10=" + str(
                    result2)
                result3 = role_Chart[role][skill_name] + result2
                if result3 - result2 < 90 and result3 >= 90:
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的技能[{skill_name}]首次成长至精通（90%+）！\n\n')
                    self.ChatApp.insert_roll_to_PC("san+2D6", role, send=True)
                self.ChatApp.role_values_entry[role].insert(tk.END, f'\n.st{skill_name}{str(result3)}')
            else:
                upgrade = "[成长检定]【" + skill_name + "】技能的成长检定(1D100=" + str(result) + "/" + str(info_) + ")败北了..."
        return upgrade

    def skill_comment(self, role=None, skill=None):
        if skill and role:
            if "NPC_name" not in role:
                _Critical_Success_list = []
                _Extreme_Success_list = []
                _Hard_Success_list = []
                _Success_list = []
                _Failure_list = []
                _Fumble_list = []
                if skill in bot_personality["Critical_Success"] and role in bot_personality["Critical_Success"]:
                    _Critical_Success_list = bot_personality["Critical_Success"][skill] + \
                                             bot_personality["Critical_Success"][role]
                else:
                    bot_personality["Critical_Success"][skill] = bot_personality["Critical_Success"]["通用"]
                    bot_personality["Critical_Success"][role] = bot_personality["Critical_Success"]["通用"]
                    _Critical_Success_list = bot_personality["Critical_Success"][skill] + \
                                             bot_personality["Critical_Success"][role]
                if skill in bot_personality["Extreme_Success"] and role in bot_personality["Extreme_Success"]:
                    _Extreme_Success_list = bot_personality["Extreme_Success"][skill] + \
                                            bot_personality["Extreme_Success"][role]
                else:
                    bot_personality["Extreme_Success"][skill] = bot_personality["Extreme_Success"]["通用"]
                    bot_personality["Extreme_Success"][role] = bot_personality["Extreme_Success"]["通用"]
                    _Extreme_Success_list = bot_personality["Extreme_Success"][skill] + \
                                            bot_personality["Extreme_Success"][role]
                if skill in bot_personality["Hard_Success"] and role in bot_personality["Hard_Success"]:
                    _Hard_Success_list = bot_personality["Hard_Success"][skill] + bot_personality["Hard_Success"][role]
                else:
                    bot_personality["Hard_Success"][skill] = bot_personality["Hard_Success"]["通用"]
                    bot_personality["Hard_Success"][role] = bot_personality["Hard_Success"]["通用"]
                    _Hard_Success_list = bot_personality["Hard_Success"][skill] + bot_personality["Hard_Success"][
                        role]
                if skill in bot_personality["Success"] and role in bot_personality["Success"]:
                    _Success_list = bot_personality["Success"][skill] + bot_personality["Success"][role]
                else:
                    bot_personality["Success"][skill] = bot_personality["Success"]["通用"]
                    bot_personality["Success"][role] = bot_personality["Success"]["通用"]
                    _Success_list = bot_personality["Success"][skill] + bot_personality["Success"][role]
                if skill in bot_personality["Failure"] and role in bot_personality["Failure"]:
                    _Failure_list = bot_personality["Failure"][skill] + bot_personality["Failure"][role]
                else:
                    bot_personality["Failure"][skill] = bot_personality["Failure"]["通用"]
                    bot_personality["Failure"][role] = bot_personality["Failure"]["通用"]
                    _Failure_list = bot_personality["Failure"][skill] + bot_personality["Failure"][role]
                if skill in bot_personality["Fumble"] and role in bot_personality["Fumble"]:
                    _Fumble_list = bot_personality["Fumble"][skill] + bot_personality["Fumble"][role]
                else:
                    bot_personality["Fumble"][skill] = bot_personality["Fumble"]["通用"]
                    bot_personality["Fumble"][role] = bot_personality["Fumble"]["通用"]
                    _Fumble_list = bot_personality["Fumble"][skill] + bot_personality["Fumble"][role]
                self.Critical_Success = random.choice(_Critical_Success_list)
                self.Extreme_Success = random.choice(_Extreme_Success_list)
                self.Hard_Success = random.choice(_Hard_Success_list)
                self.Success = random.choice(_Success_list)
                self.Failure = random.choice(_Failure_list)
                self.Fumble = random.choice(_Fumble_list)
        else:
            if skill:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"][skill])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"][skill])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"][skill])
                self.Success = random.choice(bot_personality["Success"][skill])
                self.Failure = random.choice(bot_personality["Failure"][skill])
                self.Fumble = random.choice(bot_personality["Fumble"][skill])
            elif role and "NPC_name" not in role:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"][role])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"][role])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"][role])
                self.Success = random.choice(bot_personality["Success"][role])
                self.Failure = random.choice(bot_personality["Failure"][role])
                self.Fumble = random.choice(bot_personality["Fumble"][role])
            else:
                self.Critical_Success = random.choice(bot_personality["Critical_Success"]["通用"])
                self.Extreme_Success = random.choice(bot_personality["Extreme_Success"]["通用"])
                self.Hard_Success = random.choice(bot_personality["Hard_Success"]["通用"])
                self.Success = random.choice(bot_personality["Success"]["通用"])
                self.Failure = random.choice(bot_personality["Failure"]["通用"])
                self.Fumble = random.choice(bot_personality["Fumble"]["通用"])
        self.Fumble_SKill = bot_personality["Fumble_at_96_SKill_Level"]
        self.Critical_Success_SKill = bot_personality["Critical_at_5_SKill_Level"]

    def skill_check(self, info_, result):
        if result <= 5 and info_ >= Critical_Success_SKill:
            compare = "<"
            comment = self.Critical_Success
        elif result == 1:
            compare = "<"
            comment = self.Critical_Success
        elif result <= info_ // 5:
            compare = "<"
            comment = self.Extreme_Success
        elif result <= info_ // 2:
            compare = "<"
            comment = self.Hard_Success
        elif result <= info_:
            compare = "<"
            comment = self.Success
        elif result >= 96 and info_ < Fumble_SKill:
            compare = ">"
            comment = self.Fumble
        elif result == 100:
            compare = ">"
            comment = self.Fumble
        else:
            compare = ">"
            comment = self.Failure
        return comment

    def cal_advantage(self, result, advantage):
        global adv_comment
        adv_comment_1 = ""
        adv_comment_2 = ""
        if advantage is not None:
            list = []
            # 获取个位
            ones_place = result % 10
            # 获取十位
            tens_place = (result // 10) % 10
            list.append(tens_place)
            if "+" in advantage:
                for a in advantage["+"]:
                    if a == 10:
                        a = 0
                    list.append(a)
                # self.ChatApp.chat_log.insert(tk.END, f"\n优势骰：{list} = {max(list)}")
                adv_comment_1 = f"具备优势:{list}={min(list)}"
                result = ones_place + min(list) * 10
            list = [tens_place]
            if "-" in advantage:
                for a in advantage["-"]:
                    if a == 10:
                        a = 0
                    list.append(a)
                # self.ChatApp.chat_log.insert(tk.END, f"\n劣势骰：{list} = {min(list)}")
                adv_comment_2 = f"造成劣势:{list}={max(list)}"
                result = ones_place + max(list) * 10
            adv_comment = adv_comment_1 + adv_comment_2
        # if result > 100:
        # result = 100
        return result, adv_comment

    def san_check_fail(self, role):
        _list = ["猛的一跳 — 虎躯一震，使得调查员从身上掉落了什么东西。(眼镜，手电，枪，书籍等.)", "因恐惧而大叫 — 哭泣，尖叫，吸引别人的注意，说一些不恰当的话。", "不由自主的动作 — 可以是一次不成功/被阻止的动作。捂上耳朵、双眼，将方向盘转向危险的一侧，在恐惧中放弃挣扎，畏缩着发抖。", "不由自主的战斗/攻击/破坏行为 — 可以是一次不成功/被阻止的暴力行为。假如在战斗轮中，那么在本回合中调查员的行动可以由守秘人来决定。例如说：破坏证物，用拳头去殴打别人，扣下扳机，躲到别人的身后寻求掩护。", "呆立不动 — 惊异的盯着，却没有做出任何动作，僵持一定时间，可以被打断。", "躲藏、逃离或求助 — 可以是一次不成功/被阻止的尝试。尝试靠近认为安全的人，事物或空间。例如，蜷缩在角落，靠近重要之人，握紧重要之物，试图远离恐惧源", "超自然体验 — 可以是一瞬间的幻觉、幻听，混乱的思绪使调查员无法思考，无法处理当前的情况。"]
        self.ChatApp.role_entries[role].insert(tk.END, "不由自主/KP控制行为：" + random.choice(_list) +"\n\n")

    def roll(self, expression, role=None, allin=False):
        global date
        global time
        global place
        global weather
        HP_MP_check = ""
        fuhao = ""
        combine_infos = {}
        if self.random_seed is not None:
            random.seed(self.random_seed)
        info = None
        sc_success = ""
        sc_fail = ""
        skill_name = ""
        advantage = {}
        multi_num = 1
        self.skill_comment(role, expression)
        try:
            pattern = re.compile(r'[\u4e00-\u9fa5]')
            pattern_user = re.compile(r'([\u4e00-\u9fa5a-zA-Z]+)(\d+)')
            pattern_advantage = re.compile(r'^[+\-*/]')
            pattern_combine = re.compile(r'[\u4e00-\u9fa5a-zA-Z]+[\u4e00-\u9fa5a-zA-Z]')
            part_eng = pattern_user.findall(expression)
            part_combine = pattern_combine.findall(expression)
            # print(part_eng)
            if "HP" in expression.upper() or "MP" in expression.upper() or "SAN" in expression.upper() or "MOV" in expression.upper():
                print("HP/MP/SAN/MOV变化")
                if "HP" in expression.upper():
                    HP_MP_check = "HP"
                elif "MP" in expression.upper():
                    HP_MP_check = "MP"
                elif "SAN" in expression.upper():
                    HP_MP_check = "SAN"
                elif "MOV" in expression.upper():
                    HP_MP_check = "MOV"
                else:
                    HP_MP_check = ""
                expression = expression.upper().replace("HP", "").replace("MP", "").replace("SAN", "").replace("MOV", "")
            if pattern_combine.match(expression) and len(part_combine) > 1:
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                print("联合掷骰")  # 意志+斗殴+潜行
                # print(part_combine)
                for a in part_combine:
                    combine_infos[a] = role_Chart_detail[a]
                # print(role_Chart_detail)
                print(combine_infos)
                expression = "COMBINE CHECK"
            if pattern_advantage.match(expression) and HP_MP_check == "":
                print("优劣势掷骰")  # ++xxx
                expression_slice = expression
                matches = []
                while pattern_advantage.match(expression_slice):
                    matches.append(expression[0])
                    expression_slice = expression_slice[1:]
                # print(matches)
                for operator in matches:
                    num_operators = matches.count(operator)
                    roll_result = random.randint(1, 10)
                    # 如果运算符在字典中，将结果添加到相应的列表
                    if operator in advantage:
                        advantage[operator].append(roll_result)
                    else:
                        advantage[operator] = [roll_result]
                    expression = expression[1:]
                    print(expression)
                    print(advantage)
                # print(advantage)

            if ("sc" or "SC" or ".sc" or "。sc") in expression:
                print("SAN CHECK")  # sc1/1d5
                self.ChatApp.role_entries[role].insert("1.0", "现实认知检定：")
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                info = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                if info == 0:
                    info = role_Chart_detail.get("POW")
                parts_ = expression.split('sc')
                if parts_[1] == "":
                    expression = "1d100"
                else:
                    parts_ = parts_[1].split('/')
                    # print(parts_)
                    sc_success = parts_[0].replace(" ", "")
                    sc_fail = parts_[1].replace(" ", "")
                    expression = "SAN CHECK"

            elif any(word in expression for word in ["san", "San", "SAN"]) and not any(
                    op in expression for op in ["+", "-", "*", "/"]):
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                info = role_Chart_detail.get("SAN")  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                if info == 0:
                    info = role_Chart_detail.get("POW")
                expression = "1d100"

            # elif expression == "COMBINE CHECK": # 对每个技能都掷骰的方案
            #     for a in combine_infos:
            #         expression = a
            #         info = int(combine_infos[a])
            #         if "困难" in expression or "极难" in expression:
            #             print("困难极难")
            #             print(expression)
            #             parts_ = expression.split('难')
            #             skill_name = parts_[1]
            #             if parts_[0] == "极":
            #                 info = int(combine_infos[a] / 5)
            #             if parts_[0] == "困":
            #                 info = int(combine_infos[a] / 2)
            #         # 执行掷骰
            #         rolls = [random.randint(1, 100) for _ in range(1)]
            #         result = sum(rolls)
            #         result, adv_comment = self.cal_advantage(result, advantage)
            #         if result <= 5 and info >= Critical_Success_SKill:
            #             compare = "<"
            #             comment = self.Critical_Success
            #             upgrade = self.skill_upgrade(0, skill_name, role)
            #         elif result == 1:
            #             compare = "<"
            #             comment = self.Critical_Success
            #             upgrade = self.skill_upgrade(0, skill_name, role)
            #         elif result <= info // 5:
            #             compare = "<"
            #             comment = self.Extreme_Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result <= info // 2:
            #             compare = "<"
            #             comment = self.Hard_Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result <= info:
            #             compare = "<"
            #             comment = self.Success
            #             upgrade = self.skill_upgrade(info, skill_name, role)
            #         elif result >= 96 and info < Fumble_SKill:
            #             compare = ">"
            #             comment = self.Fumble
            #             upgrade = ""
            #         elif result == 100:
            #             compare = ">"
            #             comment = self.Fumble
            #             upgrade = ""
            #         else:
            #             compare = ">"
            #             comment = self.Failure
            #             upgrade = ""
            #             # 执行算式
            #         print(f"{result}/{info}：{comment}\n\n{upgrade}")

            elif expression == "COMBINE CHECK":
                rolls = [random.randint(1, 100) for _ in range(1)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                infos = []
                upgrades = []
                comments = []

                time_info = self.ChatApp.time_log.get("1.0", tk.END).strip()
                time_info = time_info.split("【时间】")[1]
                date = time_info.split("【日期】")[1]
                time = time_info.split("【地点】")[0]
                time_info = time_info.split("【地点】")[1]
                place = time_info.split("【天气】")[0]
                time_info = time_info.split("【天气】")[1]
                weather = time_info.split("【日期】")[0]

                # 自动计算时间
                for a in combine_infos:
                    for timer, timerlist in time_skill.items():
                        for skillname in timerlist:
                            if a == skillname:
                                if allin:
                                    if (timer == "time_1s") or (timer == "time_3s") or (timer == "time_1min"):
                                        self.move_time_forward(timer)
                                    elif timer == "time_5min":
                                        self.move_time_forward("time_1min")
                                    elif timer == "time_10min":
                                        self.move_time_forward("time_5min")
                                    elif timer == "time_30min":
                                        self.move_time_forward("time_10min")
                                    elif timer == "time_1h":
                                        self.move_time_forward("time_30min")
                                    elif timer == "time_3h":
                                        self.move_time_forward("time_1h")
                                    elif timer == "time_12h":
                                        self.move_time_forward("time_3h")
                                    elif timer == "time_1d":
                                        self.move_time_forward("time_12h")
                                    elif timer == "time_1w":
                                        self.move_time_forward("time_1d")
                                    else:
                                        self.move_time_forward("time_5min")
                                else:
                                    self.move_time_forward(timer)
                    expression = a
                    info = combine_infos[a]
                    skill_name = a
                    if "困难" in expression or "极难" in expression:
                        print("困难极难")
                        print(expression)
                        parts_ = expression.split('难')
                        skill_name = parts_[1]
                        if parts_[0] == "极":
                            info = int(combine_infos[a] / 5)
                        if parts_[0] == "困":
                            info = int(combine_infos[a] / 2)
                    infos.append(info)
                    # 执行掷骰
                    if result <= 5 and info >= Critical_Success_SKill:
                        compare = "<"
                        comment = "大成功！！"
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result == 1:
                        compare = "<"
                        comment = "大成功！！"
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result <= info // 5:
                        compare = "<"
                        comment = "极难成功！"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result <= info // 2:
                        compare = "<"
                        comment = "困难成功"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result <= info:
                        compare = "<"
                        comment = "成功"
                        upgrade = self.skill_upgrade(info, skill_name, role)
                    elif result >= 96 and info < Fumble_SKill:
                        compare = ">"
                        comment = "大失败！"
                        upgrade = ""
                    elif result == 100:
                        compare = ">"
                        comment = "大失败！"
                        upgrade = ""
                    else:
                        compare = ">"
                        comment = "失败"
                        upgrade = ""
                        # 执行算式
                    upgrades.append(upgrade)
                    comments.append(comment)
                    # print(f"{result}/{info}：{comment}\n\n{upgrade}")
                str_ = '\n'.join(upgrades).strip()
                return f"{result}/{infos}:{'/'.join(comments)}：{str_}"

            elif HP_MP_check == "" and (bool(pattern.search(expression)) or part_eng[0][0] != "d"):
                expression_num = 0
                print("技能检定")
                # print(part_eng[0][0])
                # print(part_eng[0][1])
                print(expression)
                if "+" in expression or "-" in expression:
                    print("补正骰")
                    if "+" in expression:
                        expression_num = expression.split("+")[1]
                        expression = expression.split("+")[0]
                    if "-" in expression:
                        expression_num = expression.split("-")[1] * (-1)
                        expression = expression.split("-")[0]
                if part_eng and part_eng[0] and part_eng[0][1] is not None:
                    print("技能检定+数值")
                    expression = part_eng[0][0]
                    info = int(part_eng[0][1])
                    skill_name = "None"

                time_info = self.ChatApp.time_log.get("1.0", tk.END).strip()
                time_info = time_info.split("【时间】")[1]
                date = time_info.split("【日期】")[1]
                time = time_info.split("【地点】")[0]
                time_info = time_info.split("【地点】")[1]
                place = time_info.split("【天气】")[0]
                time_info = time_info.split("【天气】")[1]
                weather = time_info.split("【日期】")[0]

                # 自动计算时间

                for timer, timerlist in time_skill.items():
                    for skillname in timerlist:
                        if expression == skillname:
                            if allin:
                                if (timer == "time_1s") or (timer == "time_3s") or (timer == "time_1min"):
                                    self.move_time_forward(timer)
                                elif timer == "time_5min":
                                    self.move_time_forward("time_1min")
                                elif timer == "time_10min":
                                    self.move_time_forward("time_5min")
                                elif timer == "time_30min":
                                    self.move_time_forward("time_10min")
                                elif timer == "time_1h":
                                    self.move_time_forward("time_30min")
                                elif timer == "time_3h":
                                    self.move_time_forward("time_1h")
                                elif timer == "time_12h":
                                    self.move_time_forward("time_3h")
                                elif timer == "time_1d":
                                    self.move_time_forward("time_12h")
                                elif timer == "time_1w":
                                    self.move_time_forward("time_1d")
                                else:
                                    self.move_time_forward("time_5min")
                            else:
                                self.move_time_forward(timer)
                if "NPC_name" in role:
                    role_Chart_detail = role_Chart_at_name.get(role.split("NPC_name")[0], {}).copy()
                else:
                    role_Chart_detail = role_Chart.get(role, {}).copy()  # 获取 "KP" 对应的字典，如果没有则返回空字典
                if "困难" in expression or "极难" in expression:
                    print("困难极难")
                    print(expression)
                    parts_ = expression.split('难')
                    skill_name = parts_[1]
                    if parts_[0] == "极":
                        info = int(role_Chart_detail.get(parts_[1]) / 5)
                    if parts_[0] == "困":
                        info = int(role_Chart_detail.get(parts_[1]) / 2)
                else:
                    # print(expression)
                    if info == None:
                        if skill_name == "None":
                            skill_name = "None"
                        else:
                            skill_name = expression
                        info = role_Chart_detail.get(expression)  # edu_value = sub_dict.get("EDU")  # 获取 "EDU" 对应的值
                        print("info == None")
                    # print(info)
                if str(info).isalpha():
                    info = role_Chart_detail.get(info)
                    # print(info)
                expression = "1d100"
                info += int(expression_num)
            if expression == "SAN CHECK":
                # 解析表达式
                expression = "1d100"
                parts = expression.split('d')
                num_rolls = int(parts[0])
                num_faces = int(parts[1])
                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info >= result:
                    if "d" in sc_success:
                        if "+" in sc_success or "-" in sc_success or "*" in sc_success or "/" in sc_success:
                            expression = sc_success
                            parts = expression.split('d')
                            if "+" in parts[1]:
                                fuhao = "+"
                                num_ = parts[1].split('+')[1]
                                num_faces = int(parts[1].split('+')[0])
                            elif "-" in parts[1]:
                                fuhao = "-"
                                num_ = parts[1].split('+')[1]
                                num_faces = int(parts[1].split('-')[0])
                            else:
                                fuhao = "+"
                                num_ = 0
                                num_faces = 0
                                pass
                            num_rolls = int(parts[0])
                            # 执行掷骰
                            rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                            result2 = sum(rolls)
                            result2 = eval(str(result2) + fuhao + num_)
                            if result2 == 0:
                                self.ChatApp.update_health_bar(role)
                                return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功！司空见惯！"
                            else:
                                role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                                POW = role_Chart[role].get("POW")
                                SAN = role_Chart[role].get("SAN")
                                if "#SAN" in role_Chart[role]:
                                    SAN_ = role_Chart[role].get("#SAN")
                                else:
                                    SAN_ = 100
                                self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                                self.ChatApp.role_values_entry[role].insert("1.0",
                                                                            f'{SAN}/{SAN_}:SAN\n')
                                self.ChatApp.chat_log.insert(tk.END,
                                                             f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                                self.ChatApp.update_health_bar(role)
                                return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功，扣除{result2}点SAN。"
                        else:
                            expression = sc_success
                            parts = expression.split('d')
                            num_rolls = int(parts[0])
                            num_faces = int(parts[1])
                            # 执行掷骰
                            rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                            result2 = sum(rolls)
                            if result2 == 0:
                                self.ChatApp.update_health_bar(role)
                                return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功！司空见惯！"
                            else:
                                role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                                POW = role_Chart[role].get("POW")
                                SAN = role_Chart[role].get("SAN")
                                if "#SAN" in role_Chart[role]:
                                    SAN_ = role_Chart[role].get("#SAN")
                                else:
                                    SAN_ = 100
                                self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                                self.ChatApp.role_values_entry[role].insert("1.0",
                                                                            f'{SAN}/{SAN_}:SAN\n')
                                self.ChatApp.chat_log.insert(tk.END,
                                                             f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                                self.ChatApp.update_health_bar(role)
                                return f"{result}/{info}={sc_success.upper()}={result2}：San Check成功，扣除{result2}点SAN。"
                    else:
                        result2 = int(sc_success)
                        if result2 == 0:
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={result2}：San Check成功！司空见惯！"
                        else:
                            role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                            POW = role_Chart[role].get("POW")
                            SAN = role_Chart[role].get("SAN")
                            if "#SAN" in role_Chart[role]:
                                SAN_ = role_Chart[role].get("#SAN")
                            else:
                                SAN_ = 100
                            self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                            self.ChatApp.role_values_entry[role].insert("1.0",
                                                                        f'{SAN}/{SAN_}:SAN\n')
                            self.ChatApp.chat_log.insert(tk.END,
                                                         f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={result2}：San Check成功，扣除{result2}点SAN。"
                else:
                    self.san_check_fail(role)
                    if "d" in sc_fail:
                        if "+" in sc_fail or "-" in sc_fail or "*" in sc_fail or "/" in sc_fail:
                            expression = sc_fail
                            parts = expression.split('d')
                            if "+" in parts[1]:
                                fuhao = "+"
                                num_ = parts[1].split('+')[1]
                                num_faces = int(parts[1].split('+')[0])
                            elif "-" in parts[1]:
                                fuhao = "-"
                                num_ = parts[1].split('+')[1]
                                num_faces = int(parts[1].split('-')[0])
                            else:
                                fuhao = "+"
                                num_ = "0"
                                num_faces = "0"
                                pass
                            num_rolls = int(parts[0])
                            max_san = eval(expression.replace("d", "*"))
                            # 执行掷骰
                            rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                            result2 = sum(rolls)
                            result2 = eval(str(result2) + fuhao + num_)
                        else:
                            expression = sc_fail
                            parts = expression.split('d')
                            num_rolls = int(parts[0])
                            num_faces = int(parts[1])
                            max_san = eval(expression.replace("d", "*"))
                            # 执行掷骰
                            rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                            result2 = sum(rolls)
                        if (result >= 96 and info < Fumble_SKill) or result == 100:
                            role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - max_san
                            POW = role_Chart[role].get("POW")
                            SAN = role_Chart[role].get("SAN")
                            if "#SAN" in role_Chart[role]:
                                SAN_ = role_Chart[role].get("#SAN")
                            else:
                                SAN_ = 100
                            self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                            self.ChatApp.role_values_entry[role].insert("1.0",
                                                                        f'{SAN}/{SAN_}:SAN\n')
                            self.ChatApp.chat_log.insert(tk.END,
                                                         f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除最大值{max_san}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={sc_fail.upper()}={max_san}：San Check大失败！扣除{max_san}点SAN。"
                        else:
                            role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                            POW = role_Chart[role].get("POW")
                            SAN = role_Chart[role].get("SAN")
                            if "#SAN" in role_Chart[role]:
                                SAN_ = role_Chart[role].get("#SAN")
                            else:
                                SAN_ = 100
                            self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                            self.ChatApp.role_values_entry[role].insert("1.0",
                                                                        f'{SAN}/{SAN_}:SAN\n')
                            self.ChatApp.chat_log.insert(tk.END,
                                                         f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                            self.ChatApp.update_health_bar(role)
                            return f"{result}/{info}={sc_fail.upper()}={result2}：San Check失败！扣除{result2}点SAN。"
                    else:
                        result2 = int(sc_fail)
                        role_Chart[role]["SAN"] = role_Chart[role]["SAN"] - result2
                        POW = role_Chart[role].get("POW")
                        SAN = role_Chart[role].get("SAN")
                        if "#SAN" in role_Chart[role]:
                            SAN_ = role_Chart[role].get("#SAN")
                        else:
                            SAN_ = 100
                        self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                        self.ChatApp.role_values_entry[role].insert("1.0",
                                                                    f'{SAN}/{SAN_}:SAN\n')
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[已扣除{result2}点SAN]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                        self.ChatApp.update_health_bar(role)
                        return f"{result}/{info}={result2}：San Check失败！扣除{result2}点SAN。"

            if HP_MP_check != "":
                print(role + ":" + HP_MP_check)
                fuhao = expression[0]
                expression = expression.replace(fuhao, "").lower()
                exp = expression
                if "NPC_name" in role:
                    HP = role_Chart_at_name[role.split("NPC_name")[0]].get("HP")
                    MP = role_Chart_at_name[role.split("NPC_name")[0]].get("MP")
                    SAN = role_Chart_at_name[role.split("NPC_name")[0]].get("#SAN")
                    MOV = role_Chart_at_name[role.split("NPC_name")[0]].get("MOV")
                    if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                        # if 有多个d 有多个符号
                        seen_letters = set()
                        result = 0
                        for char in expression:
                            print(char)
                            if char.isalpha():
                                if char in seen_letters:
                                    # 使用正则表达式分割中文、英文和数字
                                    parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                                    # 构建新的表达式，替换掉中文和英文
                                    num_expression = ''.join(parts)
                                    # 替换掷骰表达式
                                    num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                        str(random.randint(1, int(match.group(2)))) for _ in
                                        range(int(match.group(1)))),
                                                            num_expression)
                                    # 计算结果
                                    result += eval(num_expression)
                                seen_letters.add(char)
                        # if(只有一个d)
                        # 使用正则表达式分割中文、英文和数字
                        parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)
                        # 构建算式
                        formula_dice = ''.join(parts[0:3])
                        # 解析表达式
                        parts_ = formula_dice.split('d')
                        num_rolls = int(parts_[0])
                        num_faces = int(parts_[1])
                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result = sum(rolls)
                        formula_add = str(result) + parts[3] + parts[4]
                        result = eval(formula_add)
                    elif "d" in expression:
                        # 解析表达式
                        parts = expression.split('d')
                        num_rolls = int(parts[0])
                        num_faces = int(parts[1])

                        # 执行掷骰
                        rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                        result = sum(rolls)
                        if num_rolls == 1:
                            exp = f"{expression}"
                        else:
                            exp = f"{'+'.join(map(str, rolls))}"
                    else:
                        result = expression
                        exp = ""
                    if HP_MP_check == "HP":
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                    elif HP_MP_check == "SAN":
                        # temp_HP_MP_check = HP_MP_check
                        itm = self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                    elif HP_MP_check == "MOV":
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                    else:
                        # temp_HP_MP_check = HP_MP_check + "_"
                        itm = self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                    # if (temp_HP_MP_check in role_Chart[role]) and HP_MP_check != "MOV":
                    # if str(role_Chart[role].get(temp_HP_MP_check)) != itm:
                    # role_Chart[role][temp_HP_MP_check] = itm
                    # itm = eval(str(role_Chart[role].get(temp_HP_MP_check)) + fuhao + str(result))

                    if HP_MP_check == "HP":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "SAN":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "MOV":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[
                                           0].strip()) + fuhao + result)
                    else:
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[
                                           0].strip()) + fuhao + result)
                    if HP_MP_check == "HP":
                        self.ChatApp.role_values_entry[role].delete("2.0", "3.0")
                        self.ChatApp.role_values_entry[role].insert("2.0",
                                                                    f'{itm}/{HP}:HP\n')
                    elif HP_MP_check == "SAN":
                        self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                        self.ChatApp.role_values_entry[role].insert("1.0",
                                                                    f'{itm}/{SAN}:SAN\n')
                    elif HP_MP_check == "MOV":
                        self.ChatApp.role_values_entry[role].delete("4.0", "5.0")
                        self.ChatApp.role_values_entry[role].insert("4.0",
                                                                    f'{itm}/{MOV}:MOV\n')
                    else:
                        self.ChatApp.role_values_entry[role].delete("3.0", "4.0")
                        self.ChatApp.role_values_entry[role].insert("3.0",
                                                                    f'{itm}/{MP}:MP\n')
                    des = f"{fuhao}{exp}={result}点{HP_MP_check}".replace("-=", "减少").replace("+=", "恢复")
                    des2 = "已" + des
                    des2 = des2.replace("已+", "已恢复").replace("已-", "已减少")
                    if HP_MP_check == "HP":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("2.0", "3.0").strip()}\n\n')
                    elif HP_MP_check == "SAN":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                        self.ChatApp.SAN[role] = eval(str(self.ChatApp.SAN[role]) + "-" + fuhao + result)
                        self.ChatApp.SAN_[role] = eval(str(self.ChatApp.SAN[role]) + "-" + fuhao + result)
                        #self.ChatApp.reset_san_cal_status(role)
                        self.ChatApp.san_cal_status(role)
                    elif HP_MP_check == "MOV":
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("4.0", "5.0").strip()}\n\n')
                    else:
                        self.ChatApp.chat_log.insert(tk.END,
                                                     f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{role.split("NPC_name")[1]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("3.0", "4.0").strip()}\n\n')
                    self.ChatApp.chat_log.yview(tk.END)
                    self.ChatApp.role_entries[role].insert(tk.END, des + "。")
                    self.ChatApp.update_health_bar(role)
                    return
                HP = role_Chart[role].get("HP")
                MP = role_Chart[role].get("MP")
                SAN = role_Chart[role].get("#SAN")
                MOV = role_Chart[role].get("MOV")
                if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                    # if 有多个d 有多个符号
                    seen_letters = set()
                    result = 0
                    for char in expression:
                        print(char)
                        if char.isalpha():
                            if char in seen_letters:
                                # 使用正则表达式分割中文、英文和数字
                                parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                                # 构建新的表达式，替换掉中文和英文
                                num_expression = ''.join(parts)
                                # 替换掷骰表达式
                                num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                    str(random.randint(1, int(match.group(2)))) for _ in range(int(match.group(1)))),
                                                        num_expression)
                                # 计算结果
                                result += eval(num_expression)
                            seen_letters.add(char)
                    # if(只有一个d)
                    # 使用正则表达式分割中文、英文和数字
                    parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)
                    # 构建算式
                    formula_dice = ''.join(parts[0:3])
                    # 解析表达式
                    parts_ = formula_dice.split('d')
                    num_rolls = int(parts_[0])
                    num_faces = int(parts_[1])
                    # 执行掷骰
                    rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                    result = sum(rolls)
                    formula_add = str(result) + parts[3] + parts[4]
                    result = eval(formula_add)
                elif "d" in expression:
                    # 解析表达式
                    parts = expression.split('d')
                    num_rolls = int(parts[0])
                    num_faces = int(parts[1])

                    # 执行掷骰
                    rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                    result = sum(rolls)
                    if num_rolls == 1:
                        exp = f"{expression}"
                    else:
                        exp = f"{'+'.join(map(str, rolls))}"
                else:
                    result = expression
                    exp = ""
                if HP_MP_check == "HP":
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[0].strip()
                elif HP_MP_check == "SAN":
                    temp_HP_MP_check = HP_MP_check
                    itm = self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[0].strip()
                elif HP_MP_check == "MOV":
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[0].strip()
                else:
                    temp_HP_MP_check = HP_MP_check + "_"
                    itm = self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[0].strip()
                if (temp_HP_MP_check in role_Chart[role]) and HP_MP_check != "MOV":
                    if str(role_Chart[role].get(temp_HP_MP_check)) != itm:
                        role_Chart[role][temp_HP_MP_check] = itm
                    itm = eval(str(role_Chart[role].get(temp_HP_MP_check)) + fuhao + str(result))
                else:
                    if HP_MP_check == "HP":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("2.0", "3.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "SAN":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("1.0", "2.0").split("/")[
                                           0].strip()) + fuhao + result)
                    elif HP_MP_check == "MOV":
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("4.0", "5.0").split("/")[
                                           0].strip()) + fuhao + result)
                    else:
                        itm = eval(str(self.ChatApp.role_values_entry[role].get("3.0", "4.0").split("/")[
                                           0].strip()) + fuhao + result)
                role_Chart[role][temp_HP_MP_check] = itm
                if HP_MP_check == "HP":
                    self.ChatApp.role_values_entry[role].delete("2.0", "3.0")
                    self.ChatApp.role_values_entry[role].insert("2.0",
                                                                f'{itm}/{HP}:HP\n')
                elif HP_MP_check == "SAN":
                    self.ChatApp.role_values_entry[role].delete("1.0", "2.0")
                    self.ChatApp.role_values_entry[role].insert("1.0",
                                                                f'{itm}/{SAN}:SAN\n')
                elif HP_MP_check == "MOV":
                    self.ChatApp.role_values_entry[role].delete("4.0", "5.0")
                    self.ChatApp.role_values_entry[role].insert("4.0",
                                                                f'{itm}/{MOV}:MOV\n')
                else:
                    self.ChatApp.role_values_entry[role].delete("3.0", "4.0")
                    self.ChatApp.role_values_entry[role].insert("3.0",
                                                                f'{itm}/{MP}:MP\n')
                des = f"{fuhao}{exp}={result}点{HP_MP_check}".replace("-=", "减少").replace("+=", "恢复")
                des2 = "已" + des
                des2 = des2.replace("已+", "已恢复").replace("已-", "已减少")
                if HP_MP_check == "HP":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("2.0", "3.0").strip()}\n\n')
                elif HP_MP_check == "SAN":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("1.0", "2.0").strip()}\n\n')
                    self.ChatApp.SAN[role] = eval(str(self.ChatApp.SAN[role]) + "-" + fuhao + result)
                    self.ChatApp.SAN_[role] = eval(str(self.ChatApp.SAN[role]) + "-" + fuhao + result)
                    #self.ChatApp.reset_san_cal_status(role)
                    self.ChatApp.san_cal_status(role)
                elif HP_MP_check == "MOV":
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("4.0", "5.0").strip()}\n\n')
                else:
                    self.ChatApp.chat_log.insert(tk.END,
                                                 f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n【{self.ChatApp.role_entries_name[role]}】的状态[{des2}]：{self.ChatApp.role_values_entry[role].get("3.0", "4.0").strip()}\n\n')
                self.ChatApp.chat_log.yview(tk.END)
                self.ChatApp.role_entries[role].insert(tk.END, des + "。")
                self.ChatApp.update_health_bar(role)
                return

            if ("+" in expression) or ("-" in expression) or ("*" in expression) or ("/" in expression):
                print(expression)
                # if 有多个d 有多个符号
                seen_letters = set()
                for char in expression:
                    if char.isalpha():
                        print("multiple Ds with +/-")
                        if char in seen_letters:
                            # 使用正则表达式分割中文、英文和数字
                            parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/d()]', expression)
                            # print(parts)
                            # 构建新的表达式，替换掉中文和英文
                            num_expression = ''.join(parts)
                            # 替换掷骰表达式
                            num_expression = re.sub(r'(\d+)d(\d+)', lambda match: '+'.join(
                                str(random.randint(1, int(match.group(2)))) for _ in range(int(match.group(1)))),
                                                    num_expression)
                            # 计算结果
                            result = eval(num_expression)
                            result, adv_comment = self.cal_advantage(result, advantage)
                            # print(result)
                            # print(num_expression)

                            # formula_add.remove(formula_add.count() - 1)
                            if info != None:
                                info_ = info
                                info = None
                                comment = self.skill_check(info_, result)
                                # 执行算式
                                return f"{num_expression}={result}/{info_}：{comment}"
                            else:
                                # 执行算式
                                return f"{num_expression}={result}"
                        seen_letters.add(char)
                    else:
                        pass
                # if(只有一个d)
                print("one D with +/-")
                # 使用正则表达式分割中文、英文和数字
                parts = re.findall(r'[A-Za-z]+|\d+|[\u4e00-\u9fa5]+|[+\-*/()]', expression)

                # 构建算式
                formula_dice = ''.join(parts[0:3])
                # 解析表达式
                parts_ = formula_dice.split('d')
                num_rolls = int(parts_[0])
                num_faces = int(parts_[1])
                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                formula_add = str(result) + parts[3] + parts[4]
                result = eval(formula_add)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info != None:
                    info_ = info
                    info = None
                    comment = self.skill_check(info_, result)
                    # 执行算式
                    return f"{formula_add}={result}/{info_}：{comment}"
                else:
                    # 执行算式
                    return f"{formula_add}={result}"
            else:
                print("one D no +/-")
                # 解析表达式
                parts = expression.split('d')
                num_rolls = int(parts[0])
                num_faces = int(parts[1])

                # 执行掷骰
                rolls = [random.randint(1, num_faces) for _ in range(num_rolls)]
                result = sum(rolls)
                result, adv_comment = self.cal_advantage(result, advantage)
                if info != None:
                    info_ = info
                    # print(info_)
                    info = None
                    if result <= 5 and info_ >= Critical_Success_SKill:
                        compare = "<"
                        comment = self.Critical_Success
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result == 1:
                        compare = "<"
                        comment = self.Critical_Success
                        upgrade = self.skill_upgrade(0, skill_name, role)
                    elif result <= info_ // 5:
                        compare = "<"
                        comment = self.Extreme_Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result <= info_ // 2:
                        compare = "<"
                        comment = self.Hard_Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result <= info_:
                        compare = "<"
                        comment = self.Success
                        upgrade = self.skill_upgrade(info_, skill_name, role)
                    elif result >= 96 and info_ < Fumble_SKill:
                        compare = ">"
                        comment = self.Fumble
                        upgrade = ""
                    elif result == 100:
                        compare = ">"
                        comment = self.Fumble
                        upgrade = ""
                    else:
                        compare = ">"
                        comment = self.Failure
                        upgrade = ""
                    # 执行算式
                    if num_rolls == 1:
                        return f"{result}/{info_}：{comment}\n\n{upgrade}"
                    else:
                        return f"{'+'.join(map(str, rolls))}={result}/{info_}：{comment}\n\n{upgrade}"
                else:
                    if num_rolls == 1:
                        return f"{result}"
                    else:
                        return f"{'+'.join(map(str, rolls))}={result}"
        except Exception as e:
            return f"Error: {e}"

    def move_time_forward(self, timer, auto=True):
        switch_dict = {
            "time_1s": self.add_time_1sec,
            "time_3s": self.add_time_3sec,
            "time_1min": self.add_time_1min,
            "time_5min": self.add_time_5min,
            "time_10min": self.add_time_10min,
            "time_30min": self.add_time_30min,
            "time_1h": self.add_time_1h,
            "time_3h": self.add_time_3h,
            "time_12h": self.add_time_12h,
            "time_1d": self.add_time_1d,
            "time_1w": self.add_time_1w,
        }
        # 使用 get 方法获取对应时间列表名的函数，如果不存在则返回一个默认函数
        time_function = switch_dict.get(timer, lambda: print("Invalid time list name"))
        # 执行函数
        time_function()
        if not auto and ("min" in timer or "h" in timer or "w" in timer or "d" in timer):
            timer_ = timer.replace("time_", "").replace("min", "分钟").replace("h", "小时").replace("d", "天").replace("w",
                                                                                                                  "周")
            env_text_ = self.ChatApp.send_env_text_to_log(sendText=False)
            self.ChatApp.search_and_delete_insert_symbol()
            self.ChatApp.chat_log.insert(tk.END,
                                         f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n时间已流逝【{timer_}】...现在是：\n{env_text_}\n\n')
            self.ChatApp.chat_log.yview(tk.END)
            self.ChatApp.random_discovery()

    def add_time_1sec(self):
        # 添加处理 time_1s 的代码
        global _secondsTime
        _secondsTime += 1
        while _secondsTime >= 60:
            self.add_time_1min()
            _secondsTime -= 60
        print(f"秒表：{_secondsTime}秒")

    def add_time_3sec(self):
        # 添加处理 time_3s 的代码
        global _secondsTime
        _secondsTime += random.randint(1, 3)
        while _secondsTime >= 60:
            self.add_time_1min()
            _secondsTime -= 60
        print(f"秒表：{_secondsTime}秒")
        # global time
        # time_format = "%H:%M"
        # base_time = datetime.strptime(time, time_format)
        # time = base_time + timedelta(seconds=3)
        # 将新时间格式化为字符串
        # time = time.strftime(time_format)
        # reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        # self.ChatApp.time_log.delete("1.0", tk.END)
        # self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        # print("Adding 1 minute")
        # if time == "23:59:57":
        # print("新的一天")
        # self.ChatApp.chat_log.insert(tk.END,
        # f'{self.ChatApp.role_entries_name["DiceBot"]} {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n新的一天到来了...现在是{date}\n\n')
        # 滚动到最底部
        # self.ChatApp.chat_log.yview(tk.END)

    def newday(self):
        self.add_time_1d()
        print("新的一天")
        env_text_ = self.ChatApp.send_env_text_to_log(sendText=False)
        self.ChatApp.search_and_delete_insert_symbol()
        self.ChatApp.chat_log.insert(tk.END,
                                     f'时空广播 {datetime.now().strftime("%Y/%m/%d %H:%M:%S")}\n新的一天到来了...\n{env_text_}\n\n')
        self.ChatApp.chat_log.yview(tk.END)

    def add_time_1min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=1)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 1 minute")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 59:
            self.newday()

    def add_time_5min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=5)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 5 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 55:
            self.newday()

    def add_time_10min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=10)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 10 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 50:
            self.newday()

    def add_time_30min(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(minutes=30)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 30 minutes")
        if int(datetime.strftime(base_time, "%H")) == 23 and int(datetime.strftime(base_time, "%M")) >= 30:
            self.newday()

    def add_time_1h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=1)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 60 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 23:
            self.newday()

    def add_time_3h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=3)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 180 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 21:
            self.newday()

    def add_time_12h(self):
        # 添加处理 time_1min 的代码
        global time
        time = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[0]).replace("【时间】", "")
        time_format = "%H:%M"
        base_time = datetime.strptime(time, time_format)
        time = base_time + timedelta(hours=12)
        # 将新时间格式化为字符串
        time = time.strftime(time_format)
        reply = "【地点】" + str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【地点】")[1])
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, "【时间】" + time.upper() + reply)
        print("Adding 720 minutes")
        if int(datetime.strftime(base_time, "%H")) >= 12:
            self.newday()

    def add_time_1d(self):
        # 添加处理 time_1min 的代码
        for r in self.ChatApp.roles:
            self.ChatApp.reset_san_cal_status(r)
        global date
        time_format = "%Y/%m/%d %A"
        base_time = datetime.strptime(date, time_format)
        date = base_time + timedelta(days=1)
        # 将新时间格式化为字符串
        date = date.strftime(time_format)
        reply = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【日期】")[0]) + "【日期】"
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, reply + date)
        print("Adding 1 day")

    def add_time_1w(self):
        # 添加处理 time_1min 的代码
        global date
        time_format = "%Y/%m/%d %A"
        base_time = datetime.strptime(date, time_format)
        date = base_time + timedelta(days=7)
        # 将新时间格式化为字符串
        date = date.strftime(time_format)
        reply = str(self.ChatApp.time_log.get("1.0", tk.END).strip().split("【日期】")[0]) + "【日期】"
        self.ChatApp.time_log.delete("1.0", tk.END)
        self.ChatApp.time_log.insert(tk.END, reply + date)
        print("Adding 7 days")


class DraggableItem:
    def __init__(self, canvas, x, y, width, height, fill=None, image=None, outline=None, label=None, label2=None,
                 type=None, frame=None, secret=None, tuceng=None):
        global frame_Map
        global frames_Map
        global current_frame_map

        rgba_color = "#000000"  # 黑色
        alpha = 128  # 50% 的透明度
        # self.rgba_color_with_alpha = rgba_color + "{:02x}".format(alpha)   # 添加透明度
        self.rgba_color_with_alpha = fill
        self.canvas = canvas
        self.width = width
        self.height = height
        self.anchor = None
        self.resize_anchor = None
        self.label = label
        self.label2 = label2
        self.itemType = type
        self.image_references = []
        self.frame = frame
        self.image = image

        if image:
            if tuceng:
                if tuceng == "y":
                    self.item = canvas.create_image(x, y, image=image, tags="draggable")
                    self.canvas.tag_lower(self.item)
                else:
                    self.item = canvas.create_image(x, y, image=image, tags="draggable")
            else:
                self.item = canvas.create_image(x, y, image=image, tags="draggable")
            if self.itemType == "image_animate" or self.itemType == "image_temp_animate" or self.itemType == "DiceBotImage_animate":
                # 播放 GIF 动画
                # print(current_frame_map)
                self.animate_on_map(0, self.canvas, self.item,
                                    frames_map[self.frame])
            if label is not None and label2 is not None:
                self.label_below_image = tk.Label(self.canvas, text=label)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                self.label_below_image_canvas = self.canvas.create_window(x, y - 50, window=self.label_below_image,
                                                                          anchor=tk.NW)

                # label_below_image2 = tk.Label(self.canvas, text=label2, relief=tk.SUNKEN)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                # self.label_below_image_canvas2 = self.canvas.create_window(x - 35, y+45, window=label_below_image2,
                # anchor=tk.NW)
                self.label_below_image_canvas2 = canvas.create_text(x, y + 70, text=label2, font=("Arial", 10),
                                                                    fill="black",
                                                                    tags="draggable")
                self.label_below_image_canvas2_edit = canvas.create_text(x - 45, y + 70, text="❤", font=("Arial", 10),
                                                                         fill="black",
                                                                         tags="draggable")
                # if label2 is not None:
                # self.label_below_image_canvas = canvas.create_text(x + 50, y + 50, text=label2, font=("Arial", 5),
                # fill="black",
                # tags="draggable")
            elif label is None and label2 is not None:
                self.label_below_image = tk.LabelFrame(self.canvas)
                self.label_below_image_canvas = self.canvas.create_window(x, y - 50, window=self.label_below_image,
                                                                          anchor=tk.NW)
                if secret == "y":
                    self.label_below_image_canvas2 = canvas.create_text(x, y + 25, text=label2, font=("Arial", 10),
                                                                        fill="",
                                                                        tags="draggable")
                    self.label_below_image_canvas2_edit = canvas.create_text(x, y + 30, text="___", font=("Arial", 10),
                                                                             fill="black",
                                                                             tags="draggable")
                else:
                    self.label_below_image_canvas2 = canvas.create_text(x, y + 25, text=label2, font=("Arial", 10),
                                                                        fill="black",
                                                                        tags="draggable")
                    self.label_below_image_canvas2_edit = canvas.create_text(x, y + 30, text="___", font=("Arial", 10),
                                                                             fill="black",
                                                                             tags="draggable")
                self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<ButtonPress-2>", self.on_resize_img)
                self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<B2-Motion>", self.on_right_drag_img)

            else:
                self.label_below_image_canvas = None
                self.label_below_image_canvas2 = None
                self.label_below_image_canvas2_edit = None
        else:
            self.label_below_image_canvas2_edit = None

            if type == "rectangle":
                self.item = canvas.create_rectangle(x, y, x + width, y + height, fill=self.rgba_color_with_alpha,
                                                    outline=outline,
                                                    tags="draggable")
            elif type == "circle":
                self.item = canvas.create_oval(x, y, x + width, y + width, fill=self.rgba_color_with_alpha,
                                               outline=outline,
                                               tags="draggable")
            elif type == "oval":
                self.item = canvas.create_oval(x, y, x + width, y + height, fill=self.rgba_color_with_alpha,
                                               outline=outline,
                                               tags="draggable")
            elif type == "polygon3":
                x1 = x - width / 2
                y1 = y + height
                x2 = x + width / 2
                y2 = y + height
                points = [x, y, x1, y1, x2, y2]
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon5":
                points = []
                for i in range(5):
                    angle = math.radians(90 + i * 360 / 5)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon6":
                points = []
                for i in range(6):
                    angle = math.radians(30 + i * 360 / 6)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygon8":
                points = []
                for i in range(8):
                    angle = math.radians(45 + i * 360 / 8)
                    points.append(x + width * math.cos(angle))
                    points.append(y + width * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")
            elif type == "polygonStar":
                points = []
                for i in range(5):
                    angle = math.radians(90 + i * 360 / 5)
                    if i % 2 == 0:
                        points.append(x + width * math.cos(angle))
                        points.append(y + width * math.sin(angle))
                    else:
                        points.append(x + width / 2 * math.cos(angle))
                        points.append(y + width / 2 * math.sin(angle))
                self.item = canvas.create_polygon(points, fill=self.rgba_color_with_alpha, outline=outline,
                                                  tags="draggable")

            elif type == "line":
                self.item = canvas.create_line(x, y, x + width, y + height, fill="black",
                                               tags="draggable")

            elif type == "text":
                self.item = canvas.create_text(x + 50, y + 50, text=label, font=("Arial", 12), fill="black",
                                               tags="draggable")

            self.itemType = type
            if label is not None:
                # label_below_image = tk.Label(self.canvas, text=label)
                # self.label_below_image.pack()
                # self.label_below_image.place(x=x - 50, y=y + 60)  # Adjust the position as needed
                # self.label_below_image_canvas = self.canvas.create_window(x, y, window=label_below_image, anchor=tk.NW)
                self.label_below_image2 = tk.Label(self.canvas, text=label2)
                if label2 is not None:
                    self.itemType = "text_PC"
                    self.label_below_image_canvas2 = self.canvas.create_window(x + 50, y - 10,
                                                                               window=self.label_below_image2,
                                                                               anchor=tk.NW)
                    self.canvas.itemconfig(self.item, text=label2, fill="black")

                else:
                    self.label_below_image_canvas2 = None
                if type == "text":
                    self.label_below_image_canvas = canvas.create_text(x + 30, y + 35, text="❤", font=("Arial", 10),
                                                                       fill="black",
                                                                       tags="draggable")
                else:
                    self.label_below_image_canvas = canvas.create_text(x + 10, y - 5, text=label, font=("Arial", 10),
                                                                       fill="black",
                                                                       tags="draggable")

            else:
                self.label_below_image_canvas = None
                self.label_below_image_canvas2 = None

        self.canvas.tag_bind(self.item, "<ButtonPress-1>", self.on_press)
        self.canvas.tag_bind(self.item, "<B1-Motion>", self.on_drag)
        self.canvas.tag_bind(self.item, "<ButtonPress-3>", self.on_right_press)

        if self.label_below_image_canvas:
            self.canvas.tag_bind(self.label_below_image_canvas, "<ButtonPress-1>", self.on_tag_press)
            self.canvas.tag_bind(self.label_below_image_canvas, "<ButtonPress-2>", self.on_resize)
            self.canvas.tag_bind(self.label_below_image_canvas, "<B2-Motion>", self.on_right_drag)
        if self.label_below_image_canvas2_edit != None:
            self.canvas.tag_bind(self.label_below_image_canvas2_edit, "<ButtonPress-1>", self.on_tag_press)

    def config(self, **kwargs):
        # 遍历关键字参数，设置对象的属性
        for key, value in kwargs.items():
            setattr(self, key, value)
        if self.itemType == "text":
            #self.label_below_image.config(text=self.label)
            #self.label_below_image_canvas.config(text=self.label)
            #self.canvas.itemconfig(self.item, text=self.label, fill="black")
            pass
        elif self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            self.label_below_image.config(text=self.label)
            self.canvas.itemconfig(self.label_below_image_canvas2, text=self.label2, fill="black")
        elif self.itemType == "text_PC":
            self.label_below_image2.config(text=self.label)
            self.canvas.itemconfig(self.item, text=self.label2, fill="black")
        else:
            self.label_below_image.config(text=self.label)
            self.canvas.itemconfig(self.label_below_image_canvas, text=self.label, fill="black")
        self.canvas.itemconfig(self.item, image=self.image)

    def on_tag_press(self, event):
        # 弹出输入窗口并获取用户输入的文本
        # print("text")
        if self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            intiText = self.label2
        else:
            if self.itemType == "text":
                text = self.canvas.itemcget(self.item, "text")
            elif self.itemType == "text_PC":
                text = self.label2
            else:
                text = self.canvas.itemcget(self.label_below_image_canvas, "text")
            if text:
                intiText = text
            else:
                intiText = "标签"
        new_text = simpledialog.askstring("Input", "Enter new text:", initialvalue=intiText)
        secret = "n"
        if new_text:
            secret = simpledialog.askstring("隐藏？", "是否隐藏标签文字（y/n）:", initialvalue="n")
            if self.itemType == "text":
                if secret == "y":
                    self.canvas.itemconfig(self.item, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.item, text=new_text, fill="black")
            elif self.itemType == "image" or self.itemType == "image_temp" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
                if secret == "y":
                    self.canvas.itemconfig(self.label_below_image_canvas2, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.label_below_image_canvas2, text=new_text, fill="black")
                self.label2 = new_text
            else:
                if secret == "y":
                    self.canvas.itemconfig(self.label_below_image_canvas, text=new_text, fill="")
                else:
                    self.canvas.itemconfig(self.label_below_image_canvas, text=new_text, fill="black")

    def on_resize(self, event):
        # self.resize_anchor = event.x - 100, event.y - 50
        self.resize_anchor = self.canvas.coords(self.item)[:2]  # 获取图像左上角的坐标
        label_coords = self.canvas.coords(self.label_below_image_canvas)
        # self.resize_anchor = (self.resize_anchor[0] + label_coords[0], self.resize_anchor[1] + label_coords[1])
        pass

    def on_resize_img(self, event):
        # print("中键")
        # self.resize_anchor = event.x, event.y
        self.resize_anchor = self.canvas.coords(self.item)[:2]
        label_coords = self.canvas.coords(self.label_below_image_canvas2_edit)
        # self.resize_anchor = (self.resize_anchor[0] + label_coords[0], self.resize_anchor[1] + label_coords[1])
        pass

    def on_right_drag(self, event):
        if self.itemType == "text" or self.itemType == "text_PC":
            delta_x = event.x - self.start_x
            delta_y = event.y - self.start_y
            self.canvas.move(self.item, delta_x, delta_y)
            if self.label_below_image_canvas is not None:
                self.canvas.move(self.label_below_image_canvas, delta_x, delta_y)
                if self.label_below_image_canvas2 != None:
                    self.canvas.move(self.label_below_image_canvas2, delta_x, delta_y)
                    if self.label_below_image_canvas2_edit != None:
                        self.canvas.move(self.label_below_image_canvas2_edit, delta_x, delta_y)
            self.start_x = event.x
            self.start_y = event.y
            # dx = event.x - self.anchor[0]
            # dy = event.y - self.anchor[1]
            # self.canvas.move(self.item, dx, dy)
            self.anchor = event.x, event.y
            self.resize_anchor = event.x, event.y
        else:
            if self.resize_anchor:
                dx = event.x - self.resize_anchor[0]
                dy = event.y - self.resize_anchor[1]
                self.width += dx
                self.height += dy
                self.canvas.coords(self.item, self.canvas.coords(self.item)[0],
                                   self.canvas.coords(self.item)[1], self.width, self.height)
                self.resize_anchor = event.x, event.y

    def on_right_drag_img(self, event):
        if self.resize_anchor:
            dx = event.x - self.resize_anchor[0]
            dy = event.y - self.resize_anchor[1]
            self.width += dx
            self.height += dy
            x1, y1 = self.canvas.coords(self.item)[:2]  # 获取图像左上角的坐标
            # self.canvas.coords(self.item, x1, y1, x1+ self.width, y1+ self.height)
            self.canvas.scale(self.item, 0, 0, 1 + dx / self.width, 1 + dy / self.height)
            # self.canvas.itemconfig(self.item, width=self.width, hight=self.height)
            # self.canvas.delete(self.item)  # 删除旧的图像对象
            # 创建一个新的图像对象，并设置新的大小
            # self.item = self.canvas.create_image(x1, y1, image=your_image, tags="draggable")
            self.resize_anchor = event.x, event.y

    def apng_to_gif(self, apng_file, gif_file):
        # 使用 apng2gif 工具将 APNG 转换成 GIF
        subprocess.run(["apng2gif", apng_file, gif_file])
        return gif_file

    def animate_on_map(self, frame_index, canvas, current_frame, frames):
        # print(str(frame_index)+"/" + str(len(frames)))
        # 更新当前帧
        canvas.itemconfig(current_frame, image=frames[frame_index])
        # canvas.create_image(20, 20, anchor=tk.NW, image=frames[frame_index])
        # 循环播放下一帧
        frame_index = (frame_index + 1) % len(frames)
        self.after_id = canvas.after(50, self.animate_on_map, frame_index, canvas, current_frame, frames)

    def move_cursor_to_avoid(self):
        global isOpeningFiles
        isOpeningFiles = True
        # self.canvas.unbind("<ButtonRelease-3>")
        # 获取屏幕的宽度和高度
        # screen_width, screen_height = pyautogui.size()
        # 将鼠标指针移动到右下角
        # pyautogui.moveTo(screen_width, screen_height)
        # 加载user32.dll
        user32 = ctypes.windll.user32
        # 获取屏幕的宽度和高度
        screen_width = user32.GetSystemMetrics(0)
        screen_height = user32.GetSystemMetrics(1)
        # 将鼠标移动到右下角
        # user32.SetCursorPos(screen_width-100, screen_height-100)
        user32.SetCursorPos(screen_width, screen_height - 500)

    def on_right_press(self, event):
        global isOpeningFiles
        global frame_Map
        global frames_Map
        global current_frame_map
        global Is_fill
        global Is_square
        self.anchor = event.x, event.y
        if (("polygon" in self.itemType) and self.itemType != "polygon3"):
            if Is_fill:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='white',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = False
            else:
                if Is_square:
                    draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, 100, 80, fill='',
                                                        outline='black', label='标签', type=self.itemType)
                    Is_square = False
                else:
                    draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                        random.randint(20, 150), fill='',
                                                        outline='black', label='标签', type=self.itemType)
                    Is_square = True
                Is_fill = True
        elif self.itemType == "image_temp" or self.itemType == "image_temp_animate":
            self.canvas.delete(self.item)
            self.canvas.delete(self.label_below_image_canvas2)
            self.canvas.delete(self.label_below_image_canvas)
            self.canvas.delete(self.label_below_image_canvas2_edit)
        elif self.itemType == "image" or self.itemType == "text_PC" or self.itemType == "image_temp_animate" or self.itemType == "image_animate":
            self.move_cursor_to_avoid()
            # 创建武器选择变量
            # t.sleep(1)
            avatar_path = filedialog.askopenfilename(title="为【" + self.label + "】选择战斗图片",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir="Images/BattleImages")
            if avatar_path:
                _, extension = os.path.splitext(avatar_path)
                filename, dot = os.path.splitext(os.path.basename(avatar_path))
                if os.path.exists(
                        'Images/BattleImages/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/BattleImages/' + filename + extension)
                if extension == ".apng" or extension == ".APNG":
                    avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
                if extension == ".gif" or extension == ".GIF":
                    image = Image.open(avatar_path)
                    width, height = image.size
                    frames_map[frame_Map] = [
                        ImageTk.PhotoImage(frame.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS))
                        for frame
                        in ImageSequence.Iterator(image)]
                    # 显示 GIF 图片的第一帧
                    current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                 image=frames_map[frame_Map][0],
                                                                 label=self.label,
                                                                 label2=self.label2, type="image_temp_animate",
                                                                 frame=frame_Map)
                    frame_Map += 1

                else:
                    with open(avatar_path, "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        image = image.resize((int(width * 0.25), int(height * 0.25)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image
                    image = tk.PhotoImage(file=avatar_path)
                    draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                    label=self.label,
                                                    label2=self.label2, type="image_temp")

            # self.weapon_var = tk.StringVar(root)
            # self.weapon_var.set("请选择战斗图片")

            # 创建下拉列表
            # self.weapon_menu = tk.OptionMenu(root, self.weapon_var, "剑", "盾", "长矛")
            # self.weapon_menu.pack()

            # 创建按钮，用于确认选择
            # self.select_weapon_button = tk.Button(root, text="选择", command=self.select_weapon)
            # self.select_weapon_button.pack()
            isOpeningFiles = False

        elif self.itemType == "DiceBotImage":
            self.move_cursor_to_avoid()
            # t.sleep(1)
            avatar_path = filedialog.askopenfilename(title="载入图片",
                                                     filetypes=[("Image files", "*.png;*.jpg;*.jpeg;*.apng;*.gif")],
                                                     initialdir="Images/MapMarkers")
            if avatar_path:
                labeltext = simpledialog.askstring("图片标签", "输入标签文字（可留空）:", initialvalue="")
                secret = "n"
                if labeltext:
                    secret = simpledialog.askstring("隐藏？", "是否隐藏标签文字（y/n）:", initialvalue="n")
                suofang = int(simpledialog.askstring("大小", "输入图片大小阈值（可留空，默认50）:", initialvalue="50"))
                _, extension = os.path.splitext(avatar_path)
                filename, dot = os.path.splitext(os.path.basename(avatar_path))
                if os.path.exists(
                        'Images/MapMarkers/' + filename + extension):
                    pass
                else:
                    shutil.copyfile(avatar_path,
                                    'Images/MapMarkers/' + filename + extension)
                if extension == ".apng" or extension == ".APNG":
                    avatar_path = self.apng_to_gif(avatar_path, _ + ".gif")
                if extension == ".gif" or extension == ".GIF":
                    image = Image.open(avatar_path)
                    width, height = image.size
                    if width >= suofang and height >= suofang:
                        percentage_w = suofang / width
                        percentage_h = suofang / height
                        percentage = min(percentage_w, percentage_h)
                        image = image.resize((int(width * percentage), int(height * percentage)), Image.LANCZOS)
                        width, height = image.size
                    if max([width, height]) >= 500:
                        tuceng = simpledialog.askstring("图层", "是否置于底层（y/n）:", initialvalue="y")
                    else:
                        tuceng = "n"
                    frames_map[frame_Map] = [
                        ImageTk.PhotoImage(frame.resize((int(width * 0.8), int(height * 0.8)), Image.LANCZOS))
                        for frame
                        in ImageSequence.Iterator(image)]
                    # 显示 GIF 图片的第一帧
                    if tuceng == "y":
                        current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                     image=frames_map[frame_Map][0],
                                                                     label2=labeltext, type="image_temp_animate",
                                                                     secret=secret,
                                                                     frame=frame_Map, tuceng="y")
                    else:
                        current_frame_map[frame_Map] = DraggableItem(self.canvas, event.x, event.y, 10, 10,
                                                                     image=frames_map[frame_Map][0],
                                                                     label2=labeltext, type="image_temp_animate",
                                                                     secret=secret,
                                                                     frame=frame_Map)
                    frame_Map += 1

                else:
                    with open(avatar_path, "rb") as f:
                        image = Image.open(f)
                        width, height = image.size
                        if width >= suofang and height >= suofang:
                            percentage_w = suofang / width
                            percentage_h = suofang / height
                            percentage = min(percentage_w, percentage_h)
                            image = image.resize((int(width * percentage), int(height * percentage)), Image.LANCZOS)
                            width, height = image.size
                        if max([width, height]) >= 500:
                            tuceng = simpledialog.askstring("图层", "是否置于底层（y/n）:", initialvalue="y")
                        else:
                            tuceng = "n"
                        image = image.resize((int(width * 0.8), int(height * 0.8)), Image.LANCZOS)
                        photo = ImageTk.PhotoImage(image)
                        # circle = self.canvas.create_oval(x - radius, y - radius, x + radius, y + radius, fill='', outline="black", width=2)
                        # self.canvas.create_image(x, y, image=photo)
                        # 保持对图像的引用，防止被垃圾回收
                        # self.canvas.image = photo
                        # Keep references to all images
                        self.image_references.append(photo)
                        # Create draggable image
                    image = tk.PhotoImage(file=avatar_path)
                    if tuceng == "y":
                        draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                        label2=labeltext, secret=secret, type="image_temp", tuceng="y")
                    else:
                        draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=photo,
                                                        label2=labeltext, secret=secret, type="image_temp")
            isOpeningFiles = False
        else:
            if Is_fill:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='white',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = False
            else:
                draggable_rectangle = DraggableItem(self.canvas, event.x + 2, event.y + 2, random.randint(20, 150),
                                                    random.randint(20, 150), fill='',
                                                    outline='black', label='标签', type=self.itemType)
                Is_fill = True

        # def select_weapon(self, event):
        # weapon = self.weapon_var.get()

        # 根据选择的武器加载相应的图片
        # if weapon:
        # if weapon == "剑":
        # 载入剑的图片
        # image = tk.PhotoImage(file="sword.gif")
        # elif weapon == "盾":
        # 载入盾的图片
        # image = tk.PhotoImage(file="shield.gif")
        # elif weapon == "长矛":
        # 载入长矛的图片
        # image = tk.PhotoImage(file="spear.gif")
        # else:
        # 默认情况下，载入默认图片
        # image = tk.PhotoImage(file="default.gif")

        # 显示图片在 Canvas 上
        # draggable_image = DraggableItem(self.canvas, event.x, event.y, 10, 10, image=image, label=self.label,
        # label2=self.label2)

    def on_press(self, event):
        self.start_x = event.x
        self.start_y = event.y
        self.anchor = event.x, event.y
        self.resize_anchor = event.x - 100, event.y - 50
        # self.canvas.tag_lift(self.item)
        # if self.label_below_image_canvas is not None:
        # self.canvas.tag_lift(self.item)

    def on_drag(self, event):
        delta_x = event.x - self.start_x
        delta_y = event.y - self.start_y
        self.canvas.move(self.item, delta_x, delta_y)
        if self.label_below_image_canvas is not None:
            self.canvas.move(self.label_below_image_canvas, delta_x, delta_y)
            if self.label_below_image_canvas2 != None:
                self.canvas.move(self.label_below_image_canvas2, delta_x, delta_y)
                if self.label_below_image_canvas2_edit != None:
                    self.canvas.move(self.label_below_image_canvas2_edit, delta_x, delta_y)
        self.start_x = event.x
        self.start_y = event.y
        # dx = event.x - self.anchor[0]
        # dy = event.y - self.anchor[1]
        # self.canvas.move(self.item, dx, dy)
        self.anchor = event.x, event.y
        self.resize_anchor = event.x, event.y


class CanvasSaver:
    def __init__(self, canvas):
        self.canvas = canvas

    def save_canvas_state(self, filename):
        canvas_state = self.get_canvas_state()
        with open(filename, 'w') as f:
            json.dump(canvas_state, f, indent=4)
        # self.canvas.postscript(file=filename, colormode="color")

    def load_canvas_state(self, filename):
        with open(filename, 'r') as f:
            canvas_state = json.load(f)
        self.set_canvas_state(canvas_state)

    def get_canvas_state(self):
        canvas_state = {
            'items': []
        }
        for item in self.canvas.find_all():
            item_type = self.canvas.type(item)
            item_coords = self.canvas.coords(item)

            item_tags = self.canvas.gettags(item)
            canvas_state['items'].append({
                'type': item_type,
                'coords': item_coords,
                'tags': item_tags,
            })
            if item_type in ["rectangle", "oval"]:
                fill = self.canvas.itemcget(item, "fill")
                outline = self.canvas.itemcget(item, "outline")
                # text = self.canvas.itemcget(item, "text")
                canvas_state_detail = canvas_state.get("items", {})
                canvas_state_detail["fill"] = fill
                canvas_state_detail["outline"] = outline
                # canvas_state_detail["text"] = text
        return canvas_state

    def set_canvas_state(self, canvas_state):
        self.canvas.delete('all')
        for item_data in canvas_state['items']:
            item_type = item_data['type']
            item_coords = item_data['coords']
            item_tags = item_data['tags']
            if item_type == 'image':
                # Add your handling for image items
                pass
            else:
                self.canvas.create_polygon(item_coords, tags=item_tags)


class LoadNPCDialog(simpledialog.Dialog):
    def __init__(self, parent, title):
        super().__init__(parent, title)
        # self.NPC_information = NPC_information
        # self.ChatApp = None
        # self.ChatApp = chat_app_instance
        # print(NPC_information)

    def body(self, master):
        role_Chart_at_name_ = load_Chart_at_name().copy()
        role_Chart_ = load_Chart().copy()
        self.npcNames = []
        self.slots = []
        self.slots.append("新窗口...")
        self.npcNames.append("随机...")
        self.npcNames.append("新的预设...")
        for role, chart in role_Chart_at_name_.items():
            if "PL " not in role:
                self.npcNames.append(role)
        for role, chart in role_Chart_.items():
            self.slots.append(role)

        tk.Label(master, text="选择NPC：").grid(row=0, column=0, sticky="e")
        tk.Label(master, text="使用名：").grid(row=1, column=0, sticky="e")
        tk.Label(master, text="装载到：").grid(row=2, column=0, sticky="e")
        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()
        self.source_var = tk.StringVar()
        self.source_entry = tk.Entry(master, textvariable=self.source_var)

        first_roll_values = self.npcNames
        second_roll_values = self.slots
        self.first_roll_entry = ttk.Combobox(master, textvariable=self.trust_var, values=first_roll_values)
        self.second_roll_entry = ttk.Combobox(master, textvariable=self.importance_var, values=second_roll_values)

        self.first_roll_entry.grid(row=0, column=1)
        self.second_roll_entry.grid(row=2, column=1)
        self.source_entry.grid(row=1, column=1, padx=5, pady=5)

        return self.first_roll_entry

    def apply(self):
        first_roll = self.trust_var.get()
        second_roll = self.importance_var.get()
        source = self.source_var.get()
        self.result = {}
        self.result[first_roll] = source
        if second_roll == "":
            self.result["slot"] = "KP"
        else:
            self.result["slot"] = second_roll
        # print(self.result)
        return self.result


class MemoryInfoDialog(simpledialog.Dialog):
    def __init__(self, parent, title, information_sources, role):
        # self.ChatApp = chat_app_instance
        self.information_sources = information_sources
        super().__init__(parent, title)

    def body(self, master):
        tk.Label(master, text="信息来源：").grid(row=0, sticky="e")
        tk.Label(master, text="信息内容：").grid(row=1, sticky="e")
        tk.Label(master, text="信任度：").grid(row=2, sticky="e")
        tk.Label(master, text="重要度：").grid(row=3, sticky="e")

        self.source_var = tk.StringVar()
        self.content_var = tk.StringVar()
        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()

        self.source_entry = tk.Entry(master, textvariable=self.source_var)
        self.content_entry = tk.Entry(master, textvariable=self.content_var)

        trust_values = ["完全信任（0）", "基本信任（-1）", "有疑虑（-2）", "不信任（-3）", "质疑矛盾（-4）", "疑神疑鬼（-5）", "过度解读（+4）"]
        self.trust_combobox = ttk.Combobox(master, textvariable=self.trust_var, values=trust_values)

        importance_values = ["关键信息（5）", "相关信息（4）", "边缘信息（3）", "模糊信息（2）", "无用信息（1）"]
        self.importance_combobox = ttk.Combobox(master, textvariable=self.importance_var, values=importance_values)

        self.source_entry.grid(row=0, column=1, padx=5, pady=5)
        self.content_entry.grid(row=1, column=1, padx=5, pady=5)
        self.trust_combobox.grid(row=2, column=1, padx=5, pady=5)
        self.importance_combobox.grid(row=3, column=1, padx=5, pady=5)

        return self.source_entry

    def apply(self):
        self.result = {}
        source = self.source_var.get()
        content = self.content_var.get()
        trust = int(self.trust_combobox.get().split("（")[1][:-1])  # 提取括号中的数字
        importance = int(self.importance_combobox.get().split("（")[1][:-1])  # 提取括号中的数字

        # 计算记忆指数
        memory_index = trust + importance

        # 给出评分
        if memory_index <= -1:
            rating = "遗忘"
        elif memory_index <= 0:
            rating = "无用信息"
        elif memory_index == 2:
            rating = "模糊信息"
        elif memory_index == 3:
            rating = "边缘信息"
        elif memory_index == 4:
            rating = "相关信息"
        else:
            rating = "关键信息"

        self.result["信息来源"] = source
        self.result["信息内容"] = content.replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
        self.result["记忆指数"] = memory_index
        self.result["评分"] = rating
        print(f"信息来源: {source}, 信息内容: {content}, 信任度: {trust}, 重要度: {importance}, 记忆指数: {memory_index}, 评分: {rating}")
        return self.result


class MemoryInfoDialog_public(simpledialog.Dialog):
    def __init__(self, parent, title, role):
        # self.ChatApp = chat_app_instance
        super().__init__(parent, title)

    def body(self, master):
        tk.Label(master, text="信息来源：").grid(row=0, sticky="e")
        tk.Label(master, text="信息内容：").grid(row=1, sticky="e")
        tk.Label(master, text="共享人(代号)：").grid(row=2, sticky="e")
        tk.Label(master, text="评论：").grid(row=3, sticky="e")

        self.source_var = tk.StringVar()
        self.content_var = tk.StringVar()
        self.person_var = tk.StringVar()
        self.comment_var = tk.StringVar()

        self.source_entry = tk.Entry(master, textvariable=self.source_var)
        self.content_entry = tk.Entry(master, textvariable=self.content_var)
        self.person_entry = tk.Entry(master, textvariable=self.person_var)
        # 在 Entry 中显示默认值
        self.person_entry.insert(0, "KP")
        self.comment_entry = tk.Entry(master, textvariable=self.comment_var)

        self.source_entry.grid(row=0, column=1, padx=5, pady=5)
        self.content_entry.grid(row=1, column=1, padx=5, pady=5)
        self.person_entry.grid(row=2, column=1, padx=5, pady=5)
        self.comment_entry.grid(row=3, column=1, padx=5, pady=5)

    def apply(self):
        self.result = {}
        source = self.source_var.get()
        content = self.content_var.get()
        person = self.person_var.get()
        comment = self.comment_var.get()

        self.result["信息来源"] = source
        self.result["信息内容"] = content.replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
        self.result["共享人"] = person
        if comment:
            self.result["评论"] = comment.replace(".", ".\n").replace("。", "。\n").replace("\n\n", "\n")
        else:
            self.result["评论"] = "HO共同信息"
        return self.result


class DiceRollDialog(simpledialog.Dialog):
    def __init__(self, parent, title=None):
        super().__init__(parent, title)
        self.ChatApp = None
        # self.ChatApp = chat_app_instance

    def randomize_info(self):
        global room_info_search
        global room_info_list
        if len(room_info_list) > 0 and len(room_info_search) > 0:
            room_list = []
            for room, value in room_info_search.items():
                room_info_search[room]["信息"].clear()
                room_list.append(room)
            for content, type in room_info_list.items():
                room_info_search[random.choice(room_list)]["信息"][content] = type

    def upload_info(self):
        global room_info_list
        room_info_list[self.content_var.get()] = self.info_type_var.get()
        self.info_type_var.set("")
        self.content_var.set("")
        self.randomize_info()

    def clear(self):
        global room_info_search
        global room_info_list
        room_info_search.clear()
        room_info_list.clear()

    def upload_room(self, master):
        global room_info_search
        room_info_search[self.roomname_var.get()] = {"类型": self.room_var.get(), "扩散": int(self.kuosan_var.get()), "信息": {}}
        self.room_var.set("")
        self.roomname_var.set("")
        self.kuosan_var.set("")
        self.searched_room_name_list = []
        for roomnames, value in room_info_search.items():
            self.searched_room_name_list.append(roomnames)
        self.searched_room_name = ttk.Combobox(master, textvariable=self.searched_room_name_var,
                                               values=self.searched_room_name_list)
        self.searched_room_name.grid(row=11, column=1, sticky="e")
        self.randomize_info()

    def search_room(self):
        global room_info_search
        global room_info_list
        if self.searched_room_name_var.get() != "" and len(room_info_list) > 0:
            self.result_text_.delete("1.0", tk.END)
            if self.adjust_var.get() == "":
                self.adjust_var.set("0")
            if len(room_info_search[self.searched_room_name_var.get()]["信息"]) >= random.randint(1, room_info_search[self.searched_room_name_var.get()]["扩散"]-int(self.adjust_var.get())):
                _list = []
                for i, c in room_info_search[self.searched_room_name_var.get()]["信息"].items():
                    _list.append(i)
                infocontent = random.choice(_list)
                infotype = room_info_search[self.searched_room_name_var.get()]["信息"][infocontent]

                room_info_search[self.searched_room_name_var.get()]["信息"].pop(infocontent)
                room_info_list.pop(infocontent)
                self.result_text_.insert(tk.END, f"发现了一个[{infotype}]！：{infocontent}\n(房间内余{len(room_info_search[self.searched_room_name_var.get()]['信息'])}，共余{len(room_info_list)})。")
            else:
                self.result_text_.insert(tk.END, f"本次搜查未找到任何信息！(房间内余{len(room_info_search[self.searched_room_name_var.get()]['信息'])}，共余{len(room_info_list)})！")
                room_info_search[self.searched_room_name_var.get()]["扩散"] -= 1
        elif self.searched_room_name_var.get() == "":
            self.result_text_.insert(tk.END, "\n请选择房间！")
        elif len(room_info_list) <= 0:
            self.result_text_.insert(tk.END, f"\n所有信息已找到(余{len(room_info_list)})！")

    def selected_info_type(self):
        global room_info_list
        info_list = []
        for content, type in room_info_list.items():
            info_list.append(content)
        if "自定义" in self.info_type_var.get():
            self.content_var.set(f"信息#{str(len(info_list)+1)}")
            #self.content_entry.config(initialvalue=self.content_var.get())
        else:
            self.content_var.set(f"{self.info_type_var.get()}#{str(len(info_list) + 1)}")
            #self.content_entry.config(initialvalue=self.content_var.get())

    def selected_room(self):
        if self.room_var.get() in self.room_values_dic:
            self.kuosan_var.set(self.room_values_dic[self.room_var.get()])
            #self.kuosan_entry.config(initialvalue=self.kuosan_var.get())
        room_list = []
        if "自定义" in self.room_var.get():
            for room, value in room_info_search.items():
                if "自定义房间" in room:
                    room_list.append(room)
            self.roomname_var.set("自定义房间" + "#" + str(len(room_list)+1))
        else:
            for room, value in room_info_search.items():
                if self.room_var.get() in room:
                    room_list.append(room)
            self.roomname_var.set(self.room_var.get() + "#" + str(len(room_list)+1))
        #self.roomname_entry.config(initialvalue=self.roomname_var.get())

    def body(self, master):
        tk.Label(master, text="第一次掷骰结果：").grid(row=0, column=0, sticky="e")
        tk.Label(master, text="第二次掷骰结果：").grid(row=1, column=0, sticky="e")
        tk.Label(master, text="线索名（当前无效）：").grid(row=2, column=0, sticky="e")
        tk.Label(master, text="===情报扩散器").grid(row=3, column=0, sticky="e")
        tk.Label(master, text="编辑房间与情报===").grid(row=3, column=1, sticky="e")
        tk.Label(master, text="房间类型").grid(row=4, column=0, sticky="e")
        tk.Label(master, text="房间名").grid(row=5, column=0, sticky="e")
        self.roomname_var = tk.StringVar()
        self.roomname_entry = tk.Entry(master, textvariable=self.roomname_var)
        self.roomname_entry.grid(row=5, column=1, padx=5, pady=5)
        tk.Label(master, text="扩散度").grid(row=6, column=0, sticky="e")
        self.kuosan_var = tk.StringVar()
        self.kuosan_entry = tk.Entry(master, textvariable=self.kuosan_var)
        self.kuosan_entry.grid(row=6, column=1, padx=5, pady=5)
        tk.Label(master, text="情报类型").grid(row=7, column=0, sticky="e")
        tk.Label(master, text="情报内容").grid(row=8, column=0, sticky="e")
        self.content_var = tk.StringVar()
        self.content_entry = tk.Entry(master, textvariable=self.content_var)
        self.content_entry.grid(row=8, column=1, padx=5, pady=5)
        tk.Button(master, text="房间上传", command=lambda master=master: self.upload_room(master)).grid(row=9, column=0, padx=5, pady=5, sticky="nsew")
        tk.Button(master, text="信息上传", command=self.upload_info).grid(row=9, column=1, padx=5, pady=5, sticky="nsew")
        tk.Label(master, text="===情报扩散器").grid(row=10, column=0, sticky="e")
        tk.Label(master, text="开始使用===").grid(row=10, column=1, sticky="e")
        tk.Label(master, text="房间").grid(row=11, column=0, sticky="e")
        tk.Label(master, text="扩散调整").grid(row=12, column=0, sticky="e")
        self.adjust_var = tk.StringVar()
        self.adjust_var.set("0")
        self.adjust_entry = tk.Entry(master, textvariable=self.adjust_var)
        self.adjust_entry.grid(row=12, column=1, padx=5, pady=5)
        tk.Button(master, text="清空情报", command=self.clear, bg="red").grid(row=13, column=0, padx=5, pady=5, sticky="nsew")
        tk.Button(master, text="开始搜查", command=self.search_room).grid(row=13, column=1, padx=5, pady=5, sticky="nsew")
        self.result_text_ = tk.Text(master, wrap=tk.WORD, width=10, height=5, undo=True)
        self.result_text_.grid(row=14, column=0, sticky="nsew", columnspan=2)

        self.trust_var = tk.StringVar()
        self.importance_var = tk.StringVar()
        self.source_var = tk.StringVar()
        self.source_entry = tk.Entry(master, textvariable=self.source_var)

        first_roll_values = ["大失败（-20%）", "失败（10%）", "成功（100%）"]
        self.first_roll_entry = ttk.Combobox(master, textvariable=self.trust_var, values=first_roll_values)
        second_roll_values = ["放弃（0%）", "大失败（-80%）", "失败（-20%）", "成功（+20%）", "困难成功（+40%）", "极难成功（+60%）", "大成功（+100%）"]
        self.second_roll_entry = ttk.Combobox(master, textvariable=self.importance_var, values=second_roll_values)

        self.first_roll_entry.grid(row=0, column=1)
        self.second_roll_entry.grid(row=1, column=1)
        self.source_entry.grid(row=2, column=1, padx=5, pady=5)

        self.room_var = tk.StringVar()
        self.info_type_var = tk.StringVar()
        room_values = []
        self.room_values_dic = {"[自定义...]": 1, "卧室": 30, "书房": 20, "客厅": 40, "走廊/楼梯间": 5, "地下室": 5, "阁楼": 5, "浴室/卫生间": 10, "储藏库/车库": 30,
                           "花园/庭院/温室": 60, "阳台": 10, "厨房": 12, "秘密房间": 2}
        for room_, value_ in self.room_values_dic.items():
            room_values.append(room_)
        info_type_values = ["[自定义...]", "信函", "日记", "书籍", "杂志", "报纸", "地图", "日志", "纸条", "备忘", "残片", "画作", "照片", "笔记", "胶片", "录音", "网络"]
        self.room = ttk.Combobox(master, textvariable=self.room_var, values=room_values)
        self.room.bind("<<ComboboxSelected>>", lambda event: self.selected_room())
        self.info_type = ttk.Combobox(master, textvariable=self.info_type_var, values=info_type_values)
        self.info_type.bind("<<ComboboxSelected>>", lambda event: self.selected_info_type())
        self.room.grid(row=4, column=1)
        self.info_type.grid(row=7, column=1)

        self.searched_room_name_var = tk.StringVar()
        self.searched_room_name_list = []
        for roomnames, value in room_info_search.items():
            self.searched_room_name_list.append(roomnames)
        self.searched_room_name = ttk.Combobox(master, textvariable=self.searched_room_name_var, values=self.searched_room_name_list)
        self.searched_room_name.grid(row=11, column=1, sticky="e")

        return self.first_roll_entry

    def apply(self):
        first_roll = self.trust_var.get()
        second_roll = self.importance_var.get()
        source = self.source_var.get()

        # 根据规则计算最后的处理方案
        result_percentage = calculate_result_percentage(first_roll, second_roll)
        final_result = calculate_final_result(result_percentage)

        # 显示最终结果
        result_text = f"结果百分比：{result_percentage}\n处理方案：{final_result}\n\n===\n根据原模组信息总结至多五个关键词，按重要度排序，发放时按重要度低到高发放。\n" \
                      f"注意给出的关键词要是可探索、结合模组剧情的关键地点、物品、事件、人物等（一般重要度较低），或者是传达一种态度和推理思路（一般重要度最高）。\n" \
                      f"如果数量不够，则不提供任何关键词（比如只有一个关键地点，则在80%以上给出）如果信息过于简短，可以提前给出全部段落，负值同理；\n如果段落总结不出关键词，可以将关键词替换为句子。\n" \
                      f"注意虚假信息和无效信息是不一样的。无效信息在0%给出，虚假信息需要起到误导PC的作用（比如新增了一个地点，新增了一个人物，关键信息错误等） "
        messagebox.showinfo("处理方案", result_text)
        # self.ChatApp.add_inference2self(source, source + "的搜查进度", result_percentage, "DiceBot")

        print(result_text)


def calculate_result_percentage(first_roll, second_roll):
    # 根据规则计算可能的结果百分比
    # 请根据实际规则进行修改
    result_percentage = 0
    match = re.search(r'（(-?\+?\d+)%）', first_roll)
    if match:
        print(match.group(1))
        first_roll = int(match.group(1))
    match2 = re.search(r'（(-?\+?\d+)%）', second_roll)
    if match2:
        second_roll = int(match2.group(1))
    result_percentage = int(first_roll) + int(second_roll)
    return result_percentage


def calculate_final_result(result_percentage):
    # 根据可能的结果百分比计算最终处理方案
    # 请根据实际规则进行修改
    if result_percentage == -100:
        final_result = "虚假全部/5假词"
    elif result_percentage == -70:
        final_result = "虚假全部，留1真词"
    elif result_percentage == -40:
        final_result = "2真词1假词"
    elif result_percentage == -20:
        final_result = "2假词/1真2假/不提供"
    elif result_percentage == -10:
        final_result = "1假词/1真1假/不提供"
    elif result_percentage == 0:
        final_result = "不提供"
    elif result_percentage == 10:
        final_result = "1关键词"
    elif result_percentage == 20:
        final_result = "2关键词"
    elif result_percentage == 30:
        final_result = "3关键词"
    elif result_percentage == 40:
        final_result = "4关键词"
    elif result_percentage == 50:
        final_result = "5关键词"
    elif result_percentage == 70:
        final_result = "完整信息隐藏2关键词"
    elif result_percentage == 80:
        final_result = "完整信息隐藏1关键词"
    else:
        final_result = "完整信息"
    return final_result


# 从文件中读取 JSON 数据

def babel(self):
    global babel_on
    try:
        # 尝试加载自定义角色数值信息
        with open('GameSaves/巴别塔.json', 'r', encoding='utf-8') as file:
            self.babel_data = json.load(file)
        babel_on = True
    except FileNotFoundError:
        # 如果文件不存在，返回默认设置
        self.babel_data = {}
        babel_on = False
        print("未启用“巴别塔”模块, 配置好角色后，在GameSaves下新建以“{}”为内容的 巴别塔.json 以初始化")

    # 如果数据非空，则启用“巴别塔”模块
    if self.babel_data:
        babel_on = True
        print("启用“巴别塔”模块")
    elif babel_on == False:
        print("未启用“巴别塔”模块, 配置好角色后，在GameSaves下新建巴别塔.json以初始化")
    else:
        babel_on = False
        print("准备启用“巴别塔”模块，正在初始化，请核对 GameSaves/巴别塔.json，修改角色“母语”（{'母语':60}）为母语（{'英语':60, '母语':'英语'}），确认国籍并重启")
        self.babel_data = {}
        for role, info in role_Chart.items():
            data_ = {}
            home = -1
            for skill, percent in info.items():
                if "语" in skill:
                    if percent == "EDU":
                        data_[skill] = 0
                        data_["国籍"] = "地球"
                    else:
                        data_[skill] = percent
                        if home < int(percent):
                            data_["国籍"] = skill.replace("语", "") + "国"
            self.babel_data[self.role_entries_name[role]] = data_
        with open('GameSaves/巴别塔.json', 'w', encoding='utf-8') as file:
            json.dump(self.babel_data, file, indent=4, ensure_ascii=False)


def fire_babel(self, role):
    # 在 data 中获取角色信息
    print(f"===")
    global babel_on
    role = self.role_entries_name[role]
    if babel_on and (role in self.babel_data):
        lan_list = {}
        dic = self.babel_data[role]
        lan_main = str(dic["母语"]).replace("0", "英语")
        for language, skill in self.babel_data[role].items():
            if language != "母语" and language != "国籍":
                if skill >= 10:
                    lan_list[language] = skill
        for role2 in self.roles:
            role2 = self.role_entries_name[role2]
            if role2 != role and (role2 in self.babel_data):
                dic2 = self.babel_data[role2]
                # self.list_skills = []
                if lan_main in dic2:
                    # self.list_skills.append(lan_main)
                    if (dic2[lan_main] + dic[lan_main] >= 60) and dic2[lan_main] >= 10:
                        print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{lan_main}] 聊得很开心！")
                    else:
                        self.best_lan = "None"
                        self.best_lan_skill = 0
                        for language, skill in self.babel_data[role2].items():
                            if language != "母语" and language != "国籍":
                                if language in lan_list:
                                    if skill + lan_list[language] >= 80 and skill >= 20:
                                        print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{language}] 聊得很开心！")
                                        self.best_lan = "GOOD"
                                        break
                                    elif skill >= 5:
                                        if self.best_lan_skill < skill:
                                            self.best_lan = language
                                            self.best_lan_skill = skill
                        if self.best_lan != "None":
                            if self.best_lan == "GOOD":
                                pass
                            elif self.best_lan_skill <= 5:
                                print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么，但知道那可能是 [{self.best_lan}]，可以去请教一下别人！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 60 and self.best_lan_skill >= 50:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [母语({dic2[dic2['母语']]}): {dic2['母语']}] ！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 40 and self.best_lan_skill >= 30:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [困难母语({int(dic2[dic2['母语']] / 2)}): {dic2['母语']}] ！")

                            elif self.best_lan_skill + lan_list[self.best_lan] >= 10 and self.best_lan_skill > 5:
                                print(
                                    f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [极难母语({int(dic2[dic2['母语']] / 5)}): {dic2['母语']}] ！")
                            else:
                                print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                            self.best_lan = "None"
                            self.best_lan_skill = 0
                        else:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                else:
                    self.best_lan = "None"
                    self.best_lan_skill = 0
                    for language, skill in self.babel_data[role2].items():
                        if language != "母语" and language != "国籍":
                            if language in lan_list:
                                if skill + lan_list[language] >= 80 and skill >= 20:
                                    print(f"[巴别塔] 【{role2}】 和 【{role}】 用 [{language}] 聊得很开心！")
                                    self.best_lan = "GOOD"
                                    break
                                elif skill >= 5:
                                    if self.best_lan_skill < skill:
                                        self.best_lan = language
                                        self.best_lan_skill = skill
                    if self.best_lan != "None":
                        if self.best_lan == "GOOD":
                            pass
                        elif self.best_lan_skill <= 5:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么，但知道那可能是 [{self.best_lan}]，可以去请教一下别人！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 60 and self.best_lan_skill >= 50:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [母语({dic2[dic2['母语']]}): {dic2['母语']}] ！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 40 and self.best_lan_skill >= 30:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [困难母语({int(dic2[dic2['母语']] / 2)}): {dic2['母语']}] ！")

                        elif self.best_lan_skill + lan_list[self.best_lan] >= 10 and self.best_lan_skill > 5:
                            print(
                                f"[巴别塔] 啊哦！【{role2}】 好像听不懂 【{role}】 在说什么！请掷骰 [{self.best_lan}({self.best_lan_skill})] 或 [极难母语({int(dic2[dic2['母语']] / 5)}): {dic2['母语']}] ！")
                        else:
                            print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")
                        self.best_lan = "None"
                        self.best_lan_skill = 0
                    else:
                        print(f"[巴别塔] 啊哦！【{role2}】 好像怎么都听不懂 【{role}】 在说什么！")


if __name__ == "__main__":
    root = tk.Tk()
    app = ChatApp(root)
    root.protocol("WM_DELETE_WINDOW", app.on_closing)  # 捕获窗口关闭事件
    # root.protocol("WM_DELETE_WINDOW", self.new_window.on_closing)  # 捕获窗口关闭事件
    # root.wm_attributes('-transparentcolor', 'white')
    root.mainloop()
